[{"_id": "10", "_index": "cv", "_score": 4.064704, "_source": {"title": "Front End Web Developer", "title_score": 0.8, "experience": [{"title": "junior Front End Developer", "duration": 7, "description": "Junior Front End Developer role within the Digital Team, working in an Agile environment. Managing the website is at the core of our day-to-day activity. As a junior developer I use my knowledge to translate designs into code, by focusing on SEO standards, accessibility needs and cross-browser compatibility challenges. Using Umbraco as a CMS within the ASP.Net MVC environment, I usually write code in HTML5, SASS and Jquery/Javascript to meet the design Team and the stakeholders needs.", "score": 0.0}, {"title": "intern Front End Developer", "duration": 3, "description": "Front-end development and SEO internship using HTML5, CSS3, Javascript and jQuery. Mainly I have worked on the Company main website improving the development code and the design, designed and created the Careers and Competitions pages and working on the Homepage, introducing an Instagram feed slider among others (through Magento and Wordpress). I have also written the Company Ebay homepage following the main website design as well as few other projects. Besides my frontend tasks, I have also learned some SEO techniques to boost the website visibility and improve search engines ranking", "score": 0.0}]}, "skills": ["HTML5", "JavaScript", "Bootstrap", "MySQL", "Microsoft Office", "Microsoft Excel", "Magento", "SASS", "Cascading Style Sheets (CSS)"]}, {"_id": "2", "_index": "cv", "_score": 2.5298629, "_source": {"title": "Full-stack Web Developer ", "title_score": 0.8, "experience": [{"title": "Full stack web developer", "duration": 18, "description": "Self-employed, regularly taking jobs in web development for individuals or professionals. I learned to work with many different web technologies to satisfy my clients, by building strong and modern solutions. Those experiences have made me more and more familiar with full-stack web development and project management. Showcase website, Dynamic website, E-commerce, WordPress, Newsletters, Softwares, and others.  Technologies, CMS, frameworks and methodologies mainly used: ❯ PHP, Node.js, Express, Drupal 7 & 8, WordPress, PrestaShop ❯ MySQL, MongoDB, Elasticsearch, Memecached, Web services, 3rd-party APIs, CRM integration ❯ Html, Css, Sass, Js, AngularJS, Responsive design, Bootstrap ❯ Agile SCRUM, Git, Jenkins, Gulp, Drush, Composer, NPM Browser", "score": 0.5}, {"title": "Technical web developer", "duration": 4, "description": "❯ Conception and realisation of complex web applications ❯ PHP, Drupal 7 & 8, MySQL, Apache Solr, Memecached, Web services, 3rd-party APIs, CRM integration ❯ Html, Css, Sass, Js, AngularJS, Responsive design ❯ Agile SCRUM, Waterfall, GDS, Git, Jenkins, Drush, Composer, Gulp ❯ Client facing ❯ Analysis of the projects needs ❯ Estimates of the development charge ❯ Specifications writing  Reading Room is a digital agency based in London, specialized in the realisation of web services for major international clients. It is now part of the IDOX Group.  I worked on the realisation of web applications and services for major brands and institutions such as UK Government (UK Export Finance, MHRA), Ministry of Defence, Visit England, Škoda, Royal Marsden NHS, Newham Council, National Gallery of Ireland, Future London, Norfolk Constabulary, and others.", "score": 0.5}]}, "skills": ["AngularJS", "Node.js", "CSS", "MySQL", "MongoDB", "PostgreSQL", "WordPress", "Bootstrap", "Git", "Subversion", "Java", "C", "Android", "Windows", "Linux", "Microsoft Office", "Microsoft Excel", "Cascading Style Sheets (CSS)", "Drupal"]}, {"_id": "12", "_index": "cv", "_score": 2.4221892, "_source": {"title": "Full Stack Web Developer", "title_score": 0.8, "experience": [{"title": "Web Developer", "duration": 3, "description": "- Creation of a cloud platform to manage e-commerce resources. - Creating an innovative user experience.  Technology: PHP5, Zend Framework2, Amazon S3&EC2, Doctrine, Knockout.js, CSS3, HTML5, Bootstrap. ", "score": 0.5}]}, "skills": ["Node.js", "PHP", "Python", "Linux", "Angular.js", "HTML 5", "C++", "MySQL", "Git", "Java", "jQuery", "Django", "SASS", "Perl", "Core Java", "SQL", "XML", "Cascading Style Sheets (CSS)", "AngularJS", "HTML5"]}, {"_id": "13", "_index": "cv", "_score": 2.299321, "_source": {"title": "Senior Business Intelligence Developer", "title_score": 0.0, "experience": [{"title": "Senior Business Intelligence Developer", "duration": 14, "description": "Creation of a Data Warehouse: - Marketing & Finance Data Mart. - Designed the ETL using SSIS using Kimball design methodology and optimizing the Data Warehouse loading time (the legacy Data Warehouse was taking 2 hours every nights and the current one that I have designed from scratch takes less than 20 minutes and is being refreshed every hours). - Creation of SSAS cubes to feed Dashboards for the Marketing & Finance Senior Management Team. - Creation of Marketing Dashboard using SSRS and other marketing experience reports (Enquiry/Lead conversion) using MDX, etc.  Various reports such as: - Agreed Work Load By Fee Earners for the PI Client Intake Commitee. - Report Audit: List of the reports sorted by the frequency that they are being used and by who. - Created a SSIS package including a C# component that scan the Active Directory Tree and then create an Active Directory Database. The goal is to monitor the different level of authorisation each employee get allocated by the different I.T team in the UK. Modeling the outcome of our Marketing campaigns in terms using Data mining algorithms (using R) as well as providing various analysis on the variance of several metrics (such as the length of time it takes for matters to be opened, to become profitable, etc).  Optimization: - Optimizing Dashboard stored procedures using various indexing strategies as well as dynamical sql to control the use of the query plan cache. - Optimizing the loading of the DataWarehouse by exploiting parallel processing in SSIS and other various techniques (rewriting the package avoiding the use of lookups, etc).", "score": 0.0}, {"title": "Business Intelligence Developer", "duration": 41, "description": "My main role was to deal with the data migration projects. I was in charge of Migrating Data from legacy applications (legal account software such as Opsis, Osprey, Quill, SOS, Axxia, AlphaLaw, AIM, etc) into our legal account software (DPS Software). Here were my main activities: *Collect and analyse the project’s business requirements with the stakeholders *Create process to extract, transform and load (ETL) data from legacy systems using SSIS. *Investigate and rectify technical issues within the ETL process. *Interact with internal and external teams to troubleshoot any issue in data migration cycle. *Create and maintain technical documentation  My second role was to develop Business Intelligence services. I was working on a variety of greenfield projects for my firm as well as for our clients. My main activities: *MS BI Stack - SSIS , SSRS *Develop new BI services *Responsible for developing all the SSRS reports and dashboards (bespoke as well as the one that get included into our legal account software) *When required I assist the Software Developers in writing T-SQL (Stored Procedures, Functions, Triggers, etc) *Develop data warehouse to allow to create reports for the system engineers or the sales team. ", "score": 0.0}]}, "skills": ["SSRS", "C#", "SSIS", "T-SQL", "VBA", "R", "SQL Server Reporting Services (SSRS)", "VBA Excel", "Power BI", "Python"]}, {"_id": "4", "_index": "cv", "_score": 2.217527, "_source": {"title": "Data Engineer", "title_score": 0.0, "experience": [{"title": "Data Engineer", "duration": 19, "description": "The Big Data Engineer programme is a technical journey where I acquire through deep learning methodologies, knowledge and hands-on skills that will allow me to be productive within the business environment.  Courses and Accreditation  - Professional skills - Web applications and coding - GIT, GITHUB and Agile - Introduction to data analytics - Data modelling principles - SQL and T-SQL - Python and data munging techniques - NoSQL using MongoDB and Neo4j - Cloudera Hadoop Ecosystem including Sqoop, Pig & Flume - Apache Spark - Python  Accreditation - Cloudera CCA Developer - CISI IOC (Investment & Securities) ", "score": 0.0}]}, "skills": ["Github", "MongoDB", "Docker", "maven", "Big Data Analytics", "SQL", "Spark"]}]