{"title": "Data Engineer / Scientist", "company": "Skyline AI", "description": "Skyline AI is redefining the world’s approach to the $200 trillion commercial real estate industry by building data technology that will transform the market from the low-tech methods it’s been relying on for decades.\nHere at Skyline AI, our data is our fuel. We are constantly collecting new data sources, analyzing our many different types of data and extracting valuable information from it.\nWe are looking for a versatile software engineer to join our data group. This is one of the broadest and most influential roles in the company - touching our data sources, data processing algorithms, ML research, and being responsible for the orchestration system on which it all relies.\n\nAbout Skyline AI\nSkyline AI is an asset management technology company for commercial real estate. Skyline AI partners with leading commercial real estate firms to establish next-generation investment vehicles augmented by artificial intelligence. Mining data from over 130 different sources and applying advanced AI models to detect and exploit market anomalies, identify superior risk-reward investments, and discover untapped value-add opportunities, Skyline AI is a new, more precise way to invest in real estate. Founded in 2017, Skyline AI is backed by Sequoia Capital, JLL (NYSE: JLL), Nyca Partners and others. The company has offices in New York and Tel Aviv.\n\nResponsibilities\nMaintain and improve our in-house git-inspired data pipeline orchestration system\nWrite applications that fetch data by various means, including PDF parsing, HTML scraping, and more.\nPerform Real Estate analysis based on the data repository we are continuously growing\nExtract insights from our data, and generate predictions using data science techniques\nDevelop the algorithms which generate the datasets that are used by the whole R&D department\nQualifications\nProven software development ability, building complex and robust systems - at least 4 years\nProven analytical/research ability - data science, cyber-security, intelligence, academic, etc.\nData engineering experience (data pipelines, ML architecture) - advantage\nWeb scraping experience - advantage\nPython/Golang - advantage\nML libraries and tools (pandas, scikit-learn, jupyter notebook) - advantage\nTeam player, independent, able to work in an unstructured and fast-paced environment."}