{"title": "Data Scientist", "company": "Two Sigma Investments, LLC.", "description": "Two Sigma is a different kind of investment manager. Since 2001, we have used data science and technology to derive insights that forecast the future and discover value in markets worldwide. Our team of scientists, technologists and academics looks beyond traditional finance to understand the bigger picture and develop creative solutions to some of the world’s most challenging economic problems. Our work spans across markets and industries, from insurance and securities to private investments and new ventures.\n\nTwo Sigma is looking for Data Scientists from a variety of backgrounds to help propel and enhance its data-driven investment initiatives. As a Two Sigma Data Scientist, you will explore a breadth of challenges: identifying timely and unique data sets, diving deep into a diverse set of data domains, visualizing and exploring underlying data drivers, and developing data set features and forecasts.\n\nYou will take on the following responsibilities:\n\nApply statistical analysis & modeling techniques with finance intuition to datasets large and small, advance existing initiatives and open opportunities to pursue new and previously unexplored research topics across a wide variety of industries and domains\nOperate and extend the data science platform to deliver production-grade data curation and analysis services\nOwn end-to-end data workflows and develop deep domain expertise on the underlying actors and behaviors manifested through data\nVisualize and explore data sets to enable the ideation and generation of new, predictive feature\n\nYou should possess the following qualifications:\n\n3+ years of experience in data analysis or similar role\nAdvanced degree in Computer Science is preferred\nExperience applying statistical methods (distribution analysis, classification, clustering, etc.)\nStrong coding skills with data-frames are a prerequisite, example platforms include Pandas, R, Matlab, and Apache Spark Demonstrated experience highlighting innovation, creativity, and intuition, e.g the ability to laterally identify other sources of useful information and think 'outside the box'\nPrior Experience in finance is not required\n\nYou will enjoy the following benefits:\n\nCore Benefits: Fully paid medical and dental insurance premiums for employees and dependents, competitive 401k match, employer-paid life & disability insurance\nPerks: Onsite gyms with laundry service, wellness activities, casual dress, snacks, game rooms\nLearning: Tuition reimbursement, conference and training sponsorship\nTime Off: Generous vacation and unlimited sick days, competitive paid caregiver leaves\n\nWe are proud to be an equal opportunity workplace. We do not discriminate based upon race, religion, color, national origin, sex, sexual orientation, gender identity/expression, age, status as a protected veteran, status as an individual with a disability, or any other applicable legally protected characteristics."}