{"title": "Consultancy – Technical Expert, Data Scientist for Crisis Risk Analysis and Early Warning", "company": "United Nations Development Programme (UNDP)", "description": "UNDP’s Strategic Plan (2018-2021) recognizes the importance of contextual analysis, crisis prevention and recovery, and the management of multidimensional risks as fundamental for development. The Crisis Bureau is responsible for UNDP's corporate crisis-related strategies, vision and priorities for crisis prevention, response, and recovery. The Bureau supports policy and programme development in keys areas including Conflict Prevention and Peacebuilding, Rule of Law and Human Rights, Migration and Displacement, Livelihoods and Economic Recovery, and Disaster Risk Reduction and Recovery.\nOne of the areas of responsibility of UNDP’s Crisis Bureau is to ensure that UNDP is well positioned to anticipate and to respond in the timeliest and most effective manner to crisis, primarily regarding sudden onset crises and complex protracted crises, triggered by natural disasters or armed conflicts alike. The Crisis and Fragility Policy and Engagement Team provides crisis risk and early warning support to HQ and to Country Offices (COs) to address their needs in contextual risk analysis, adaptation, early action and—acknowledging unique contextual circumstances as well as unique CO requirements—provide tailored support.\nTo improve UNDP’s crisis risk analysis capabilities, the Crisis Bureau is exploring the targeted use of data science to harness new and emerging technologies such as machine learning / artificial intelligence and alternative data sources such as social media analytics and satellite imagery analysis, to support forecasting collective risks to human development (including risks of disasters, impact of climate change, risk of violent conflict and social unrest) in order to inform preventive action to mitigate the potential effects of crises on affected populations. As part of its supporting role, the Crisis Bureau has developed the Crisis Risk Dashboard (CRD), a platform that facilitates integrated risk analysis by drawing\nfrom diverse quantitative and qualitative data, transforming the data to analysis, and visualizing the resulting information as a resource for the organization to more effectively manage crisis-related risks, and to ensure development initiatives that are risk-informed.\nIn support of UNDP’s efforts to leverage data science for crisis risk analysis and early warning, the Crisis and Fragility Policy and Engagement Team is seeking a data science independent consultant (IC) to support the organization's early warning and crisis risk analysis capacities through the development and application of machine learning tools and capacities. In particular, the data science technical expert would engage in and facilitate the development and roll-out of machine learning tools as part of a partnership between UNDP and a significant private sector entity in the field.\n\n\n\nDuties and Responsibilities\n\n\nSummary of key functions:\nDeveloping machine learning models for crisis risk forecasting\nAdvise on and support machine learning application roll-out and scale-up via the CRD platform\nStocking-taking of existing data science practices, tools, experiences for crisis risk forecasting\nTraining / capacity development for adapting, integrating, and using data science tools / practices\n\nDeveloping machine learning models for crisis risk forecasting\nDevelop machine learning models to analyze quantitative and qualitative indicators as the basis for multi-factor and integrated risk analysis, including through the following:\nDeveloping of quantitative machine learning models applying structured and unstructured learning including but not limited to regressions, random forest models, clustering models;\nDeveloping, adapting and deploying natural language processing (NLP) applications including classification/categorization, topic modelling, sentiment analysis for open-source (social media, mainstream media, analytical reports, etc.) and internal data;\nWriting code and scripts to perform data cleaning, analysis and modeling;\nPerforming data discovery studies and software prototypes;\nAssist in developing new approaches to detecting events and trends within real-time data sources such as online media, social networks, incident tracking databases, imagery, geospatial data, etc.;\nTest the correlations between various risk factors, forecasting dependent crisis risk variables, and supporting hypothesis testing.\n\n2. Advise on and support machine learning application roll-out and scale-up via the CRD platform\nSupport the integration of machine learning models / scripts into CRD infrastructure and IM processes;\nImplement any software required for accessing and handling data appropriately;\nEnsure the effective integration of machine learning modules with other CRD components to support integrated risk analysis;\nDesign and support the creation of information products / dashboard that synthesize large amounts of information obtained from data science analysis techniques into insights relevant to development/humanitarian subject experts;\nSupport the development and adaptation of machine learning components for specific UNDP country office / HQ contexts;\nAdvise strategically about veracity and feasible applications of machine learning models for the purposes of crisis risk forecasting and prediction for decision-making.\n3.Stocking-taking of existing data science practices, tools, experiences for crisis risk forecasting\nConduct a mapping of approaches, experiences, tool, and applications of data science application for crisis risk analysis, forecasting, and prediction;\nIdentify new use cases for machine learning tools to support country-based crisis risk analysis (via CRD applications).4. Training / capacity development for adapting, integrating, and using data science tools and practices\nProvide substantive input on data science principles and applications toward the development of crisis risk analysis guidance and training materials;\nProvide technical/advisory support in the design and facilitation of data science components of crisis risk analysis trainings;\nProvide maintenance and end user technical support in issues relating to machine learning tools developed and integrated into the CRD;\nDevelop documentation for the configuration / translation of machine learning models for adapted applications during the process of tools roll-out and scale-up;\nPrepare presentations and communication materials as required.\nPerform other related duties as may be assigned by the Early Warning Programme Specialist.\nThe consultant will undertake the above activities on a continuing basis over the duration of the assignment.\n\n\nCompetencies\n\n\nDemonstrated data science / machine learning experience working in multidisciplinary projects between data/science/technology and development or humanitarian response is an asset;\nWillingness to evaluate and adopt the latest advances in AI, machine learning, predictive analysis and visualization. Demonstrated ability to translate between data/science/technology and international development and humanitarian experts is an asset;\nDesign of interfaces, human-computer interaction modeling, and usability testing (UI/UX design basics);\nKnowledge of Deep Learning, Neural Networks, Reinforcement Learning;\nProficiency in the use of information management and data visualization tools – particularly Microsoft SharePoint, SQL, Azure, GIS cartographic platforms, Tableau, Power BI, and big data platforms – is an asset;\nKnowledge of one or more UNDP’s areas of work (sustainable development, democratic governance, peacebuilding, climate and disaster resilience).\n\nCore Competencies:\nInnovation: Ability to make new and useful ideas work;\nEthics & Values: Demonstrating / Safeguarding Ethics and Integrity. Is familiar with and acts in accordance with the standard of conduct for international civil servants, ethics and UN/UNDP values;\nDeveloping & Empowering People/Coaching and Mentoring: Self-development, initiative-taking. Takes initiative and seeks opportunities to initiate action;\nWorking in Teams: Acting as a team player and facilitating team work. Works collaboratively with team members sharing information openly and displaying cultural awareness and sensitivity;\nCommunicating Information and Ideas: Facilitating and encouraging open communication in the team, communicating effectively. Uses tact and sensitivity when delivering sensitive information or resolving delicate issues;\nSelf-management & Emotional Intelligence: Creating synergies through self-control Fosters a positive outlook and maintains focus during period of stress and heavy work load, inspiring and guiding others towards goal achievement;\nKnowledge Sharing & Continuous Learning: Learning and sharing knowledge and encourage the learning of others. Actively seeks learning opportunities, adopting best practices created by others;\nAppropriate and Transparent Decision-making: Informed and transparent decision making. Makes decisions within his/her own span of control, recognizes issues requiring more advanced judgment and refers them to the appropriate level.\n\n\n\nRequired Skills and Experience\n\n\nAcademic qualifications:\nA minimum of a master’s degree or equivalent in computer science, statistics, applied mathematics, physics, computational epidemiology, economics, engineering or other related technical disciplines.\n\nExperience:\nAt least five years of progressively responsible professional experience in data analysis and visualization, preferably in the big data for development space is required;\nFamiliarity with analytical techniques from machine learning, artificial intelligence, and modeling of complex systems is required (quantitative and qualitative modeling);\nExperience coding algorithms (Python, R or an equivalent programming environment), data access, analysis and data visualization methodologies for social media data or any other big data source is required;\nExperience working with the UN system is an asset; relevant areas include crisis risk analysis, early warning, risk management, conflict prevention, and disaster risk reduction.\n\nLanguage:\nFluency in English, both oral and written, is required.\nWorking knowledge of French and/or Spanish is an asset.\nApplication Procedure\nThe application package containing the following (to be uploaded as one file):\nA cover letter with a brief description of why the Offer considers her/himself the most suitable for the assignment;\nPersonal CV or P11, indicating all past experience from similar projects and specifying the relevant assignment period (from/to), as well as the email and telephone contacts of at least three (3) professional references;\n\nNote: The above documents need to be scanned in one file and uploaded to the online application as one document.\nShortlisted candidates (ONLY) will be requested to submit a Financial Proposal.\nThe financial proposal should specify an all-inclusive daily fee (based on a 7 hour working day - lunch time is not included - and estimated 21.75 days per month).\nThe financial proposal must be all-inclusive and take into account various expenses that will be incurred during the contract, including: the daily professional fee; (excluding mission travel); living allowances at the duty station; communications, utilities and consumables; life, health and any other insurance; risks and inconveniences related to work under hardship and hazardous conditions (e.g., personal security needs, etc.), when applicable; and any other relevant expenses related to the performance of services under the contract.\nIf the Offeror is employed by an organization/company/institution, and he/she expects his/her employer to charge a management fee in the process of releasing him/her to UNDP under a Reimbursable Loan Agreement (RLA), the Offeror must indicate at this point, and ensure that all such costs are duly incorporated in the financial proposal submitted to UNDP.\nThe Financial Proposal is to be emailed as per the instruction in the separate email that will be sent to shortlisted candidates.\n\nEvaluation process\nApplicants are reviewed based on Required Skills and Experience stated above and based on the technical evaluation criteria outlined below. Applicants will be evaluated based on cumulative scoring. When using this weighted scoring method, the award of the contract will be made to the individual consultant whose offer has been evaluated and determined as:\nBeing responsive/compliant/acceptable; and\nHaving received the highest score out of a pre-determined set of weighted technical and financial criteria specific to the solicitation where technical criteria weighs 70% and Financial criteria/ Proposal weighs 30%.\n\nTechnical evaluation - Total 70% (70 points):\nCriteria 1. At least five years of progressively responsible professional experience in data analysis and visualization, preferably in the big data for development space; Maximum Points: 5;\nCriteria 2. Familiarity with analytical techniques from machine learning, artificial intelligence, and modeling of complex systems is required (quantitative and qualitative modeling); Maximum Points: 15;\nCriteria 3. Experience coding algorithms (Python, R or an equivalent programming environment), data access, analysis and data visualization methodologies for social media data or any other big data source; Maximum Points: 10;\nInterview: Maximum Points: 40\nHaving reviewed applications received, UNDP will invite the top three to five shortlisted candidates for interview. Please note that only shortlisted candidates will be contacted.\nCandidates obtaining a minimum of 70% (49 points) of the maximum obtainable points for the technical criteria (70 points) shall be considered for the financial evaluation.\nFinancial evaluation - Total 30% (30 points)\nThe following formula will be used to evaluate financial proposal:\np = y (µ/z), where\np = points for the financial proposal being evaluated\ny = maximum number of points for the financial proposal\nµ = price of the lowest priced proposal\nz = price of the proposal being evaluated\nContract Award\nCandidate obtaining the highest combined scores in the combined score of Technical and Financial evaluation will be considered technically qualified and will be offered to enter into contract with UNDP\nInstitutional arrangement\nThe consultant will work under the guidance and direct supervision of Corrado Scognamillo (Programme Specialist, Early Warning) and will be responsible for the fulfilment of the deliverables as specified above.\nPayment modality\nPayment to the Individual Contractor will be made based on the actual number of days worked, deliverables accepted and upon certification of satisfactory completion by the manager.\nThe work week will be based on 35 hours, i.e. on a 7 hour working day, with core hours being between 9h00 and 18h00 daily.\nAnnexes (click on the hyperlink to access the documents):\nAnnex 1 - UNDP P-11 Form for ICs\nAnnex 2 - IC Contract Template\nAnnex 3 – IC General Terms and Conditions\nAnnex 4 – RLA Template\nAny request for clarification must be sent by email to cpu.bids@undp.org\nThe UNDP Central Procurement Unit will respond by email and will send written copies of the response, including an explanation of the query without identifying the source of inquiry, to all applicants.\n\n\n\nClick here for important information for US Permanent Residents ('Green Card' holders).\n\nUNDP is committed to achieving workforce diversity in terms of gender, nationality and culture. Individuals from minority groups, indigenous groups and persons with disabilities are equally encouraged to apply."}