{"title": "Senior Data Scientist, SNKRS", "company": "Nike", "description": "Become a Part of the NIKE, Inc. Team\nNIKE, Inc. does more than outfit the world’s best athletes. It is a place to explore potential, obliterate boundaries and push out the edges of what can be. The company looks for people who can grow, think, dream and create. Its culture thrives by embracing diversity and rewarding imagination. The brand seeks achievers, leaders and visionaries. At NIKE, Inc. it’s about each person bringing skills and passion to a challenging and constantly evolving game.\nNIKE, Inc.'s storytellers, Marketing and Communication sets the brand tone. A creative force of specialists tell Nike’s stories of innovation and sport through advertising, brand strategy, digital engagement and product presentation. Using channels ranging from retail stores to social media, Marketing & Communication teams connect the science and art of Nike innovations to the hearts and minds of athletes around the world.\nJoining us in Nike’s Digital Innovation Studio in New York City, the Sr Data Scientist, SNKRS App will embed themselves within Nike Digital’s SNKRS digital product management team serving as a data and analytics center of excellence. With our strategic focus on the evolution of the digital launch business and strengthening the consumer’s connection within the Nike digital ecosystem, this position plays a key role in driving sneaker culture forward for both Nike and the Jordan Brand.\n\nWe are looking for scientists with tech industry experience to help build our core data products and machine learning and statistical modeling processes. We want someone who loves modeling and writing code, someone who likes to dive in, solve problems, and create world class experiences for Nike consumers.\n\nThe candidate should be self-driven and proactive and must be able to demonstrate that they can assess many business needs and requests, collaborate across both technical and non-technical partners, continue to deliver on time while constantly developing new solutions and insights to empower the SNKRS App team to action and innovation.\n\nKey Responsibilities:\nUse contemporary data science and analytics methods and tools to derive actionable business insights\nDevelop models that help us understand and describe our customers – e.g., extracting deep interests and tendencies from event streams\nCollaborate with a team of data scientists, product managers, digital designers, engineers, and business stakeholders to take an opportunity or pain point from concept to a new feature or digital product\nTranslate ambiguous statements into structured problem statements and testable hypotheses\nCreate clear and structured deliverables to clearly communicate meaningful insights to a non-technical audience\nBuild trust and drive business adoption of your solutions with stakeholders\nCollaborate with data scientists and stakeholders to explore opportunities to develop data driven solutions by developing and utilizing statistical modeling and machine learning algorithms\nClean, prepare and verify the integrity of data for analysis\nTrack model accuracy, ensuring model relevance and reliability\nCreate clear, user-friendly documentation to support business usage of the solution\nStay abreast of and apply industry and technology trends as well as emerging tools and techniques relevant to discipline\nParticipate in a continuous learning environment within the advanced analytics community through persistent development of new skills and sharing of knowledge through mentorships and contributions to the open source community\n\nBachelor's degree in Mathematics, Statistics, or related field.\n5+ years of relevant professional experience\nRequired Skills\nExperience working with real-world, structured and unstructured data\nExperience working with moderate to large-scale data sets (>100GB)\nAbility to work in multiple data environments and perform complex joins, data cleaning, and feature creation using SQL or SQL based languages (Hive) is required\nCore mathematical ability to understand and apply state-of-the-art machine learning algorithms and/or statistical modeling in a programming language like R or Python to understand patterns and provide insights is required\nExperience with data visualization packages and tools\nExcellent communications skills, in particular, the ability to communicate technical content to general audience in presentation and meeting format\nThe ability to think creatively with data, formulate and get traction around new ideas, and bring a new perspective to business and engineering partners.\nAble to quickly pick up new programming languages, technologies, and frameworks\nIn-depth background in mathematics, statistics, or a related field\nIn-depth knowledge of applied data science\nAbility to work in a multi-cultural environment and to multi-task across different functions of the business, and switch workstreams and handle many different levels of requests.\nPreferred Skills\nExperience with Adobe Omniture Suite, Google Analytics, Tableau, or Optimizely is a plus\nData science or advanced analytics applications in consumer-facing business (e.g. gaming, e-commerce, content platforms)\nFamiliarity with digital optimization, A/B and multivariate test implementation, analysis and business reviews\nExecutive level presentation and communication experience\nConsumer experience with Nike digital apps (NTC, NRC, SNKRS, Nike App)\nKnowledge of Nike’s physical merchandise and company history\nPassion for Nike sneakers and sneaker culture\n\n\nNIKE, Inc. is a growth company that looks for team members to grow with it. Nike offers a generous total rewards package, casual work environment, a diverse and inclusive culture, and an electric atmosphere for professional development. No matter the location, or the role, every Nike employee shares one galvanizing mission: To bring inspiration and innovation to every athlete* in the world.\nNIKE, Inc. is committed to employing a diverse workforce. Qualified applicants will receive consideration without regard to race, color, religion, sex, national origin, age, sexual orientation, gender identity, gender expression, veteran status, or disability."}