{"title": "Data Scientist", "company": "SmartThings", "description": "Did your things make you go “wow” today? At SmartThings, we are dedicated to making every home a Smart Home - and as the IoT platform of Samsung, with millions of users and connected devices, we are well on our way. We strive to create an easy-to-use, secure, and above all intelligent IoT solution for the home that delights our customers. Our fun, intelligent, and creative teams need your help to make our things a little more connected, and a lot smarter.\n\nThis is a key role in SmartThings’ New York-based audio-video engineering team. The AV team is building highly scalable software to support several ambitious new IoT product features. We are looking for a talented data scientist with an interest in the fields of computer vision, security, and home automation.\n\nThe ideal candidate should have experience using a variety of data mining/analysis methods, using a variety of data tools, building and implementing models to run on a variety of different hardware, using/creating algorithms and creating/running simulations. You should be comfortable working with a wide range of stakeholders and functional teams. You will work in an ecosystem of mobile apps, smart embedded devices, cloud-based backend services, and cutting-edge consumer electronics, contributing to the evolution of the Internet of Things.\nResponsibilities\nBuild and apply statistical and deep learning models\nPerform analysis and derive insight from data that align with strategic product objectives\nHelp drive the organization’s data science and ML strategy as related to its home security product road map\nBuild rapport and manage relationships with other stakeholders including: engineering, product, and business development\nProgramming in C and/or Python\nRequirements\nBS in ECE, EE, CS or related discipline or equivalent practical experience\n4+ years experience with designing, developing, testing and productionizing machine learning algorithms\nStrong communication skills, both verbal and written\nAbility to work collaboratively\nMotivation to learn and expand knowledge of AI and machine learning\n\nPreferred Qualifications\nExperience in Software Development in one or more programming languages: C/C++, Python, Scala or other functional language\nStrong proficiency in at least one of the following: SQL, AWS, scikit-learn, and any deep learning framework\nKnowledge of internet technologies, protocols and cloud infrastructure\nTravel: May include 10-15%"}