{"title": "Data Scientist", "company": "The CARIAN Group", "description": "Data Scientist\nThe data scientist will advocate, evangelize and build data-fueled products that help our customers improve their Capital Project Delivery. You’ll dig in and become an expert on our energy sector datasets. You will provide insight into leading analytic practices, design and lead iterative learning and development cycles, and ultimately produce new and creative analytic solutions that will become part of our core deliverables.\nThe data scientist will work with cross-functional team members to identify and prioritize actionable, high-impact insights across a variety of core business areas. You will lead applied analytics initiatives that are leveraged across the breadth of our solutions for the technology sector. You will research, design, implement and validate cutting-edge algorithms to analyze diverse sources of data to achieve targeted outcomes.\nYou will provide expertise on mathematical concepts for the broader applied analytics team and inspire the adoption of advanced analytics and data science across the entire breadth of our organization.\nCandidate Requirements:\nPosses a Ph.D. (strongly preferred) or Master’s Degree in operations research, applied statistics, data mining, machine learning, physics or a related quantitative discipline.\nDeep understanding of statistical and predictive modeling concepts, machine-learning approaches, clustering and classification techniques, and recommendation and optimization algorithms.\n3+ years of experience delivering world-class data science outcomes, the data scientist will solve complex analytical problems using quantitative approaches with their unique blend of analytical, mathematical and technical skills.\nPassionate about asking and answering questions in large datasets, and will be to communicate that passion to product managers and engineers.\nKeen desire to solve business problems, and live to find patterns and insights within structured and unstructured data.\nPropose analytics strategies and solutions that challenge and expand the thinking of everyone around you.\nExpert in analyzing large, complex, multi-dimensional datasets with a variety of tools.\nExpert in the use of statistical analysis environments such as R, MATLAB, SPSS or SAS.\nExperienced with BI tools.\nExperience with relational databases as you are with Hadoop-based data mining frameworks.\nExperience with SQL, Python, Java and C/C++.\nCompany Overview:\nThe CARIAN Group is a New Jersey based management consulting firm that serves leading Fortune 500 businesses. We help our clients make lasting improvements to the delivery of their Capital Projects and realize their most important goals. The CARIAN Group is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, genetics, disability, age, veteran status, or any other characteristic protected by law. Note that this posting is intended for individual applicants ONLY. The CARIAN Group does not accept any solicitation for services from search firms or agencies."}