{"title": "Data Scientist 2", "company": "Oracle", "description": "Data Scientist 2-19001CXJ\n\nPreferred Qualifications\nAbout Moat/Oracle Data Cloud\nWe help brands and media companies push the envelope on privacy-friendly models of advertising, help them make sound product decisions that involve running fewer ads, help make their ads load faster, fight botnets, and strive to de-fund fake news. We help the world's top publishers and marketers make smarter decisions through real-time data. Our analytics and intelligence software is used by The New York Times, Condé Nast, Kellogg's, P&G, Spotify, and hundreds of other major platforms and advertisers, and we have unique measurement integrations into Facebook, Instagram, Twitter, Snapchat, and YouTube.\n\nAbout the Opportunity\nResearch, invent, and implement new ad telemetry methods that are robust to reverse engineering\nDesign experiments, analyze data, and draw conclusions to support business decisions and guide your own work\nBuild predictive models for fraud detection, bot detection, and many other problems\nWrite robust, distributed applications to perform streaming classification on billions of datapoints per day\nIdentify and investigate suspicious websites and impression data to predict, infer, and outmaneuver the activity of people committing and disguising online ad fraud\nAbout You\nBachelor's, Masters or PhD in related field\nExpertise in one or more of the following areas: data science and analysis, distributed data processing, bot detection, browser fingerprinting, security\nYou have sound knowledge of statistics fundamentals\nYou understand experimental design, and can build systems that support the measurement and interpretation of their own behavior\nYou write clean, well-structured, production-quality code in Python and/or vanilla JavaScript\nYou have strong Bash and Linux systems skills\nYou are curious, and willing to accomplish things that nobody can tell you exactly how to do\nAbout the Team\nWe are passionate, excited, and thrive in a fast paced culture.\nWe love sharing our knowledge and learning about new technologies.\nWe are the type of people who take risks when looking for novel and creative solutions to complex problems.\nWe care about solving big-picture, systemic problems—looking beyond the surface to understand root causes so that we can build complete and long-term solutions.\nDetailed Description and Job Requirements\nDesigns, develops and programs methods, processes, and systems to consolidate and analyze unstructured, diverse “big data” sources to generate actionable insights and solutions for client services and product enhancement.\n\nInteracts with product and service teams to identify questions and issues for data analysis and experiments. Develops and codes software programs, algorithms and automated processes to cleanse, integrate and evaluate large datasets from multiple disparate sources. Identifies meaningful insights from large data and metadata sources; interprets and communicates insights and findings from analysis and experiments to product, service, and business managers.\n\nDuties and tasks are standard with some variation. Completes own role largely independently within defined policies and procedures. 2 years relevant experience and BA/BS degree preferred.\n\nOracle is an Affirmative Action-Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability, protected veterans status, age, or any other characteristic protected by law."}