{"title": "Data Engineer", "company": "Northwell Health", "description": "Work directly with the Program Director for Data Science and data science team to advance data engineering and infrastructure with Northwell, as well as migrate and support machine learning projects into production. Define and build the next iteration of features for the data science team and will be responsible for modifying, expanding and optimizing our data warehouse to include big data and cloud technologies. Work collaboratively with members from both the Information Technology and clinical communities to support data scientists, systems and initiatives at both the department and the enterprise level.\nAssist data scientists, data engineers, cloud architects, and subject matter advisors in testing, deploying, and maintaining artificial intelligence and machine learning algorithms.\nWork collaboratively to develop, construct, test, and maintain large scale data processing systems and databases.\nParticipate in projects to architect (research, recommend, design, develop and deploy) advanced systems for the collection, aggregation and analysis of those data in alignment with business objectives.\nProvide big data technology assessments, strategies, and roadmaps in several technical domains and act as a subject matter advisor on big data.\nParticipate in configuring the architecture and advise data scientists on efficient performance.\nDevelop and optimize ETL processes, implement transformations and quality check results.\nWork with cross functional research leadership, technical and analytical teams to understand current and future enterprise-wide big data analytics goals spanning disparate platforms and datatypes.\nAssist in ensuring that systems are implemented to support Health System initiatives and goals to improve the quality of patient care, to maximize patient safety, and to provide operational efficiencies.\nServe as a resource to the Director of Quality Informatics and Program Director of Data Science.\nDemonstrate familiarity with current hospital information systems.\nPerforms other duties as assigned.\n\nQualifications\nBachelor’s Degree in Computer Science, Informatics, Statistics, Engineering, Data Science, or related field, required. Master’s Degree, preferred.\nMinimum of two (2) years of experience with Apache Hadoop, NoSQL, setting up cloud clusters, Apache Spark, and other advanced data science and big data technologies, required.\nExperience in software development in enterprise/ web/ cloud applications, solutioning, architecture and frameworks.\nBig data expertise with cloud and enterprise level design/implementation.\nExperience in architecting data warehouses and/or data lakes with traditional database enterprise-class RDBMS technologies.\nStrong knowledge of programming languages/tools including: Java, Python, Spark, SQL, R, and Shell Scripts.\nExperience with or understanding of how to build, test, and deploy code to run on cloud infrastructure.\nFluent with functional, imperative and object-oriented languages and methodologies and Design Patterns.\nStrong knowledge of Business Intelligence & Analytics concepts and platforms, inclusive of data virtualization, data preparation, data visualization and advanced analytics technologies.\nExperience with Unix/Linux systems with scripting experience, open source programming languages for large data, and AWS/CPG/Azure platforms.\nStrong interpersonal skills, capable of working collaboratively with clinicians and administrators."}