{"title": "Machine Learning Engineer", "company": "Warner Bros Careers", "description": "Opportunity Overview\nOVERALL SUMMARY\n\nWe are looking for a Machine Learning (ML) Engineer to help us create artificial intelligence products. ML Engineer responsibilities include creating machine learning models and retraining systems. Your ultimate goal will be to shape and build efficient self-learning applications.\n\nYou are:\n\nYou can design and build web scale distributed systems. You are passionate about data science and machine learning. You are excited about recommender systems and comfortable reading research papers, interacting with data scientists and implementing ml algorithms from proof of concept to production. Additionally, you understand the constraints of working with a growing team and thrive in an environment that is fast-paced and sometimes scrappy. You understand that serving a user-facing model comes with a set of restrictions and you know how to be creative to solve them. Finally, you are business focused and proactively thinking about new projects that could have a high impact result for the company.\n\nWe value:\nTeam player\nProblem solver\nRadical candor\nTesting rigor\nHumility\n\nPRIMARY RESPONSIBILITIES\nStudy and transform data science prototypes\nDesign and develop machine learning systems for data scientist to create, train and deploy ML models\nResearch and implement appropriate ML algorithms and tools\nDevelop machine learning applications according to requirements\nRun machine learning tests and experiments\nPerform statistical analysis and fine-tuning using test results\nTrain and retrain systems when necessary\nExtend existing ML libraries and frameworks\nKeep abreast of developments in the field\n\nREQUIREMENTS\nProven experience as a ML Engineer or similar role\nUnderstanding of data structures, data modeling and software architecture\nFamiliarity with machine learning frameworks (like Keras or PyTorch) and libraries (like scikit-learn)\nExperience in applying machine learning, predictive analytics and classification techniques towards real product and problems\nAbility to write robust code in Python or Java or equivalent modern programming language\nProficiency in SQL, big data technologies and working with large data sets\nBS in Computer Science, Mathematics or similar field; Master’s degree is a plus\nWorks independently, able to manage multiple projects simultaneously\nDeep curiosity and a demonstrated ability to craft original solutions\nHighly communicative with collaborators and manager\nProactive in seeking opportunities for innovation\n\nPluses:\nDesigned and built web scale distributed systems\nDeep knowledge of math, probability, statistics and algorithms\nExperience in the media industry\n\n\nAbout Us\nIt's HBOSM\n\nAmerica's most successful premium television company, Home Box Office delivers two 24-hour pay television services—HBO®and Cinemax®. HBO continues to take advantage of the latest technological innovations with advancements that include the availability of HBO programming online though HBO GOSM and MAX GOSM, as well as HBO On Demand® and Cinemax On Demand® in HD. Just as HBO is a company noted for its commitment to excellence in the products and services it delivers to consumers, it makes the extra effort to create a work environment in which fairness, equity, trust, and individual responsibility are valued. HBO is committed to retaining and recruiting skilled and motivated employees, placing a priority on qualified team players who contribute to the diversity of their workforce. HBO offers competitive benefits to include medical, dental, vision, a matched 401(k) plan, flexible spending, a commuter benefit program and tuition reimbursement.\nHBO is an equal employment opportunity employer. HBO does not discriminate against any applicant or employee based on race, color, religion, national origin, gender, age, sexual orientation, gender identity or expression, marital status, mental or physical disability, and genetic information, or any other basis protected by applicable law. HBO also prohibits harassment of applicants or employees based on any of these protected categories."}