{"title": "Data Scientist – Content Marketing Acquisition", "company": "Spotify", "description": "We are looking for a Senior Data Scientist with marketing analytics background to join the Spotify product Insights team in New York City. As part of the Growth Opportunities department, you will lead insights for a new team focused on Engineering Automated Marketing for user acquisition.\nEngineering Automated Marketing is the art and science of bringing the right content to the right users, at scale. Thanks to the power of Machine Learning, the depth of Spotify’s catalog and our large user base, we can enable technology that allows us to automate, measure and optimize the effectiveness of our content marketing campaigns. Think emails, push, or Facebook ads.\nAcquisition Marketing focuses on driving efficient and effective registrations through advertising and we are pioneering the way in which we use data, analytics and advanced data science to execute and optimize our global marketing. You will measure and provide optimization recommendations for all Artist and Content marketing campaigns through a causal approach (i.e., incrementality) and improve our marketing effectiveness through experimentation.\nWe are looking for a Data Scientist to join our team that will lead experimentation efforts in key marketing channels. This role will support the full cycle of an experiment (from data-driven hypothesis generation to test design to analysis and interpretation) while also innovating on experimental methodologies that allow us to obtain meaningful results.\nWhat you’ll do\nLead the design, analysis, and interpretation of experiments that shape decision-making around acquisition and engagement marketing at Spotify.\nProactively perform data exploration to discover future testing opportunities\nDrive innovation by developing new experimentation methodologies, statistical techniques, and causal-inference approaches that could sharpen our marketing decision-making process.\nBe a strategic partner and work with business stakeholders to connect analysis to key decisions that affect the business to influence and drive impact to the business.\nInstrument tracking (e.g. via DoubleClick, Google Analytics, Adjust) for marketing campaigns\nAccess marketing performance data through a variety of tools\nBuild performance dashboards (e.g. Tableau, Looker)\nFrequently analyze the results of marketing campaigns and recommend optimizations to improve performance\nDeploy agile testing strategies (e.g. A/B testing) to quantify impact of performance recommendations\nWho you are\n4+ years of experience in marketing analytics or business intelligence (focused in analytics) with a proven track record of delivering performance results required.\nUnderstanding of traditional media (TV, out of home), digital media (search, display, social) and CRM (email, push notifications) required.\nStrong analytical skills, including data querying, dashboarding, and experimental design are required.\nExpertise in marketing tracking platforms (e.g. DoubleClick, Google Tag Manager, Google Analytics, Adjust) required.\nExperience in executing incrementality testing with marketing platforms (FB, Twitter, Snapchat, Google) preferred\nData visualization skills required (e.g. Tableau, Looker).\nExcel expertise required.\nYou have an advanced degree in Statistics, Econometrics, Mathematics, Physics, or a related quantitative field\nYou have deep statistical skills utilized in A/B testing, analyzing observational data, and modeling\nYou are comfortable working with large data sets and analyzing complex data with SQL and other tools such as Python or R\nYou have a strong bias to action, delivering results quickly with iteration instead of waiting for perfection.\nYou are an expert at taking vague questions and crystallizing them into impactful experiments, statistical analysis or models for the business\nYou are able to multitask and work on multiple ongoing projects, with minimal oversight, documentation, and defined process"}