{"title": "CCB - Quantitative Modeler / Data Scientist - Associate", "company": "JP Morgan Chase", "description": "JPMorgan Chase & Co. (NYSE: JPM) is a leading global financial services firm with assets of $2.6 trillion and operations worldwide. The firm is a leader in investment banking, financial services for consumers and small business, commercial banking, financial transaction processing, and asset management. A component of the Dow Jones Industrial Average, JPMorgan Chase & Co. serves millions of consumers in the United States and many of the world’s most prominent corporate, institutional and government clients under its J.P. Morgan and Chase brands. Information about JPMorgan Chase & Co. is available at www.jpmorganchase.com\n\nChase Consumer & Community Banking (CCB) serves nearly 66 million consumers and 4 million small businesses with a broad range of financial services through our 137,000 employees. The Consumer & Community Banking Business Modeling Center of Excellence is a newly formed unit in support of modeling needs for marketing, finance and operations. Our modelers work directly with each line of business, Consumer Banking, Business Banking, Auto Finance, Credit Card and Commerce Services, Chase Wealth Management and Home Lending, to build state-of-the-art models and tools to support business growth.\n\n\nWe are an intellectually diverse team of economists, statisticians, engineers, and other analytics professionals, focused on quantitative modeling within CCB at JPMorgan Chase & Co. The team answers complex and unique questions, utilizing cutting edge quantitative and computational techniques and leveraging one of the world’s largest repositories of consumer data. We work closely with our partners throughout JPMorgan Chase to assess and execute critical business decisions.\nThe position is located at either New York, NY or Columbus, OH\n\nResponsibilities:\nApply critical thinking skills and perform advanced analytics with the goal of solving complex and multi-faceted business problems.\nGenerate deep insights through the analysis of data and understanding of business processes and turn them into actionable recommendations.\nPerform advanced quantitative and statistical analysis of large datasets to identify trends, patterns, and correlations that can be used to improve business performance.\nKnow what type of algorithm to use and how to implement them\nBuild and deploy prototype solutions to demonstrate ideas and prove concepts.\nDevelop presentations to summarize and communicate key messages to senior management sponsors and colleagues.\nBecome a subject matter expert and trusted advisor in the analytics discipline.\nCollaborate with others in the organization to develop new ideas and brainstorm potential solutions.\nActively contribute to the continuous learning mindset of the organization by bringing in new ideas and perspectives that stretch the thinking of the group\nQualifications:\nDeep quantitative/programming background with a graduate degree (M.S., Ph.D.) in Statistics, Engineering, Computer Science, Mathematics, Operations Research, or Economics,\n3+ years of related experience preferred\nHands-on experience with Machine Learning and Artificial Intelligence\nAbility to write code and develop production-ready analytical applications\nSignificant experience working with very large scale (structured and unstructured) data\nExpertise in at least one of the following: Python, R\nExcellent written and oral communication skills to clearly present analytical findings and business recommendations. Highly motivated, productive, and teamwork oriented.\nGood project management skills (clear goal setting, well-organized, detailed planning, and ability for tight-timeline deliverables).\nDesired characteristics\nAble to translate ambiguous business problems into a conceptual mathematical framework\nPassionate about continuous learning and professional development\nDeeply curious; creative and imaginative\nAbility to influence and become a trusted advisor\nAbility to convey complex concepts to non-technical audiences\nEffective communication and presentation skills\nCan work both independently and collaboratively"}