{"title": "Data Scientist, Peacock, Direct-to-Consumer", "company": "NBCUniversal", "description": "Introducing Peacock, NBCUniversal’s new streaming service that combines timeless shows and movies, exclusive originals, kids programming and current hits, with timely news, sports and pop culture. All together. All in one app.\n\nIn preparation for our launch in 2020, we are building a world-class team of smart, hungry and fearless professionals who are energized by the possibility of working at the epicenter of content, technology and culture.\n\nAre you ready to go beyond classic predictive analytics to the new areas like deep learning and reinforcement learning? Do you want to be a part of the team that builds and advanced recommender engine, active leaning platform, personalized solutions for marketing and advertisement?\nJoin us if you would like to be a part of an exciting initiative.\n\nPosition Overview:\n\nAs part of the Direct-to-Consumer Decision Sciences team, the Data Scientist will be responsible for creating analytical solutions for one or more verticals of the video streaming service including but not limited to the recommender system, automated marketing, personalized advertisement, commerce and revenue optimization, customer journey and CRM solutions.\n\nIn this role, the Data Scientist will use advanced data science methodologies including collaborative filtering, deep learning, reinforcement learning, on-line modeling etc. and work close with teammates and engineers to build a state-of-the-art real-time video streaming service.\n\nResponsibilities include, but are not limited to:\nBuild analytical models using statistical, machine learning and data mining methodologies.\nApply cleansing, discretization, imputation, selection, generalization etc. to create high quality features for the modeling process.\nUse big data, relational and non-relational data sources to access data at the appropriate level of granularity for the needs of specific analytical projects. Maintains up to date knowledge of the relevant data set structures, access levels and ownership information.\nCollaborate with engineering teams to build real-time and automated batch implementations of the data science solutions.\nWork on improving the codebase and machine learning lifecycle infrastructure. Have active participation in all aspects of the team work.\nQualifications/Requirements\nBachelor’s or advanced degree with specialization in Statistics, Computer Science, Data Science, Economics, Mathematics, Operations Research or another quantitative field or equivalent.\n1+ years of combined experience in advanced analytics in the industry or research.\nHands on experience in statistical methods and machine learning with special emphasis on the advanced algorithms like neural networks, SVM, random forests, bagging, gradient boosting machines, k-means++, deep learning or reinforcement learning.\nExperience implementing scalable, distributed, and highly available systems using Google Cloud or similar cloud platform.\nExperience with data visualization tools and techniques\nGood knowledge of statistical and programming languages such as R, Python, Julia, Java, Scala or similar.\nExperience in data processing including SQL and PySpark.\nDesired Characteristics\nWorking experience with commercial recommender systems or a lead role in advanced research recommender system project.\nExperience with reinforcement learning based systems.\nWorking experience with deep learning, particularly in the areas different form computer vision.\nExperience with multi-billion record datasets.\nKnowledge of enterprise-level digital analytics platforms (e.g. Adobe Analytics, Google Analytics, etc.)\nExperience with television ratings and digital measurement tools (Nielsen, Rentrak, ComScore etc.)\nExperience building streaming data pipelines using Kafka, Spark or Flink\nExperience with large-scale video assets\nTeam oriented and collaborative approach with a demonstrated aptitude and willingness to learn new methods and tools\nExhibit a bias for getting the job done\nPride and ownership in your work and confident representation of your team to other parts of NBCUniversal\nSub-Business\nDirect-to-Consumer\nCareer Level\nExperienced\nCity\nNew York\nState/Province\nNew York\nCountry\nUnited States\nAbout Us\nAt NBCUniversal, we believe in the talent of our people. It’s our passion and commitment to excellence that drives NBCU’s vast portfolio of brands to succeed. From broadcast and cable networks, news and sports platforms, to film, world-renowned theme parks and a diverse suite of digital properties, we take pride in all that we do and all that we represent. It’s what makes us uniquely NBCU. Here you can create the extraordinary. Join us."}