{"title": "Data Research Scientist, Brooklyn Neighborhood Health Action Center", "company": "New York City DEPT OF HEALTH/MENTAL HYGIENE", "description": "The Center for Health Equity aligns efforts in advancing health equity across the City and ensures that we deploy resources to reduce health and mental hygiene disparities across all neighborhoods in NYC. The Center works in collaboration with community-based partners, building on work the District Public Health Offices and others have pursued over the years. The Center focuses on these key areas: leveraging community assets to better integrate primary care and public health to serve the health needs of communities; building inter-agency collaboration to implement multi-sectorial approach to addressing the root causes of health disparities; and increasing organizational capacity that strengthens the agency's lens of addressing health equity.\n\nDUTIES WILL INCLUDE BUT NOT BE LIMITED TO:\n\nAs a member of the Research and Evaluation Unit, the Data Research Analyst will assist in the research and evaluation activities for the Neighborhood Health Action Centers. The selected candidate will perform the following duties under the direction of the Director of Research and Evaluation:\n\nAssist in the development of research and evaluation activities necessary to implement and improve the Division's primary community-facing initiative, the Neighborhood Health Action Centers, including conducting literature reviews, developing logic models and evaluation tracking tools, conducting health impact assessments, and summarizing program evaluation findings for a variety of audiences.\n\nDevelop guidance documents and training materials for conducting health impact assessments and incorporating social determinants of health into our work, using a racial equity and social justice lens.\n\nAnalyze and summarize data regarding prevalence of disease as well as social determinants of health and health inequities using SAS and/or R to support and guide strategic planning and community-based efforts.\n\nCoordinate and participate in field activities including data collection and data management around community surveys. Conduct trainings for staff and interns.\n\nSupport qualitative research activities as needed.\n\nRespond to internal and external data requests.\n\nPrepare summary tables, figures, maps and draft reports to present findings for publication and presentation to the public and other public health professionals.\n\nPresent and report public health data and research findings to community leaders, key stakeholders and residents.\n\nEnsure that all research and evaluation projects and products have a health equity focus.\n\nSupervise student interns working on research and evaluation-related projects.\n\n• Perform other tasks based on the Neighborhood Health Action Center needs.\n\n\nMinimum Qual Requirements\n\n1. For Assignment Level I (only physical, biological and environmental sciences and public health) A master's degree from an accredited college or university with a specialization in an appropriate field of physical, biological or environmental science or in public health.\nTo be appointed to Assignment Level II and above, candidates must have:\n1. A doctorate degree from an accredited college or university with specialization in an appropriate field of physical, biological, environmental or social science and one year of full-time experience in a responsible supervisory, administrative or research capacity in the appropriate field of specialization; or\n2. A master's degree from an accredited college or university with specialization in an appropriate field of physical, biological, environmental or social science and three years of responsible full-time research experience in the appropriate field of specialization; or\n3. Education and/or experience which is equivalent to \"1\" or \"2\" above. However, all candidates must have at least a master's degree in an appropriate field of specialization and at least two years of experience described in \"2\" above. Two years as a City Research Scientist Level I can be substituted for the experience required in \"1\" and \"2\" above.\n\nNOTE:\nProbationary Period\nAppointments to this position are subject to a minimum probationary period of one year.\n\n\nPreferred Skills\n\nExperience using SAS and/or R programming for analysis; adept with data management systems, Microsoft Excel, Access and PowerPoint; keen ability to prioritize and handle multiple assignments; ability to work closely with all levels of staff inside and outside the Agency; ability to work independently and exercise a high degree of initiative to accomplish tasks and solve problems; experience conducting trainings; MPH highly desirable; experience with GIS and fluency communicating in Spanish highly desirable.\n\n\nTo Apply\n\nApply online with a cover letter to https://a127-jobs.nyc.gov/. In the Job ID search bar, enter: job ID number # 414914.\n\nWe appreciate the interest and thank all applicants who apply, but only those candidates under consideration will be contacted.\n\nThe NYC Health Department is committed to recruiting and retaining a diverse and culturally responsive workforce. We strongly encourage people of color, people with disabilities, veterans, women, and lesbian, gay, bisexual, and transgender and gender non-conforming persons to apply.\n\nAll applicants will be considered without regard to actual or perceived race, color, national origin, religion, sexual orientation, marital or parental status, disability, sex, gender identity or expression, age, pri\n\n\nResidency Requirement\n\nNew York City residency is generally required within 90 days of appointment. However, City Employees in certain titles who have worked for the City for 2 continuous years may also be eligible to reside in Nassau, Suffolk, Putnam, Westchester, Rockland, or Orange County. To determine if the residency requirement applies to you, please discuss with the agency representative at the time of interview."}