{"title": "Data Scientist", "company": "IFG Companies", "description": "Job Brief\nThe ideal candidate will have previous Data Modeling experience. Strong preference will be given to candidates with an actuarial background in the property and casualty insurance space.\nOverview\nIFG Companies is in search of a Data Scientist to join its growing Predictive Modeling team.\nThe ideal candidate will have previous Data Modeling experience. Strong preference will be given to candidates with an actuarial background in the property and casualty insurance space.\n\nResponsibilities\nBuild predictive and/or Machine Learning models in SAS\nResearch new statistical and mathematical techniques that are suitable and helpful for solving business related problems\nPrepare data for modelling and make best/creative use of applicable and available internal or external data\nIdentifying and integrating new datasets that can be leveraged for modeling efforts\nSupport related processes around effectively deploying model to business\nEffectively communicate results in written, oral and presentation formats to technical and non-technical audiences\n\nQualifications\n\nBachelor’s degree in statistics, applied mathematics, or related discipline\n3+ years of Data Modeling or similar experience.\nExperience with predictive modeling (classification, regression, parameter tuning, optimization criteria, feature selection), preferably with multiple techniques\nExperience in model validation techniques, model testing and continuous monitoring of model performance\nExperience in Property & Casualty Insurance is strongly preferred.\nDemonstrated experience working with large relational data sets.\nWorking knowledge in SAS, R, Python or another platform to develop and implement predictive models.\nAbility and willingness to quickly gain knowledge of SAS enterprise guide and enterprise miner.\nAbility to communicate complex technical information in common language to foster teaching and analytics guidance to internal customers.\nAdvanced experience in analytics, data cleaning, and predictive modeling.\nAbility to write queries in SQL.\nDetail-oriented and ability to work collaboratively\nPhysical Demands\nPhysical demands are considered to be that of an office environment, climate controlled, with minimal physical exertion. This position requires prolonged sitting, ability to utilize a computer and interactions with others in meetings or via phone.\nBenefits\nWe offer a competitive compensation and benefits package including medical, dental, vision, 401(k), flexible spending, short-term and long-term disability insurance, life insurance, long-term care, education assistance and paid time off."}