{"title": "Data Scientist", "company": "Gallup", "description": "Who we want:\nAre you committed to using your research talents to provide global organizations with critical advice for their growing needs using advanced analytics?\nAre you a leader who applies your instinct and expertise to discover breakthroughs that are key to clients’ growth?\nAre you a driven professional who can manage multiple projects, set a standard of excellence and follow through on commitments for exceptional results?\nDo you instinctively connect with others, understand individuals’ needs and share your passion for analytics to contribute to shared goals?\nDo you excel at building predictive models using various data sources and techniques to inform practical business decisions?\nWhat you will do:\n\nGallup data scientists help clients effectively use data to make better decisions. You will apply your knowledge of various statistical and machine-learning techniques to a wide variety of challenging projects — from custom builds for client needs to helping automate solutions to the challenging problems clients face every day. You will partner with client teams to increase Gallup’s impact on a large scale by helping explain and predict large-scale social behavior (e.g., consumer spending, lifestyle trends, political stability, election outcomes, and employee performance and retention) using data from Gallup, the web and third parties (e.g., governments, IGOs and NGOs). We have data that no one else has. This gives you an unparalleled opportunity to use your creativity to explore new avenues of social research as part of a legacy founded by George Gallup in 1936 that set the gold standard in survey research methodology.\nQualifications\nWhat you need:\nA master’s degree or Ph.D. from a statistics, engineering, mathematics, computer science, computational social science, physics or operations research program is preferred.\nMinimum of eight years of work experience (advanced degrees count toward years of experience).\nExpert-level production coding in Python is required .\nMastery in conducting analysis in Python and/or R is required; additional analytic software experience is a plus .\nMinimum of two years of experience building production-level machine learning and predictive analytics systems along with data pipelines.\nA deep understanding of the mathematical fundamentals of machine learning and statistics, with an emphasis on non-parametric, non-linear methods (e.g., random forests, support vector machines, neural networks) and natural language processing.\nMinimum of one year of experience working within distributed systems and managing workflows in a cloud infrastructure.\nCandidates must be authorized to work in the United States.\n\nGallup is an equal opportunity/affirmative action employer that celebrates, supports and promotes diversity and inclusion. We will consider all qualified applicants without regard to race, color, religion, sex, national origin, disability, protected veteran status, sexual orientation or gender identity, or any other legally protected basis, in accordance with applicable law.\nPrimary Location\nUnited States-New York City"}