{"title": "Machine Learning Engineering Intern", "company": "Butterfly Network", "description": "Job Description\n\nBuilding “intelligence” into our software is the responsibility of the Deep Learning Team.\nWe’ve built a strong research team and are looking for talented Software Engineers, Data Scientists and Research Scientist interns. This role is best suited for engineers interested in learning about machine learning and building components of high-impact, life-saving systems.\nEach internship will involve working alongside other research scientists, software engineers and a world-class clinical team to help develop a new suite of “intelligent” medical products.\nAs part of our team, some example core responsibilities will be:\nDesigning Algorithms for interpretation of machine learning models.\nReal-time analytics systems that monitor the performance of models and annotations.\nOptimizing speed and size of neural networks on mobile devices\nNext generation distributed infrastructure for training machine learning models.\n\nQualifications\n\nBaseline skills/experiences/attributes:\nWorking on CS undergraduate or graduate degree.\nFamiliarity with engineering best practices and design patterns.\nIdeally, you also have these skills/experiences/attributes (but it’s ok if you don’t!):\nWorking on MS or Phd in computer vision, data science or machine learning.\nExperience with machine learning infrastructure or models.\n\nAdditional Information\n\nWe offer great perks:\nFully covered medical insurance plan, and dental & vision coverage - as a health-tech company, we place great worth on our teams’ well-being\nCompetitive salaried compensation - we value our employees and show it\nEquity - we want every employee to be a stakeholder\nPre-tax commuter benefits - we make your commute more reasonable\nFree onsite meals + kitchen stocked with snacks.\n401k plan - we facilitate your retirement goals\nBeautiful office overlooking the Flatiron building in NYC\nThe opportunity to build a revolutionary healthcare product and save millions of lives!\nFor this role, we provide visa assistance for qualified candidates.\nButterfly network does not accept agency resumes.\nButterfly Network Inc. is an E-Verify Company and is an equal opportunity employer regardless of race, color, ancestry, religion, gender, national origin, sexual orientation, age, citizenship, marital status, disability or Veteran status. All your information will be kept confidential according to EEO guidelines."}