{"title": "Data Scientist, RPSG", "company": "New York City Department of Education .", "description": "This title is in a civil service competitive class that is subject to examination. Position is only open to applicants with permanent NYC civil service status as Education Analyst or candidates who apply for the Education Analyst civil service examination.\nThe filing period for the exam is 06/03/2020 - 06/23/2020. Information regarding NYC civil service exams can be found on the DCAS website below:\n\nhttps://www1.nyc.gov/site/dcas/employment/current-upcoming-exams.page\n\n(Those who previously applied need not re-apply)\n\nPosition Summary: The New York City school system is the largest in the country, composed of approximately 1.1 million students and 75,000+ teachers in over 1,800 schools. Within the Office of Policy and Evaluation, the Research and Policy Support Group (RPSG) conducts its own research and analyses to evaluate organizational structures, policies, programs and initiatives.\n\nThe Data Scientist will play a key role in EduStat, a research-based approach to school improvement that flattens our organization, elevates our values, and advances equitable outcomes for all students. The EduStat process enables our organization to monitor the progress and impact of teams’ strategic plans and is modeled on other municipal “Stat” models from NYC and other major U.S. cities.\n\nThe Data Scientist will be responsible for determining metrics and designing models at a Central-level to support DOE decision-making in a manner that improves organizational efficiency, promotes data transparency, and facilitates the improvement of educational initiatives. Working with the large datasets available from various sources, the Data Scientist will drive the management conversation to identify predictors of success and key early warning indicators to target interventions. While RPSG and OPE have extensive experience answering specific research and evaluation questions with a variety of analytical methods, the Department is looking to harness all the data available to identify key trends and indicators to focus leadership conversations. The Research and Policy Support Group (RPSG) plays a key role in this effort as the primary source of data analysis and research for the DOE. RPSG conducts its own research and analysis to inform DOE policy, as well as consulting on and supporting other analytic work with DOE data. Performs related work.\n\nReports to: Director, RPSG\n\nDirect Reports: N/A\n\nKey Relationships: Works closely with other RPSG staff; the Office of School Performance; Office of Talent Research and Data; Office of the First Deputy Chancellor, and other OSP staff, as well as with other DT&L staff, including SAS, SQL, R, and Python programmers, web developers, data quality managers, data and policy analysts and policy makers; and with the Division of Instructional and Information Technology (DIIT).\n\nResponsibilities\n\nIdentify the data analytics problems that offer the greatest opportunities for growth and improvement by building metrics and models that will comprise the basis of EduStat.\nIdentify, evaluate, and refine metrics from other Department data systems and develop machine learning models to identify hidden patterns and trends to focus leadership conversations and support data-driven decision-making.\nCollect and analyze large sets of structured- and unstructured data from various and distinct sources.\nUtilize a combination of variables and data points to create metrics and cut points to identify key early warning indicators of adverse outcomes.\nUtilize machine learning algorithms and statistics such as regression, simulation, scenario analysis, modeling, etc. to interpret data to feed EduStat reporting.\nEvaluate metrics currently in use and identify meaningful cut points and metrics to drive attention and resources to areas of greatest opportunity.\nCoordinate with a cross-functional team of analysts contributing to dataset creation and maintenance as well as back- and front-end designers.\nWork closely with programmers and UX designers to support the development of business requirements and ensure relevant metrics are presented accurately, with fidelity, and in context.\nCollaborate with DOE policymakers and educators to identify central research and analytic priorities, which can include the implementation of organizational procedures, structures, and programs, utilization of data systems and data collection, and performance standards.\nDevelop a testing framework and test model quality; develop processes and tools to monitor and analyze model performance.\nWork with stakeholders throughout the Department to identify opportunities to leverage student data to drive decision-making by school leaders and at the highest levels of the organization.\nDraft communications based on updates to relevant policies and new product launches or improvements.\nDesign and produce both ad hoc and regular reports to meet a variety of needs from diverse stakeholders which may include other teams within the Division of Teaching and Learning.\n\nQualification Requirements:\n\nMinimum\n\nA master’s degree from an accredited college in economics, finance, accounting, business or public administration, human resources management, management science, operations research, organizational behavior, industrial psychology, statistics, personnel administration, labor relations, psychology, sociology, human resources development, political science, or a closely related field; or\nA baccalaureate degree from an accredited college and two years of full-time satisfactory professional experience working with the budget of a large public or private concern in public administration, accounting, economic or financial administration, or fiscal or economic research; or in management or methods analysis, operations research, organizational research or program evaluation; or in educational, personnel or public administration, recruitment, position classification, personnel relations, labor relations, employee benefits, staff development, employment program planning/administration, labor market research, economic planning, fiscal management; or in a related area.\n\nPlus\n\nProficiency with R, Python, SAS, Stata, or other statistical/data management programming languages.\n\nPreferred\n\nExperience working with large datasets and experience with data science.\nAn understanding of racial equity issues and a commitment to advancing racial equity.\nKnowledge of a variety of machine learning techniques (clustering, decision tree learning, artificial neural networks, etc.) and their real-world advantages/drawbacks.\nAbility to troubleshoot, problem-solve, and anticipate issues needing resolution.\nAbility to clearly communicate and document technical work, including coding methodology.\nExperience communicating research and analyses to non-researchers/analysts.\nAbility to collaborate with programmers and analysts while also completing work independently.\nAbility to use independent judgment to design, adapt, and modify analyses and programming to the needs of specific projects.\nAbility to provide constructive feedback to others on their research and analytic work.\nStrong attention to detail and well organized, with the ability to meet frequent and changing deadlines.\nExcellent interpersonal skills in dealing with education and non-education personnel, internal and external to the DOE.\nAbility to thrive in and enjoy working in a collaborative environment.\nExperience or working knowledge of the public sector and/or demonstrated interest in public education.\nInternal candidates preferred.\n\nSalary: $77,407+\n(Internal candidates who are selected for this position and who currently hold comparable or less senior positions within the DOE will not make less than their current salary.)\n\nPlease submit a resume an cover letter with your application.\nApplications will be accepted through October 30, 2019 until 3:00 p.m.\nNOTE: The filling of all positions is subject to budget availability.\n\nThis position is open to qualified persons with a disability who are eligible for the 55-a program. Please indicate in your cover letter that you would like to be considered for the position under the 55-a program.\n\nAN EQUAL OPPORTUNITY EMPLOYER\nIt is the policy of the Department of Education of the City of New York to provide equal employment opportunities without regard to actual or perceived race, color, religion, creed, ethnicity, national origin, alienage, citizenship status, age, marital status, partnership status, disability, sexual orientation, gender (sex), military status, unemployment status, caregiver status, consumer credit history, prior record of arrest or conviction (except as permitted by law), predisposing genetic characteristics, or status as a victim of domestic violence, sexual offenses and stalking, and to maintain an environment free of harassment on any of the above-noted grounds, including sexual harassment or retaliation. For more information, please refer to the DOE Non-Discrimination Policy.\n\nRequired Skills\n\nRequired Experience"}