{"title": "Senior Data Scientist", "company": "Amazon.com Services, Inc.", "description": "MS with 5+ years of industry experience or Bachelors with 8+ years of experience in Quantitative field (CS, ML, Mathematics, Statistics, Physics)\n3+ years of experience with data querying languages (e.g. SQL), scripting languages (e.g. Python), or statistical/mathematical software (e.g. R, SAS, Matlab)\nExperience in creating data driven visualizations to describe an end-to-end system\nHighly skilled in data and math/statistical methods (i.e. modeling, algorithms)\nEvidence of using of relevant statistical measures such as confidence intervals, significance of error measurements, development and evaluation data sets, etc. in data analysis projects\n\nAmazon is building a world class advertising business and defining and delivering a collection of self-service performance advertising products that drive discovery and sales of merchandise. Our products are strategically important to our Retail and Marketplace businesses driving long term growth. We deliver billions of ad impressions and millions of clicks daily and are breaking fresh ground to create world-class products. We are highly motivated, collaborative and fun-loving with an entrepreneurial spirit and bias for action. With a broad mandate to experiment and innovate, we are growing at an unprecedented rate with a seemingly endless range of new opportunities.\n\nWe are seeking a Senior Data Scientist to join the Sponsored Products Auction team. This team is responsible for building and evaluating mechanisms to rank and price billions of ad impressions per day. We're looking for a Data Scientist to define measures of auction efficiency and produce insights into the quality of inputs to our auction (supply, demand, ML model predictions). This role will also be responsible for more exploratory data analysis to identify opportunities for improvement of the system, working closely with Economists, Applied Scientists and Engineers to improve our product.\n\nIn this role, you will:\nPerform hands-on data analysis and modeling with very large data sets to develop insights into different aspects of our business (monetization, shopper experience, advertiser experience, marketplace dynamics)\nDefine and build tools and processes to monitor these metrics (weekly business reviews, dashboards, automated alarming)\nUse data to identify opportunities to improve our systems.\nWork with scientists and economists to model complex interactions in our systems\nLead and mentor junior data scientists, with an opportunity to grow into a team leader\nBe a member of the Amazon-wide Machine Learning Community, participating in internal and external Meetups, Hackathons and Conferences\n\nPhD in Computer Science or related quantitative field\nExperience with online advertising\n\nAmazon is an Equal Opportunity-Affirmative Action Employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation\n\n#sspajobs #adsto"}