{"title": "Junior Data Scientist Apprenticeship", "company": "IBM", "description": "In the Information Age, data is the most valuable resource. If you can describe yourself as the powerful combination of data hacker, analyst, communicator, and advisor, our Data Specialist position is the right one for you. As a savvy liaison for our teams, you will create solutions and provide actionable insights that shape the future of our business.\n\nAs a Junior Data Scientist at IBM, you will work as part of a team to solve business-related problems using data-driven techniques. You will apply the scientific method to business scenarios, clean and prepare data for statistical and machine learning modeling, work with a variety of analytical algorithms to build models that better explain data relationships and predict potential scenarios, translate data insights into business value, and communicate results to difference audiences. You will also master different technologies for model deployment.\n\nThroughout your apprenticeship, you’ll work closely with other experienced data scientists and mentors in an interactive, collaborative environment. You’ll learn the fundamentals of probability, statistics, linear algebra, data preparation, data modeling, and deployment of machine learning models. In addition, you will be introduced to additional concepts, skills and tools including Python, Hadoop, and Spark, presentation skills, communication skills, and you will apply these skills to prepare for and successfully obtain data science experience that may lead to certification as a Junior Data Scientist. IBM Certification as a Junior Data Scientist provides the credentials and career milestone that is earned through demonstrated usage of Data Science tools and methodology through case studies, business references and technical references. Our apprenticeship program will give you the opportunity to build your skills to grow your career as a Junior Data Scientist.\n\n\nWhat is an Apprenticeship?\n\nIBM Apprenticeship Program is an official registered apprenticeship recognized by the Department of Labor (DOL). Every graduate of a Registered Apprenticeship program receives a nationally-recognized credential from the DOL.\n\nDuring the apprenticeship duration, you will be required to complete specific learning hours and on the job training that has been outlined to ensure you are developing the skills and competencies essential to the role. You will be able to learn and grow at your own pace, but we expect most apprentices will complete their learning within 24 months. Once you graduate and receive your certificate from our apprentice program, you will be eligible to apply to available full-time roles at IBM.\n\n\nWho you are\n\nAn apprenticeship is about learning. We’re seeking candidates who have the following requirements, but we know you’re just getting your career started, and we’re committed to helping you learn and grow. If you are a highly curious individual, with a passion for learning, and a love of mathematics and data, you’re exactly the type of candidate we’re looking for. Data scientists are inquisitive: exploring, asking questions, doing what if analysis, questioning existing assumptions and processes. They are analytically-minded, statistically and mathematically driven.\n\nTo be successful, you need:\nDrive and eagerness to learn\nStrong problem solving, critical thinking, organization, and communication skills\nAbility to work independently and take initiative, as well as work collaboratively and contribute in a team environment as data science is a team sport\nAbility to think analytically in solving problems\n\nWhat’s the experience?\n\nAs an apprentice, you'll join with other apprentices in a local cohort. You'll go through the program together, learning about IBM and the skills you'll be attaining throughout your apprenticeship. Then, you'll work with your managers and mentors to progress through your personal skills roadmap, learning and demonstrating new knowledge and competencies through hands-on application with your project teams. You'll complete milestones along the way, earning digital credentials to validate your skills, and will come back together with other apprentices to participate in on-going training and development focused on your professional and technical skills. Best of all, you are a contributing member of your team, putting forward ideas, taking on responsibilities and making choices about how you get the job done just like any other IBMer.\n\nRelocation funding is not available for this role.\n\nncappx\n\nWillingness to complete the requirements of the apprenticeship program\nCuriosity, Passion for learning, Love for math, data, and analysis\nSome knowledge or experience in ONE or more of the following: Java, JavaScript, PHP, C#, Objective-C, C/C++, Python, Ruby and/or functional languages (Haskell, Scala, F#, Clojure)\n\nAn undergraduate degree is not required, but students who have taken high school advanced math, and statistics classes are preferred\nPython Programming knowledge\n\nIBM Services is a team of business, strategy and technology consultants that design, build, and run foundational systems and services that is the backbone of the world's economy. IBM Services partners with the world's leading companies in over 170 countries to build smarter businesses by reimagining and reinventing through technology, with its outcome-focused methodologies, industry-leading portfolio and world class research and operations expertise leading to results-driven innovation and enduring excellence.\n\nWhat matters to you when you’re looking for your next career challenge?\n\nMaybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.\n\nImpact. Inclusion. Infinite Experiences. Do your best work ever.\n\nIBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.\n\nIBM will not be providing visa sponsorship for this position now or in the future. Therefore, in order to be considered for this position, you must have the ability to work without a need for current or future visa sponsorship.\n\nIBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status."}