{"title": "GS Data Scientist", "company": "Goldman Sachs", "description": "MORE ABOUT THIS JOB\nWhat We Do\nAt Goldman Sachs, our Engineers don’t just make things – we make things possible. Change the world by connecting people and capital with ideas. Solve the most challenging and pressing engineering problems for our clients. Join our engineering teams that build massively scalable software and systems, architect low latency infrastructure solutions, proactively guard against cyber threats, and leverage machine learning alongside financial engineering to continuously turn data into action. Create new businesses, transform finance, and explore a world of opportunity at the speed of markets.\n\nEngineering, which is comprised of our Technology Division and global strategists groups, is at the critical center of our business, and our dynamic environment requires innovative strategic thinking and immediate, real solutions. Want to push the limit of digital possibilities? Start here.\n\nWho We Look For\nMotivated Data Engineer with proven industry experience in machine learning, data engineering and building robust data pipelines. Strong computer science fundamentals are key to success in this role. The ideal candidate should be an individual contributor, a positive team player and willing to get things done.\nRESPONSIBILITIES AND QUALIFICATIONS\nResponsibilities:\nBuild machine learning and NLP models to build new product features and improve business metrics.\nPerform exploratory data analysis and causation/attribution/correlation identifying key insights to help decisions and business strategy.\nDocument model explainability and decay and deploy models with proper governance.\nWork with product managers, engineers, marketers and designers, and senior executives to optimize key translate business insights into decisions and action\nBuild and improve our machine learning deployment and data pipeline platforms.\n\nQualifications\nBachelor’s Degree in a field like computer science, statistics, economics or applied math.\nStrong knowledge of statistical analysis and exploratory data analysis techniques for prescriptive analytics.\nProfessional experience in an advance analytics-based data science/ machine learning engineer or stats role.\nProfessional experience working in cloud environment like AWS.\nStrong knowledge of machine learning concepts like regression, classification, clustering, heuristics, boosting, feature engineering, etc.\nStrong Proficiency in SQL, notebooks and Python.\nUnderstanding of open source libraries for solving orchestration, model deployment, model explainability and management.\nBasic understanding of new deep learning techniques like GANs, RNNs, CNNs and platforms like keras/tensorflow used to implement these.\n\nWhy Goldman Sachs\nUnparalleled responsibility and career opportunity to make a highly visible global impact\nYou will be part of a large community of like-minded technologists in a flat organization with a culture that promotes collaboration, “can do” mindsets and teamwork\nResponsibility for requirements gathering, analysis, design and development of funding systems\nForge strong relationships with our clients across all of our businesses, as well as other technology teams to develop and enhance our systems and processes\nDevelop solutions that directly impact the bottom line by enabling new investment opportunities for our business partners\nOpportunity to work on unprecedented projects both at Goldman Sachs & more broadly in the financial services industry\nABOUT GOLDMAN SACHS\nThe Goldman Sachs Group, Inc. is a leading global investment banking, securities and investment management firm that provides a wide range of financial services to a substantial and diversified client base that includes corporations, financial institutions, governments and individuals. Founded in 1869, the firm is headquartered in New York and maintains offices in all major financial centers around the world.\n\n© The Goldman Sachs Group, Inc., 2019. All rights reserved Goldman Sachs is an equal employment/affirmative action employer Female/Minority/Disability/Vet."}