{"title": "Data Scientist", "company": "Dentsu Aegis Network", "description": "Job Title:\nData Scientist\nJob Description:\nTeam Write-Up\n360i Advanced Analytics is about taking complex data to devise elegant yet simple, actionable solutions to our clients' business questions. Our clients see us as trusted advisors and depend on our subject matter expertise to drive enhanced decision making via our deep (and constantly evolving) marketing analytics capabilities.\nFor this role, we are looking for someone who is deeply interested in the application of advanced statistic and econometric methodologies in both theory and practice. Candidates should be intellectually curious with a passion for learning while simultaneously a pragmatic self-starter who sees projects through to completion.\nData Scientist\nResponsibilities\nOperate 'in-the-weeds' on client analytics engagements, executing the below within Python or R:\nCleanse, compile and process data\nExecuting statistical/econometric frameworks in either\nUnder direction of Manager/AD, develop custom analytical tools for ongoing media optimization\nParticipate in stakeholder interview process for each project to frame analytics solutions through appropriate lens\nAssist in discovery of new analytics methodologies, outline roadmap for tool development, and execute tool build\nInterface directly with media team and client (when applicable) on interpretation of analytics outputs and how to implement results\nQualifications & Requirements:\nBachelors Degree in a quantitative field\nUnderstanding of econometric and statistical frameworks, including but not limited to:\nMultivariate linear regression, logistic regression, Bayesian networks, clustering, etc.\n1-2 years working experience in analytics or other consultancy\nPossess the ability to receive direction, take ownership, and operate independently to solve to client requests using a combination of critical thinking and initiative\nStrong interpersonal skills or the demonstrated desire to develop client management ability\nExperience with marketing response models and their applications a plus\nFunctional working knowledge of R and/or Python (e.g., can process data and run statistical analyses)\nExpert in Excel and PowerPoint\nLocation:\nNew York\nBrand:\n360I\nTime Type:\nFull time\nContract Type:\nPermanent"}