{"title": "Global Data Scientist", "company": "Innovations for Poverty", "description": "The Global Data Scientist is an expert in statistics, data science, and quantitative research who supports a large portfolio of research projects across diverse geographies, sectors, and methods. This position will work as a technical lead on IPA’s Global Research and Data Support (GRDS) Team*. The Global Data Scientist’s role will include, but not be limited to, the following activities:\nResponsibilities\nDeveloping software applications and data management systems (25%). The Global Data Scientist will design and develop software applications and data management systems that help to improve the quality of IPA’s data, including user-written Stata commands and Python-based applications.\nSupporting staff technical capacity (25%). The Global Data Scientist will prepare and lead training sessions and remote courses on topics such as statistical inference, survey programming, and data quality control processes. The Global Data Scientist will also provide technical guidance and troubleshooting/support for technical staff in IPA’s 21 country offices. Depending on the applicant’s managerial experience, the Global Data Scientist may also directly oversee other coders and trainers.\nExpanding the scope of IPA’s technical services (15%). The Global Data Scientist will research, adapt, and design innovative methods to broaden IPA’s portfolio of evaluation and technical services. Depending on the applicant’s technical experience, the Global Data Scientist may for example lead the selection of new software applications for global use, or the development of new data management protocols.\nPartnering with project teams to increase the technical rigor of project deliverables (15%). The Global Data Scientist will help draft and refine technical documents, which may include evaluation designs, pre-analysis plans, sample size calculations, and other documents.\nDocumenting knowledge and best practices (10%). The Global Data Scientist will write detailed code and process documentation for technical teams, clear knowledge articles for consumption by global research staff, and occasional public-facing blog posts.\nSupporting other research-related activities as necessary (10%). The Global Data Scientist may be asked to troubleshoot technical products, support regional technical teams, assist with strategic projects and initiatives, or perform any related duties assigned by the Associate Director.\nQualifications\nMinimum qualifications\nUndergraduate (or above) degree in economics, statistics, computer science, engineering, or related fields\nTwo years of relevant work experience, such as performing advanced statistical analysis, developing software applications, and/or designing evaluations\nDemonstrated statistical programming and data management skills (Stata preferred, Python or R can substitute)\nDemonstrated expertise in methods for causal inference in social science\nPreferred qualifications\nExperience with data collection platforms and technologies (e.g. ODK/SurveyCTO, Survey Solutions)\nExperience supervising field or technical teams\nExperience conducting field research in developing countries\nExperience training staff or developing training content\nExperience with software or machine learning engineering\nTravel requirements\nNote that this position requires willingness to travel internationally up to 35% of the time. You can see a list of IPA’s worldwide offices at https://www.poverty-action.org/research."}