{"title": "Data Scientist, Risk", "company": "Square", "description": "Job Description\n\nAs a Senior Data Scientist at Square working on Risk, you will lead projects that derive value from our unique, rich, and rapidly growing data. Specifically, you will lead the development of fraud detection algorithms and systems that protect Square and its customers from fraud and financial loss.\nYou will:\nCreatively leverage both new and existing data to increase the effectiveness and efficiency of our risk infrastructure\nWork with engineers to design machine learning solutions that operate effectively at scale\nPartner with operatives to quickly respond to rapidly evolving threats\nApply good software development practices and actively contribute to production code\nHelp build the next generation of data products at Square\n\nQualifications\n\nYou have:\n2-4 years of relevant industry experience\nA graduate degree in statistics, applied mathematics, computer science, physical sciences, or a similar technical field\nExperience developing and deploying machine learning / deep learning solutions\nThe versatility to communicate clearly with both technical and non-technical audiences\nA willingness to solve problems using whichever tool is most appropriate for the situation\nTechnologies we use and teach:\nPython (numpy, pandas, sklearn, xgboost, TensorFlow)\nMySQL, Hive\nJava\nGoogle Cloud Platform\nTableau, Looker\n\nAdditional Information\n\nAll your information will be kept confidential according to EEO guidelines.\nAt Square, our purpose is to empower – within and outside of our walls. In order to build the best tools for the businesses and customers we support all over the world, we have to start at home with a workforce as diverse and empowered as our sellers. To this end, we take great care to evaluate all employees and job applicants equally, based on merit, competence, and qualifications. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, disability status, or any other characteristic protected by law. We encourage candidates from all backgrounds to apply and always consider qualified applicants with arrest and conviction records, in accordance with the San Francisco Fair Chance Ordinance. Applicants in need of special assistance or accommodation during the interview process or in accessing our website may contact us by sending an email to assistance(at)squareup.com. We will treat your request as confidentially as possible. In your email, please include your name and preferred method of contact, and we will respond as soon as possible."}