{"title": "Programmer/Data Scientist", "company": "New York University", "description": "New York University: NYU: Faculty of Arts and Science (FAS): Politics Department\nLocation\nNew York City\nOpen Date\nFeb 22, 2019\nDescription\nThe SMaPP lab at NYU is looking for a full-time software engineer to help build software and\ntools for collecting, processing, analyzing, and understanding large social media data sets. You\nwill use modern programming tools to manage multi-terabyte databases, build data pipelines,\npreprocess data, and produce meaningful data visualizations. We require candidates to have\neither experience programming in relevant environments OR a degree in CS. Significant skills\nworking with Python are mandatory. Experience with linux/unix systems and bash, SQL, R or\njavascript is a plus, as is experience with natural language processing, machine learning\nmodels, and network analysis. Interest in politics or social science combined with these\nprogramming skills is a plus.\n\n\nYou will be given the opportunity to participate fully in the research environment, including\nauthoring papers and open source software, attending conferences and seminars, and working\nclosely with a broad group of researchers associated with the lab.\n\n\nThe New York University Social Media and Political Participation (SMaPP) laboratory\n(https://smappnyu.org/about/) is a path-breaking, interdisciplinary lab bringing new collaborative\nresearch models to the study of politics. Established in the fall of 2012, the lab’s goals are\nthreefold: (1) to pursue research on the relationship between social media and politics; (2) to\npursue research featuring the innovative use of social media data to study politics and political\nphenomena; and (3) to develop open source tools that facilitate the use of social media data for\nthe study of politics.\n\n\nFor more information about our goals, methods, and recent publications see:\nhttps://smappnyu.org\n\n\nFor links to additional SMaPP lab papers see:\nhttps://smappnyu.org/journal-articles/\n\n\nFor examples of SMaPP lab research and researchers being discussed in the media, see:\nhttps://smappnyu.org/mediaevents/media/\nQualifications\nRequired education: an undergraduate degree in computer science or an analytical social\nscience\n\n\nRequired experience: significant knowledge of and experience with programming in Python\n\nPreferred education: master’s in computer science, data science, or an analytical social\nscience is a plus\n\nPreferred experience: 1+ years programming in a relevant environment, either in research or\nindustry; fluency with linux/unix systems and bash, SQL, R, or Javascript; experience with\nnatural language processing, machine learning models, and network analysis is a plus\nApplication Instructions\nPlease send a CV and links to any relevant coding projects, websites, or projects. A brief cover\nletter describing relevant experience and explaining your interest in the position is optional, but it\nwould be helpful if you can highlight specific skills or experiences that you believe would be\nvaluable for success in this position."}