{"title": "Product Analyst, Data Science", "company": "Google", "description": "Note: By applying to this position your application is automatically submitted to the following locations: Mountain View, CA, USA; San Bruno, CA, USA; New York, NY, USA\nMinimum qualifications:\nBA/BS degree or equivalent practical experience.\n3 years of experience working with statistical packages (e.g. R, SAS, Stata, MATLAB, etc.).\nExperience articulating product questions, pulling data from datasets (SQL) and using statistics to arrive at an answer.\n\nPreferred qualifications:\nBA/BS or Master's degree in a quantitative field such as; Statistics, Computer Science, Engineering, Mathematics, Data Sciences.\nExperience in scripting with SQL, extracting large sets of data, and design of ETL flows.\nExperience in an inter-disciplinary/cross-functional field.\nInterest and aptitude in data, metrics, analysis and trends and applied knowledge of measurement, statistics and program evaluation.\nAbility to translate analysis results into business recommendations, and excellent written and verbal communication skills.\nDistinctive problem solving skills and impeccable business judgment.\nAbout the job\nProduct Analysts provide quantitative analysis, market expertise and a strategic perspective to our partners throughout the organization. As a data-loving member of the team, you'll serve as an analytics expert for your partners, using numbers to help them make better decisions. You will weave stories with meaningful insight from data. You'll make key recommendations for your fellow Googlers in Engineering and Product Management.\nAs a Product Analyst, you relish tallying up the numbers one minute and communicating your findings to a team leader the next. You can see different angles of a product or business opportunity, and you know how to connect the dots and interact with people in various roles and functions. You will work to effectively turn business questions into data analysis, and provide meaningful recommendations on strategy.\nResponsibilities\nConduct data analysis to make business recommendations (e.g. cost-benefit, invest-divest, forecasting, impact analysis).\nDeliver effective presentations of findings and recommendations to multiple levels of stakeholders, creating visual displays of quantitative information.\nDevelop and automate reports, iteratively build and prototype dashboards to provide insights at scale, solving for business priorities.\nCollaborate with cross-functional stakeholders to formulate and complete full cycle analysis that includes data gathering, analysis, ongoing scaled deliverables and presentations.\nHelp Google to focus on key decisions to improve products and services.\nAt Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing this form."}