{"title": "Data Intelligence Analyst", "company": "Medidata Solutions", "description": "Medidata: Conquering Diseases Together\n\nMedidata is leading the digital transformation of life sciences with the world's most-used platform for clinical development, commercial and real-world data. Powered by artificial intelligence and delivered by #1 ranked industry experts, the Intelligent Platform for Life Sciences helps pharmaceutical, biotech, medical device companies and academic researchers accelerate value, minimize risk and optimize outcomes. Medidata serves more than 1,000 customers and partners worldwide and empowers more than 100,000 certified users every day to create hope for millions of patients. Discover the future of life sciences: www.mdsol.com\nWe know that diverse teams win and are fully committed to selecting leaders and employees that represent the markets in which we operate. We are still led by our Co-founders, Tarek Sherif and Glen de Vries, and have global operations in US, Europe and Asia with over 2000 employees.\n\nAbout AcornAI - a Medidata company\nMedidata’s journey started in 1999 when a scientist working on his first clinical trial waded through inefficiencies and delays – and knew that technology could improve the process. Almost 20 years later, we've grown to be the leader in clinical technology. In 2019, we launched AcornAI to meet changing biopharma need as companies rapidly progress to the age of precision medicine.\nBuilt on our platform with the industry’s largest structured, standardized and growing clinical trial data repository consisting of 17,000+ trials and 4.5M patients, AcornAI is one of the largest AI companies exclusively dedicated to life sciences. Our team is composed of over 40 PhD/Masters statisticians, data scientists, analytical product leads, former FDA biostatisticians and computational genomicists.\nAcornAI’s delivery team is looking for individuals who will help us tackle some of the most complex questions facing the industry today using our proprietary AcornAI platform and advanced analytics. In this role, you will engage with clients throughout projects to ensure the best analytical approach, successful delivery and client satisfaction. At AcornAI, we never work alone. This role will partner heavily with all of the key stakeholder functions including Product, Data Science, Engineering, partnerships and Biostatistics. Successful candidates will be skilled in analytical/quantitative thinking, structured communication and excited about building the next horizon of Medidata’s journey of powering smarter treatments and healthier people.\nYour Mission:\nWork cross-functionally to gather and analyze information, formulate and test hypotheses, and communicate recommendations on some of the most complex issues in the industry today\nDevelop external communication materials, translating and summarizing technical information for business audiences and developing key messaging\nPerform and share analyses to guide internal and external decision making\nDrive problem-solving with data scientists and other stakeholders to identify the analytics needed to answer client questions and generate impact in line with our mission\nTrack and communicate progress and decisions clearly, triage issues to the appropriate internal stakeholder and ensure timely effective issue resolution\nCreate processes so that each project is easier and faster than the last one\nYour Education & Experience:\nMust-have qualifications and expertise:\nBachelors degree or equivalent experience\n2+ years of work experience in one of the following types of highly structured or scientific environments: management/healthcare consulting, life sciences, data and analytics role\nOutstanding structured and critical thinking\nA passion for understanding complex issues with a data driven approach\nA technical bent and the ability to use or to learn to use tools to answer your own questions (e.g. Excel/SQL/Python)\nSuperb project management and a relentless drive to get things done\nWilling to master the detail when you need to but also zoom out and have a view on how to shape the bigger picture\nThe following will be helpful, but are not essential:\nAn entrepreneurial drive and a passion to advance the development of new treatments\nEnjoy experimenting and iterating on different ways to solve a problem\nA strong analytical background and the ability to quickly digest and evaluate complex analyses with a keen eye for detail\nExperience working in Life sciences or across the healthcare value chain\nCan drive forward even amidst ambiguity (people, process, data) and complexity\nMedidata is making a real difference in the lives of patients everywhere by accelerating critical drug and medical device development, enabling life-saving drugs and medical devices to get to market faster. Our products sit at the convergence of the Technology and Life Sciences industries, one of most exciting areas for global innovation. Nine of the top 10 best-selling drugs in 2017 were developed on the Medidata platform.\nMedidata’s solutions have powered over 14,000 clinical trials giving us the largest collection of clinical trial data in the world. With this asset, we pioneer innovative, advanced applications and intelligent data analytics, bringing an unmatched level of quality and efficiency to clinical trials enabling treatments to reach waiting patients sooner.\n\nMedidata Solutions, Inc. is an Equal Opportunity Employer. Medidata Solutions provides equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, gender, sexual orientation, gender identity, national origin, age, disability status, protected veteran status, or any other characteristic protected by the law. Medidata Solutions complies with applicable state and local laws governing non-discrimination in employment in every location in which the company has facilities.\n\n#LI-AS2"}