{"title": "Data Scientist – Customer Science", "company": "Jet.com", "description": "Walmart’s Customer organization is evolving to the next generation, with a focus on providing the best online and in store experience for customers. Customer Science is an integral part of this organization that leads customer data science, planning and strategy development, customer journey, communications, as well as in store and online experience for the 140 million U.S. customers that shop at Walmart every week. Whether in store or online Walmart is serving customers’ changing needs of retail.\nAs a part of Walmart’s Customer Data Science team, you’ll be the voice of our customer. Why? Because Sam Walton founded our company with the belief that the customer is #1. It’s not just a belief, but our way of doing business. With the customer at the forefront, we have the ability to help deliver the easiest shopping experience at the lowest cost, both digitally and physically. That’s where you come in.\nWalmart’s Customer Data Science is seeking top data scientists to work on challenging customer centric business problems across the company. The roles have openings in San Bruno CA, Hoboken NJ and Bentonville AK. Successful candidates will:\nhave extensive exposure to all aspects of Retail/eCommerce from the technical, strategic, and operational perspective\nwork closely with incredibly talented people across the company from a huge variety of backgrounds\nbe challenged by the nature and complexity of what needs to occur in terms of building solutions and the scale involved\nhave access to resources that comes with being part of the largest most successful retail company in the world\nHow you can impact the company:\nWork closely with team of data scientist and analysts on requirements around propensity models and methods for growing customer lifetime value. These models would be used directly for inference, or as input consumed by other business partners or stakeholders across the company.\nActively support research and implementation of advanced statistical methodologies and applied behavioral science concepts in the design and analysis of qualitative, observational and randomized controlled experiments. These experiments would be conducted in collaboration with business partners or stakeholders across the company.\nCollaborate with team of data scientists and analysts on core requirements for building machine learning models and methods focused on understanding and predicting customer behavior. Leverage multi-channel customer insights to deliver enhanced personalized customer experience; design interventions to optimize customer lifetime value; build bigger shopper baskets; improve product discoverability\nAbout you:\nPhD (or truly spectacular Masters student with exceptional business experience) in Statistics, Applied Math, Economics, Computer Science or related fields.\nFundamental knowledge of optimization and statistical modeling.\nFundamental understanding of experimentation methodologies.\nFundamental knowledge of theoretical and applied machine learning with experience implementing reusable code.\nExperience with data science tools and applications e.g. Tensorflow, Keras, Theano, Scikit-learn relational databases systems, Spark, Hadoop, etc.\nExperience using cloud computing for data processing and modeling.\nHigh level of comfort with analytical approaches and quantitative methods to deal with very large datasets.\nFlexible, collaborative approach to problem solving."}