{"title": "Associate,Data Sciences (Wave Maker)", "company": "Wavemaker", "description": "SENIOR ANALYST, DATA SCIENCES\n\nAbout Wavemaker\n\nFuture Makers: Bound by our Purchase Journey approach, we help clients translate audience behaviors and insights into smart decisions today, for a prosperous tomorrow.\n\nBeing a CMO right now means experiencing the buzz of knowing that anything is possible and then feeling the challenge of deciding where to focus with clarity and confidence. Our business is to support, consult and execute the making of these decisions. We bring together data, creativity and platforms to help the best brands in the world make the futures they want by making better choices today.\n\nAll our people, processes and technology are united through our focus on understanding, accelerating and optimizing purchase journeys; making them more satisfying for consumers and more effective for our clients.\n\nPosition Overview\n\nThe Senior Analyst’s role is to support and own operations that are crucial to the Wavemaker promise of making smarter, faster decisions for its clients. He/she will leverage Wavemaker’s proprietary data solutions to meet our clients’ and planning teams’ needs for data management and visualization. They will also support the development of meaningful, actionable reporting and insights using a wide array of analytical methods. Be prepared to describe your experience in deriving insights in a data-rich environment.\nThis position requires both a strategic and tactical viewpoint, aided by intellectual curiosity, strong problem solving skills, along with an understanding of digital and traditional media. The candidate is expected to demonstrate: hands-on skills in data analysis, processing, management and visualization. He/she is expected to have excellent oral and written communication skills as well as possess the ability to support and enable teamwork. The position will support the Manager/Associate Director to ensure consistent quality output on all projects.\n\nRoles & Responsibilities\nAssist in the development of business intelligence platforms (Tableau) for data visualization and insight generation for use in campaign monitoring and optimization.\nAssist in the build and development of custom databases on the reporting platform.\nCollect data requirements from client teams to assist in database build.\nMeasures the success of media campaigns, comparing performance to the client’s objectives and constantly seeking ways to improve the accuracy or timeliness of this measurement.\nAssist in the development of presentations of analytical insights to clients & agency teams.\nManage the retrieving, compiling, and formatting of large volumes of data.\nCommunicate technical terms to non-technical people, and helping them understand why change might be required to achieve a specific goal or to complete a project.\nHelp develop automated QA processes to ensure data accuracy and timeliness.\nRequirements\nBachelor’s degree in Marketing, Advertising, Economics, Computer Science, Information Systems, Business Analytics or related field\nAt least 1 year of work experience in data management or data analytics preferably in a marketing and/or media agency.\nStrong analytical skills; ability to manage, manipulate and analyze raw data, draw conclusions, and develop actionable recommendations\nExperience with data from web/ad measurement technologies such as: ad serving platforms (e.g. DFA, Sizmek), campaign management (e.g. Prisma), website analytics software (e.g. Adobe Analytics, Google Analytics), paid search engine marketing data sources (e.g. Adwords, Marin, DoubleClick) is strongly preferred)\nExperience working with tools such as Tableau (or similar BI tools), Alteryx, SQL or advanced excel skills\nKnowledge of visual techniques for data analysis and presentation is a plus\nExperience with database structures; experience working with Microsoft Azure a plus\nAbility to communicate and understand business requirements from non-technical stakeholders while simultaneously managing their expectations at the same time\nAbility to work in a fast-paced environment with a customer-centric focus.\nQualities\nQuick learner and creative thinker\nExtremely organized, detail oriented and QA focused\nExtremely good time management skills\nVery comfortable with numbers\nExcellent communication, presentation and report writing skills\nAbility to see the big picture\nA natural desire to learn and gain knowledge from outside the agency\nThrives in a fast pace, constantly changing environment; can adapt plans due to changes in client objectives, priorities or budgets while minimizing impact on project momentum"}