{"title": "Data Scientist, Digital Machine Learning", "company": "Capital One - US", "description": "11 West 19th Street (22008), United States of America, New York, New York\n\nAt Capital One, we’re building a leading information-based technology company. Still founder-led by Chairman and Chief Executive Officer Richard Fairbank, Capital One is on a mission to help our customers succeed by bringing ingenuity, simplicity, and humanity to banking. We measure our efforts by the success our customers enjoy and the advocacy they exhibit. We are succeeding because they are succeeding.\n\nGuided by our shared values, we thrive in an environment where collaboration and openness are valued. We believe that innovation is powered by perspective and that teamwork and respect for each other lead to superior results. We elevate each other and obsess about doing the right thing. Our associates serve with humility and a deep respect for their responsibility in helping our customers achieve their goals and realize their dreams. Together, we are on a quest to change banking for good.\n\nData Scientist, Digital Machine Learning\n\nAt Capital One, data is at the center of everything we do. When we launched as a startup we disrupted the credit card industry by individually personalizing every credit card offer using statistical modeling and the relational database, cutting edge technology in 1988! Fast-forward a few years, and this little innovation and our passion for data has skyrocketed us to a Fortune 200 company and a leader in the world of data-driven decision-making.\n\nTeam Description\nDigital ML is the data science and machine learning team inside Capital One’s Digital Products organization. We deliver real-time, personalized, intelligent customer experiences in Capital One’s suite of award-winning digital products, including our website, mobile app, emails, chatbot, and beyond. We partner closely with our product and engineering teams to build the data and modeling platforms crucial to the deep understanding of customers that enables our applications to delight them by adapting to their needs.\n\nAs part of Digital ML, you will:\nExplore billions of clickstream events to discover the patterns in customer behavior, and use those patterns to model key customer outcomes\n\nBuild and leverage an enterprise-wide taxonomy of customer data to optimize digital marketing initiatives\n\nDevelop the real-time models that use vast amounts of customer data to anticipate customers’ needs and deliver the right message at the right time\n\nDevelop the models that ensure our most important customer data is accurate, fighting fraud and other bad behavior, while enabling seamless digital experiences across all our products\n\nRole Description\nIn Digital ML, you will work at all phases of the data science life cycle, including:\n\nBuild machine learning models through all phases of development, from design through training, evaluation and validation, and partner with engineering teams to improve o perationalization in scalable and resilient production systems that serve 50+ million customers.\n\nPartner closely with a variety of business and product teams across Capital One to conduct the experiments that guide improvements to customer experiences and business outcomes in domains like marketing, servicing and fraud prevention.\n\nWrite software (Python, Scala, e.g.) to collect, explore, visualize and analyze numerical and textual data (billions of customer transactions, clicks, payments, etc.) using tools like Spark, Elasticsearch, and AWS.\n\nThe Ideal candidate will be:\nCurious and creative. You thrive on bringing definition to big, undefined problems. You love asking questions, and you love pushing hard to find the answers. You’re not afraid to share a new idea. You communicate clearly and effectively to share your findings with non-technical audiences.\n\nTechnical: You have hands-on experience developing data science solutions from concept to production using open source tools and modern cloud computing platforms. You are not afraid of petabytes of data.\n\nStatistically-minded. You have built models, validated them and back-tested them. You know how to interpret a confusion matrix or a ROC curve. You have experience with clustering, classification, sentiment analysis, time series analysis and deep learning.\n\nCustomer and product oriented. You share our passion for changing banking for good.\n\nBasic Qualifications:\nBachelor’s Degree and 2 years of experience in data analytics, or Master’s Degree and 1 year of experience in data analytics, or PhD\nAt least 1 year of experience in open source programming languages for data analysis\nAt least 1 year of experience with machine learning\nAt least 1 year of experience with relational databases\n\nPreferred Qualifications:\nMaster’s Degree in “STEM” field (Science, Technology, Engineering, or Mathematics) and 1 year of experience in data analytics, or PhD in “STEM” field (Science, Technology, Engineering, and Mathematics)\nAt least 1 year experience working with AWS\nAt least 3 years’ experience in Python, Scala, or R\nAt least 3 years’ experience with machine learning\nAt least 3 years’ experience with SQL\n\nCapital One will consider sponsoring a new qualified applicant for employment authorization for this position."}