{"title": "Data Scientist", "company": "Booz Allen Hamilton", "description": "The Challenge:\nAre you excited at the prospect of unlocking the secrets held by a data set? Are you fascinated by the possibilities presented by IoT, machine-learning, and artificial intelligence advances? In an increasingly connected world, massive amounts of structured and unstructured data open up new opportunities. As a data scientist, you can turn these complex data sets into useful information to solve global challenges.\nWe have an opportunity for you to use your leadership and analytical skills to improve Booz Allen’s commercial practice. You’ll work closely with clients to understand their questions and needs, then dig into their data-rich environment to find the pieces of their information puzzle. You’ll mentor teammates, conduct data analysis and modeling, design data-driven solutions and approaches for clients, and use the right combination of tools and frameworks to turn that set of disparate data points into objective answers to help our commercial security clients make informed decisions. You’ll provide your customer with a deep understanding of their data, what it all means, and how they can use it. Join us as we use data science for good in commercial Cybersecurity.\nEmpower change with us.\nYou Have:\n3+ years of experience with data science, mathematics, statistics, CS, economics, or data-driven problem-solving\nExperience with conducting analytics, data transformation, or visualization using tools, including Python, Java, JavaScript, or R\nExperience in collaborating with multi-disciplinary teams\nExperience with working in an Agile development environment, including providing analytics or CS support\nAbility to operate independently and manage staff\nAbility to travel extensively up to 75% of the time\nBA or BS degree\n\nNice If You Have:\nExperience with Cybersecurity or fraud domains preferred\nExperience in a consulting or client-facing environment\nPossession of excellent oral and written communication skills, including using presentation expertise to convey complex ideas to client and internal staff\nPossession of excellent problem-solving skills, including in a collaborative environment\nMA or MS degree\nBuild Your Career:\nAt Booz Allen, we know the power of analytics and we’re dedicated to helping you grow as a data analysis professional. When you join Booz Allen, you can expect:\naccess to online and onsite training in data analysis and presentation\nmethodologies, and tools like Hortonworks, Docker, Tableau, and Splunk\na chance to change the world with the Data Science Bowl—the world’s premier data science for social good competition\nparticipation in partnerships with data science leaders, like our partnership with NVIDIA to deliver Deep Learning Institute (DLI) training to the federal government\n\nYou’ll have access to a wealth of training resources through our Analytics University, an online learning portal specifically geared towards data science and analytics skills, where you can access more than 5000 functional and technical courses, certifications, and books. Build your technical skills through hands-on training on the latest tools and state-of-the-art tech from our in-house experts. Pursuing certifications? Take advantage of our tuition assistance, onsite boot camps, certification training, academic programs, vendor relationships, and a network of professionals who can give you helpful tips. We’ll help you develop the career you want, as you chart your own course for success.\nWe’re an EOE that empowers our people—no matter their race, color, religion, sex, gender identity, sexual orientation, national origin, disability, veteran status, or other protected characteristic—to fearlessly drive change."}