{"title": "Data Scientist", "company": "New York City DEPARTMENT OF TRANSPORTATION", "description": "This candidate will serve as Data Scientist in NYC DOT’s Bike Share Program, which is responsible for planning and oversight of the Citi Bike system, dockless bike share services, and advance planning for other potential shared micromobility services. Citi Bike is a public transportation service and a public-private partnership that is among the largest and most successful bike sharing system in the world. It currently consists of 13,000 bicycles at over 750 rental stations in Manhattan, Brooklyn, and Queens. It will expand into new neighborhoods and boroughs over the next five years, ultimately doubling the size of its existing service area and tripling its number of bikes. Dockless bike share is a newer service model that was piloted at a small scale in 2018 and will be piloted at a larger scale—including a full-borough demonstration project in Staten Island—in 2019 and beyond.\n\nUnder the direction of the Executive Director and senior Program staff, this candidate will perform research and analysis activities related to bike share program data that will inform current and future planning; conduct economic research and studies involving estimates and forecasts regarding bike share transportation services; analyze data, develop predictive models to answer complex and nuanced questions about the programs and anticipate future needs and behavior of the systems; collect, classify, evaluate, and analyze data, develop statistical models, and use programming language to examine complex and nuanced questions about bike share services; prepare reports and briefing materials based on databases that underlie the bike share systems and DOTs management of same; monitor vendor compliance with governmental regulations, DOT policies, and contract terms; establish and monitor best practices, policies, procedures and documentation around bike share data; plan, design, maintain, and support unit internal databases; communicate technical issues to technical and non-technical audiences; and perform related duties.\n\nCandidate should be proficient in Python, SQL, and GIS, and possess advanced statistical analysis abilities and data visualization skills. Candidate should have proven experience working with geospatial and time-series data.\n\n\nMinimum Qual Requirements\n\n1. A master's degree from an accredited college or university in economics, statistics, finance, management, business administration, public administration, public policy or related field; or\n\n2. A baccalaureate degree from an accredited college or university, including or supplemented by 24 semester credits in one or more of the course areas of economics, statistics,\nfinance, management, mathematics, business administration, public administration, and public policy, 12 semester credits of which must have been in economics; and one year of satisfactory full-time experience in one or more of the\nfields of finance; economic, fiscal or statistical research; policy analysis; or quantitative, business, market or financial analysis. Graduate semester credits in any of the areas described in \"1\" above may be substituted for the undergraduate\nsemester credits on the basis that each 3 graduate semester credits may be substituted for 6 of the required undergraduate semester credits.\n\nSpecial Note\nTo be eligible for placement in Assignment Level II individuals must have, in addition to meeting the minimum requirements, at least one additional year of full-time experience listed in \"2\" above.\n\nSpecial Note\nTo be eligible for placement in Assignment Level III individuals must have, in addition to meeting the minimum requirements, at least two additional years of full-time experience listed in \"2\" above.\n\n\nPreferred Skills\n\nExperience working with distributed computing paradigms, experience in front end development with Javascript, and fluency in other programming languages, such as Scala, R, etc., are highly desirable. Very strong preference given to candidates demonstrating strong creative and analytical problem-solving skills and having experience or demonstrated interest in transportation dynamics, transportation policy, bike share, micromobility, and/or cycling. Experience working with the public, community groups, and New York City agencies, and strong verbal and written communication skills all desired.\n\n\nAdditional Information\n\nNote: This position is open to qualified persons with a disability who are eligible for the 55-a program. Please indicate in your resume or cover letter that you would like to be considered for the position under the 55-a program.\n\n\nTo Apply\n\nAll resumes are to be submitted electronically.\n\nCurrent City Employees:\nPlease log into Employee Self Service (ESS) at https://hrb.nycaps.nycnet, follow the Careers link and search for Job ID number 408907.\n\nAll other applicants:\nPlease go to www.nyc.gov/careers/search and search for Job ID Number 408907.\n\nIf you do not have access to a personal computer:\nPlease visit your local public library. Most public libraries have computers available for use.\n\nNo phone calls, faxes or personal inquiries permitted.\nOnly those applicants under consideration will be contacted.\nFor more information about DOT, visit us at: www.nyc.gov/dot.\n\n\nWork Location\n\n55 Water St Ny Ny\n\n\nResidency Requirement\n\nNew York City residency is generally required within 90 days of appointment. However, City Employees in certain titles who have worked for the City for 2 continuous years may also be eligible to reside in Nassau, Suffolk, Putnam, Westchester, Rockland, or Orange County. To determine if the residency requirement applies to you, please discuss with the agency representative at the time of interview."}