{"title": "Jr. Data Scientist - Technology Associate Program", "company": "Chubb", "description": "Jr. Data Scientist - Technology Associate Program(Job Number: 330306)\nDescription\nChubb is looking for individuals passionate about technology to join our Technology Associate Program (TAP). The Technology Associate Program is a two year program geared to early career professionals to help them develop expertise and technical acumen as a technologist. By joining the Technology Associate Program, you will be offered the following:\nTechnical training to enhance your skills within your chosen discipline\nBusiness acumen and professional development training specific to IT and an understanding of our broader industry\nIT Mentorship Program\nNetworking opportunities with IT and Business leaders and TAP associate peers.\nHackathons\nPosition Summary:\nThis position offers the opportunity to experience a wide variety of technology, tools and business problems as well as unique challenges in problem-solving. The focus is on applying a combination of industry standard practices and innovative ideas using data from multiple sources (structured and unstructured) and applying machine learning and statistical techniques to build models, evaluation of models and supporting implementation of models.\n\nWhat about you?\nYou are highly collaborative, creative, and intellectually curious individual who is passionate about engineering and supporting cutting-edge computing capabilities.\nYou have a strong curiosity and internal drive to resolve operational challenges and engineer solutions to decrease issues in the future.\nYou are adaptable and able to overcome technical challenges\nYou are a self-starter and motivated to learn and succeed.\nResponsibilities:\nCollaborate with business partners and peers in the organization to understand and scope the problem, gather business requirements and plan projects tasks and timelines.\nExecute all aspects of analytics initiatives including exploratory data analysis, model development, model evaluation and benefit estimation.\nResearch, recommend, and implement machine learning techniques and algorithms, such as GLM, k-NN, Naive Bayes, SVM, Random Forest, Gradient Boosting, etc\nUnderstanding of natural language processing, such as topic modelling, entity extraction, and deep learning algorithms, such as CNN, RNN, etc.\nExperience in deep learning framework such as TensorFlow, PyTorch, CNTK, etc.\nExperience using statistical programming with at least one language such as Python, R, Scala\nProficiency with machine learning libraries for Python (scikit-learn, Pandas, SciPy, NumPy, etc)\nExperience developing data visualizations using a tool such as Matplotlib, Shiny, Bokeh, etc.\nExperience in command line and scripting languages\nAbility to effectively present and explain complex concepts to a non-technical audience\n\nDesired Qualifications:\nExperience with Python\nC++, Java or Scala experience\nUse of libraries, data manipulation, and production quality code\nEnergetic, able to build and sustain long-term relationships across a multitude of stakeholders in a fast paced, multi-national work environment.\nPossess strong verbal and written communication skills and ability to present, persuade and influence peers.\nBachelor's degree required\nBonus Skills:\nExperience working in parallel, distributed systems with technologies such as Spark / PySpark, Hadoop, Databricks, etc.\n\nEEO Statement\nAt Chubb, we are committed to equal employment opportunity and compliance with all laws and regulations pertaining to it. Our policy is to provide employment, training, compensation, promotion, and other conditions or opportunities of employment, without regard to race, color, religious creed, sex, gender, gender identity, gender expression, sexual orientation, marital status, national origin, ancestry, mental and physical disability, medical condition, genetic information, military and veteran status, age, and pregnancy or any other characteristic protected by law. Performance and qualifications are the only basis upon which we hire, assign, promote, compensate, develop and retain employees. Chubb prohibits all unlawful discrimination, harassment and retaliation against any individual who reports discrimination or harassment.\nWork Locations - Jersey City Jersey City 07302\nJob - Information Technology\nTravel - No\nJob Posting - Oct 14, 2019, 3:21:02 PM"}