{"title": "DATA SCIENTIST", "company": "Walmart", "description": "Position Description\n\nAs a Data Scientist for Walmart Labs, you’ll have the opportunity to:\nDrive data-derived insights across a wide range of divisions by developing advanced statistical models, machine learning algorithms and computational algorithms based on business initiatives\nDirect the gathering of data, assessing data validity and synthesizing data into large analytics datasets to support project goals\nUtilize big data analytics and advanced data science techniques to identify trends, patterns, and discrepancies in data. Determine additional data needed to support insights\nBuild and train statistical models and machine learning algorithms for replication for future projects\nCommunicate recommendations to business partners and influencing future plans based on insights\nYour Responsibility\nPlay a key role to solve complex problems, pivotal to Walmart’s business and drive actionable insights from petabytes of data\nUtilize product mindset to build, scale and deploy holistic data science products after successful prototyping\nDemonstrate incremental solution approach with agile and flexible ability to overcome practical problems\nLead an analytic solution module, or work as part of larger team in data science projects\nPartner with senior team members to assess customer needs and define business questions\nClearly articulate and present recommendations to business partners, and influence future plans based on insights\nWork with customer centric mindset to deliver high quality business driven analytic solution\nDrive innovation in approach, method, practices, process, outcome, delivery, or any component of end-to-end problem solving\nPromote and support company policies, procedures, mission, values, and standards of ethics and integrity\nDemonstrates up-to-date expertise and applies this to the development, execution, and improvement of action plans\nDevelop analytical models to drive analytics insights\nParticipate in large data analytics project teams\nModel compliance with company policies and procedures and supports company mission, values, and standards of ethics and integrity\nParticipate in the continuous improvement of data science and analytics\nPresent data insights and recommendations to key stakeholders\nProvide and support the implementation of business solutions\nMinimum Qualifications\n\nBachelor of Science and 4 years' data science experience OR Master of Science and 1 years' data science experience.\nHigh proficiency in data mining, modeling, validation and insight generation.\nExcellent working knowledge of statistics, mathematics and machine learning algorithms.\nHigh proficiency in coding languages, including Python and SQL.\nAbility to work with large data sets. Has sound understanding of big data technology stack.\nAdditional Preferred Qualifications\n\nUnderstanding of cloud computing platforms and large-scale databases\nProven ability to collaborate and work in teams\nExcellent with communications and stakeholder engagement\nData science publications in recognized platforms/journals\nProven ability to work in agile mode on data science sprint projects\nCompany Summary\n\nThe Walmart eCommerce team is rapidly innovating to evolve and define the future state of shopping. As the world’s largest retailer, we are on a mission to help people save money and live better. With the help of some of the brightest minds in technology, merchandising, marketing, supply chain, talent and more, we are reimagining the intersection of digital and physical shopping to help achieve that mission.\nPosition Summary\n\nAs a Data Scientist for Walmart Labs, you’ll have the opportunity to:\nDrive data-derived insights across a wide range of divisions by developing advanced statistical models, machine learning algorithms and computational algorithms based on business initiatives\nDirect the gathering of data, assessing data validity and synthesizing data into large analytics datasets to support project goals\nUtilize big data analytics and advanced data science techniques to identify trends, patterns, and discrepancies in data. Determine additional data needed to support insights\nBuild and train statistical models and machine learning algorithms for replication for future projects\nCommunicate recommendations to business partners and influencing future plans based on insights\nYour Responsibility\nPlay a key role to solve complex problems, pivotal to Walmart’s business and drive actionable insights from petabytes of data\nUtilize product mindset to build, scale and deploy holistic data science products after successful prototyping\nDemonstrate incremental solution approach with agile and flexible ability to overcome practical problems\nLead an analytic solution module, or work as part of larger team in data science projects\nPartner with senior team members to assess customer needs and define business questions\nClearly articulate and present recommendations to business partners, and influence future plans based on insights\nWork with customer centric mindset to deliver high quality business driven analytic solution\nDrive innovation in approach, method, practices, process, outcome, delivery, or any component of end-to-end problem solving\nPromote and support company policies, procedures, mission, values, and standards of ethics and integrity\nDemonstrates up-to-date expertise and applies this to the development, execution, and improvement of action plans\nDevelop analytical models to drive analytics insights\nParticipate in large data analytics project teams\nModel compliance with company policies and procedures and supports company mission, values, and standards of ethics and integrity\nParticipate in the continuous improvement of data science and analytics\nPresent data insights and recommendations to key stakeholders\nProvide and support the implementation of business solutions"}