{"title": "Senior Data Scientist", "company": "NBCUniversal", "description": "The Corporate Decision Sciences team at NBCUniversal helps drive advanced analytics by building and integrating pragmatic data science principles and products throughout the Company. The Team focuses primarily on decision science analyses to support and inform strategy and key business decisions and building advanced data products to help enable more data-enhanced decision support.\n\nBe part of a team of Data Scientists that focus on the design and execution of advanced analytical data exploration, mining, inference, models, and systems utilizing multiple traditional and non-traditional media measurement data sets. The Senior Data Scientist will work closely with internal clients, Data Scientists, Data Engineers, and IT across all NBCUniversal businesses. The position reports to a Director of Data Science.\n\nResponsibilities\nDevelop and deliver high-impact tools and insights comprised of aggregated data sets and advanced algorithms with a clean user experience\nDrive the collection and manipulation of new data and the refinement of existing data sources\nManage multiple priorities across a mix of ad-hoc and operational projects\nTranslate complex problems and solutions to all levels of the organization\nQualifications/Requirements\n\n\n2+ years of experience in Data Science, advanced analytics or similar experience in academia applying statistical methods (i.e., parametric and non-parametric regression, time-series, panel data analysis, survival analysis, etc.) and machine learning techniques (i.e., methods of supervised and unsupervised learning such as clustering, regression, classification, ensemble methods, etc.) with high levels of proficiency\nAdvanced Degree (Master’s or PhD) with a specialization in Statistics, Computer Science, Data Science, Economics, Mathematics, Operations Research or other quantitative field or equivalent\n2+ years of experience with time-series forecasting methods and applications\n2+ years of experience with data visualization techniques and concepts\n1+ years of experience using relational databases and SQL\n1+ years of experience using cluster computing environments and Spark, Hive and/or Hadoop\nDesired Characteristics\n\n\nExpert knowledge of R and Python, additional languages (i.e., Julia, Java, Scala) a plus\nTeam-oriented and collaborative approach with a demonstrated aptitude and willingness to learn new methods and tools\nAdvanced knowledge of econometric methods for inference and prediction\nKnowledge and experience with Bayesian statistics and applications\nExperience with television ratings and digital measurement tools (Nielsen, Rentrak, comScore, Omniture, etc.)\nExperience with large-scale video assets\nExperience with computer vision and metadata generation from video\nSub-Business\nCorporate Decision Sciences\nCareer Level\nExperienced\nCity\nNew York\nState/Province\nNew York\nCountry\nUnited States\nAbout Us\nAt NBCUniversal, we believe in the talent of our people. It’s our passion and commitment to excellence that drives NBCU’s vast portfolio of brands to succeed. From broadcast and cable networks, news and sports platforms, to film, world-renowned theme parks and a diverse suite of digital properties, we take pride in all that we do and all that we represent. It’s what makes us uniquely NBCU. Here you can create the extraordinary. Join us.\nNotices\nNBCUniversal’s policy is to provide equal employment opportunities to all applicants and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation, marital status, pregnancy, veteran status, membership in the uniformed services, genetic information, or any other basis protected by applicable law. NBCUniversal will consider for employment qualified applicants with criminal histories in a manner consistent with relevant legal requirements, including the City of Los Angeles Fair Chance Initiative For Hiring Ordinance, where applicable."}