{"title": "Audience Data Analyst", "company": "Dow Jones", "description": "Job Description:\nThe Wall Street Journal is looking for audience data analysts to help deliver critical digital insights and visualizations of them for the newsroom. These people will present insights to senior editors and help guide strategy across content areas and multiple ongoing projects. They will also be instrumental in the creation of new dashboards and metrics for the broader newsroom that will help with audience segmentation projects.\nThe Journal has a large digital audience that is quickly growing. As we grow, we are dedicated to understanding all of our audiences and the value we provide them. The audience data analysts are part of our new Data Solutions department, which is using data science and predictive modeling to help us engage better with our audiences.\nThe Data Solutions team is part of the Journal’s Strategy unit, which is an incubator for new technologies, audience growth, community and news innovation. As a member of Data Solutions, you will work closely with writers, video journalists, graphics designers, editors, product managers, engineers, designers, data scientists, artificial intelligence experts and more in a lively, collaborative project to discover new offerings of journalistic value. You will also work closely with newsroom leadership as well as the Journal’s visual, product, design and engineering departments. There is room in these roles to develop both journalism skills and data science skills, and career paths from these jobs can lead in multiple directions.\nIt’s essential to have an enthusiasm for news and the public mission of journalism in these jobs. The Journal is the most trusted news outlet in the country, and it has made great strides in recent years in integrating audience insights into the newsroom. This new team will build on that.\nRequirements:\nThe ability to manage, organize and present data in a clear, concise and actionable format\nGreat communication skills to be able to teach editors and reporters how to use tools and think about audience data\nThe ability to turn raw data into visual insights to help support newsroom decisions.\nFlexible workflow and ability to manage multiple assignments in a dynamic environment\nCreativity and strong critical thinking skills\nTop candidates will have strengths in multiple areas of the following:\nSkills appropriate for advanced visual and data journalism, including knowledge of D3 and Illustrator; command of HTML, CSS and JS\nKnowledge of Python (preferred) or R\nExperience working in SQL\nMapping applications such as QGIS\nExperience with Linux and cloud-based services. Experience with Tableau or Looker is helpful but not required.\nKnowledge of data analytics tools, including Omniture, Google Analytics, Parse.ly or Chartbeat\nEditorial/journalism background preferred\nLI-JA1-WSJ\nDow Jones , Making Careers Newsworthy\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, protected veteran status, or disability status. EEO/AA/M/F/Disabled/Vets .\nDow Jones is committed to providing reasonable accommodation for qualified individuals with disabilities, in our job application and/or interview process. If you need assistance or accommodation in completing your application, due to a disability, please reach out to us at TalentResourceTeam@dowjones.com . Please put “Reasonable Accommodation\" in the subject line.\nBusiness Area: NEWS/WSJ\nJob Category: News/Editorial Group\nAbout Us\nThe Wall Street Journal is a global news organization that provides leading news, information, commentary and analysis. The Wall Street Journal engages readers across print, digital, mobile, social, and video. Building on its heritage as the preeminent source of global business and financial news, the Journal includes coverage of U.S. and world news, politics, arts, culture, lifestyle, sports, and health. It holds 38 Pulitzer Prizes for outstanding journalism. The Wall Street Journal is published by Dow Jones, a division of News Corp (NASDAQ: NWS, NWSA; ASX: NWS, NWSLV).\nIf you are a current employee at Dow Jones, do not apply here. Please go to the Career section on your Workday homepage and view \"Find Jobs - Dow Jones.\" Thank you.\nReq ID: 15841"}