{"title": "Business Data Scientist - AdTech", "company": "Dailymotion", "description": "Job Description\n\nAre you someone with a passion for digging into large distributed pools of data, unearthing insights, and transforming them into a visually compelling form that appeals both to technical and non-technical audiences? Then this is the job for you!\nOn a daily basis, you will be responsible for:\nPerforming data analysis on products managed by Dailymotion’s AdTech tribe, including our SSP that serves billions of requests daily, and extract actionable insights that will be used to drive decisions across the business\nStatistically validating and A/B testing hypotheses generated by Business, Product and Data Science teams.\nDriving the collection of new data that would help build the next generation of algorithms (E.g. audience segmentation, contextual targeting, bidder behavior monitoring)\nBuilding easy to use dashboards (E.g. Tableau) to help visualize insights and KPIs interactively\nAutomating analysis into monitoring and alerting tools to continuously drive value for business owners\nProactively owning the end-to-end delivery of projects, from design, to development, testing, and operations.\n\nQualifications\n\nBachelor’s degree, or higher, in Business, Finance, Statistics, or related field.\n3 years of business / data analysis experience\nPrevious ad-tech experience (required)\nExtensive experience solving analytical problems using quantitative approaches\nComfortable with manipulation and analysis of complex, high volume, high dimensional data from varying sources (E.g. SQL, AWS/GCP, Excel)\nSolid Experience of Data Visualization Tools (E.g. Tableau suite)\nStrong intellectual curiosity and ability to structure and solve difficult problems with minimal supervision\nAbility to communicate complex quantitative analysis in a clear, precise and actionable manner in English. French is a plus.\nA background in Machine Learning and Statistics is a plus\nProgramming in Python is a plus\n\nAdditional Information\n\nLocation: New York\nType of contract: Full-time\nStart Date: ASAP\nFlexible time off, vacation, holidays, sick-leave so you can take time off when you need to\nFitness club membership to NY Health & Racquet Club\n100% healthcare coverage starting on day 1\nCommuter benefits\n401k Contribution\nPaid parental leave\nFully stocked kitchens with free snacks and drinks\nIf you want to explore Dailymotion culture a little further please check out:\n1./ Our BuiltIn page: https://www.builtinnyc.com/company/dailymotion\n2./ Our Recent Global Hackathon in November 2018. https://www.dailymotion.com/video/x70val9\n3./ Welcome to the Jungle page: https://www.welcometothejungle.co/companies/dailymotion/team\nDailymotion is a global champion of diversity and inclusion. We pride ourselves in being an equal opportunity employer that provides an environment of mutual respect"}