{"title": "Senior Data Scientist", "company": "AETNA", "description": "Description:\nAre you looking for an opportunity to analyze petabytes of data in a world-class Hadoop cluster and generate insights to help consumers achieve their health ambitions, whether its running the Inca Trail Marathon or playing tackle football with their grandchildren? Aetna's Member Analytics team is focused on delivering strategically impactful programs and tools to help members across all life stages feel the joy of achieving their best health in their own way.\nThis position lies within the Attain team. Attain (http://attainbyaetna.com) is an app developed by Aetna in collaboration with Apple that leverages the sensor data from the Apple Watch and the medical claims data from Aetna in order to create personalized health recommendations for our members. Attain relies on a powerful rewards mechanism to incentivize our members to stay active and complete key healthy actions like getting a flu shot and adhering to medications.\n62871\n\nFundamental Components:\nThe Senior Data Scientist, Product Data Science will be responsible for:\nEvaluating the efficacy of Attain in terms of medical cost savings and health outcomes for our members\nEstablishing KPIs and core metrics for product evaluation\nWorking closely with Product and Marketing teams to provide insights and determine opportunities for optimization\nDetermining the optimal analytical approach to solving critical problems and informing the Product roadmap\nPresenting findings to executive leadership within both Aetna and Apple\n\nBackground Experience:\n3-5 years of experience as a data scientist in a big data environment (knowledge of Hadoop and/or Hive a plus)\nProficiency in data science techniques including machine learning, statistical modeling, experimentation, and visualization\nExpertise in SQL and Python/R (knowledge of Spark a plus)\nExcellent problem solving skills\nExcellent communication skills with the ability to work well with people from various disciplines (Product, Marketing, Finance, etc.)\n\nPotential Telework Position:\nNo\n\nPercent of Travel Required:\n0 - 10%\n\nEEO Statement:\nAetna is an Equal Opportunity, Affirmative Action Employer\n\nBenefit Eligibility:\nBenefit eligibility may vary by position. Click here to review the benefits associated with this position.\n\nCandidate Privacy Information:\nAetna takes our candidate's data privacy seriously. At no time will any Aetna recruiter or employee request any financial or personal information (Social Security Number, Credit card information for direct deposit, etc.) from you via e-mail. Any requests for information will be discussed prior and will be conducted through a secure website provided by the recruiter. Should you be asked for such information, please notify us immediately."}