{"title": "Data Scientist, Optimization", "company": "Revel", "description": "Our Mission\n\nMove people.\n\nOur Values\n\nWe are independent. Creative. Gutsy. We aren’t afraid to dream big. We are accountable. To our customers. To our cities. To each other. We are humble. Human. Lighthearted. We take our work seriously, but not ourselves.\n\nMobility is the lifeblood of urban environments and cities need affordable, emissions-free transportation options that are free of delays. We believe that shared electric mopeds will become an integral part of transit networks, filling gaps not served by bike share, car share, scooter share, or public transit.\n\nAbout the role\n\nWe’re looking for a senior team member who can quickly and easily learn their way around a variety of data structures and technology and operate independently. With access to warehouses of real-time geospatial data as well as business operations data, this role will work closely with the Engineering team and the rest of the Data Science team to propose and develop solutions to power key aspects of our applications. You will report to the Director, Data Science and Analytics.\nTechnical Requirements\n5-7 years experience working as a data scientist, some of which spent in transportation-related endeavors\nBackground in areas such as Industrial Engineering, Operations Research, Logistics is a plus\nAn applied understanding of machine learning and optimization methods, including geospatial techniques for route optimization\nExperience working with large data sets and building scalable, production-ready models with near real-time response times\nStrong knowledge of Python, SQL (particularly Postgres and PostGIS), and R\nFamiliarity with AWS services such as Kinesis, S3, EC2, RDS, and Redshift\nAbility to quickly understand new technologies and data environments\nNon-technical Requirements\nStrong written and verbal communication skills\nAbility to summarize key findings into clear and actionable recommendations, and to interact with individuals at all levels\nStrong project management skills and ability to plan and prioritize work in a fast-paced environment\nSense of urgency and an ability to multitask\nSome management experience preferred\nTeam player and willing to pick up extra responsibilities as required\nYou are enthusiastic, reliable, and hardworking\nResponsibilities\nDevelop a thorough understanding of the business, from the user perspective and multiple operations perspectives\nBuild a complete knowledge of relevant internal and external data repositories\nOwn optimization initiatives such as: 1) Build optimal routes for battery swappers and mechanics considering a variety of dynamic factors and 2) allocate tasks to operators taking into account the varying cost/benefit to the entire system\nPartner with the engineering team to implement models in a scalable, real-time, production environment, functioning across multiple locations"}