{"title": "Machine Learning Engineer", "company": "Dow Jones", "description": "Job Description:\nThe Wall Street Journal seeks a Machine Learning Engineer to turn models into data tools for the newsroom. The engineer will be part of the R&D team in the Media Sciences Lab and will work collaboratively across the organization to help deploy machine learning and AI best practices.\nThis is an opportunity to work in a vibrant newsroom and leverage emerging data science techniques to conduct analyses and build tools that promote deeper understanding and differentiation of our journalism. The Media Sciences Lab is part of the Journal’s Strategy area, which is an incubator for new technologies, audience growth, community and news innovation. The department includes the full range of journalistic talent that makes the Journal one of the leading news organizations in the world - writers, video journalists, graphics designers, editors, product managers, engineers, designers, data scientists, artificial intelligence experts and more - in a lively, collaborative project to discover new offerings of journalistic value.\nScope:\nReframe journalistic questions into machine learning tasks. Turn models into data products, collaborate with data scientists and journalists to integrate into process throughout The Wall Street Journal.\nHelp identify emerging fields of research in deep learning and natural language processing that can have direct impact in journalism.\nWork with data scientists to identify technical solutions for scaling newsroom projects that can deliver actionable insights and reliable predictions.\nPartner with stakeholders from around the organization to implement and disseminate machine learning best practices, while establishing methodological transparency.\nCommunicate results and impact to newsroom editors and the rest of the organization.\nWork closely with Product, Design and Engineering teams to integrate solutions and partner with groups across the Strategy team including Growth & Membership and Data Solutions.\nQualifications:\nExtensive technical experience playing a bridging role between journalists, designers, data scientists and engineers.\nExperience with open source machine learning and statistical analysis tools. Knowledge of experimental design is a plus.\nExperience in Python, Java, Spark and BigQuery\nExperience building and deploying a machine learning system into production.\nAbility to communicate complex ideas in machine learning to relevant stakeholders in the newsroom.\nData engineering experience, including SQL and manipulating large structured or unstructured datasets for analysis.\nPassionate about working with large unstructured and structured data sets, including news archives and metrics.\nLI-JA1-WSJ\nDow Jones , Making Careers Newsworthy\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, protected veteran status, or disability status. EEO/AA/M/F/Disabled/Vets .\nDow Jones is committed to providing reasonable accommodation for qualified individuals with disabilities, in our job application and/or interview process. If you need assistance or accommodation in completing your application, due to a disability, please reach out to us at TalentResourceTeam@dowjones.com . Please put “Reasonable Accommodation\" in the subject line.\nBusiness Area: NEWS/WSJ\nJob Category: IT Development Group\nAbout Us\nThe Wall Street Journal is a global news organization that provides leading news, information, commentary and analysis. The Wall Street Journal engages readers across print, digital, mobile, social, and video. Building on its heritage as the preeminent source of global business and financial news, the Journal includes coverage of U.S. and world news, politics, arts, culture, lifestyle, sports, and health. It holds 38 Pulitzer Prizes for outstanding journalism. The Wall Street Journal is published by Dow Jones, a division of News Corp (NASDAQ: NWS, NWSA; ASX: NWS, NWSLV).\nIf you are a current employee at Dow Jones, do not apply here. Please go to the Career section on your Workday homepage and view \"Find Jobs - Dow Jones.\" Thank you.\nReq ID: 15875"}