{"title": "Data Scientist Associate, Landau Lab", "company": "New York Genome Center", "description": "About the New York Genome Center\nThe New York Genome Center (NYGC) is an independent, non-profit organization that leverages the collaborative resources of leading academic medical centers, research universities, and commercial organizations. Our vision is to transform medical research and clinical care in New York and beyond through the creation of one of the largest genomics facilities in North America, integrating sequencing, bioinformatics, and data management, as well as performing cutting-edge genomics research.\nThe New York Genome Center is a VEVRAA Federal Contractor. All qualified applicants will receive consideration for employment and will not be discriminated against on the basis of race, color, religion, sex, sexual orientation, national origin, age, disability, or protected veteran status. The New York Genome Center takes affirmative action in support of its policy to hire and advance in employment individuals who are minorities, women, protected veterans, and individuals with disabilities.\n\nPosition Description\nThe Landau Lab at the New York Genome Center is looking for a highly motivated, detail-oriented individual to join our efforts to study the basic principles of cancer evolution. As Data Scientist Associate, you will be responsible for the analysis and interpretation of next-generation sequencing (NGS) data, originating from patient samples as well as experimental modeling of cancer evolution. Specifically, the lab is focused on deep learning applications to liquid biopsy and single-cell analytics.\nJob Duties:\nAnalyze sequencing data using established pipelines;\nDevelop and benchmark new tools for sequencing data analysis applying machine learning to cancer discovery;\nAssist and collaborate with internal and external researchers in interpretation of sequencing data.\n\n\nRequired Skills\nMS degree in bioinformatics, computer science or equivalent exposure;\nDemonstrated exposure to NGS data analysis;\nProgramming skills in R, Python, Perl, BASH, TensorFlow or similar;\nTraining in statistics or machine learning;\nTeam oriented with excellent written and verbal communication skills.\n\n\nRequired Experience"}