{"title": "Data Scientist - IT Transformation", "company": "NewYork-Presbyterian Hospital", "description": "Location\nNew York, New York\nShift:\nDay (United States of America)\nDescription:\nJoin the Artificial Intelligence team at New York’s #1-ranked hospital.\nData Scientist - IT Transformation\nAt New York-Presbyterian, we’re leveraging the most innovative and transformative technologies to provide the highest quality care to our patients. This is your opportunity to provide world class technology solutions that will directly impact the quality of a patient’s life. Thrive in our fast-paced environment, as you lead enterprise-wide implementation of AI. Join and collaborate with a tight-knit team of creative and ambitious data analysts, engineers, and developers, working on the most important enterprise initiatives in our healthcare system. Ultimately you will be a critical part of building the hospital of the future, as we integrate A.I. into all aspects of healthcare delivery and make a huge positive impact on patient lives.\nOur Artificial Intelligence team is seeking an innovative, results-oriented data scientist to support, enhance, and expand NewYork-Presbyterian’s artificial intelligence program in redefining our healthcare delivery operations. Our mission is to enhance healthcare delivery through integration of machine learning, extracting knowledge from millions of data points from the electronic medical record and clinical documents to generate actionable insights for our clinical, operational, and enterprise teams. As a critical member of our A.I. deployment team, you will oversee machine learning algorithm generation and be responsible for establishing and maintaining a quality pipeline of models. Working with senior executives and clinical leadership, you will have a prominent voice in shaping strategic decisions and process redesign across the enterprise.\nPreferred Criteria\nMasters in Computer Science, Bioinformatics, Physics, Mathematics, or other data science related field\nExperience in neural network models in Keras and/or Tensorflow / Theano\nExperience in MLaaS (AWS, Azure, GCP)\nPrevious related experience in machine learning techniques and best practices\nPython experience and related ML packages (scikit-learn, numpy, etc.)\nProficiency in data analytics and engineering, able to clean, transform, and merge data for ML purposes\nRequired Criteria\nBachelor's degree or equivalent experience\nThree to five years of previous work related experience\nJoin a hospital where employee engagement is at an all-time high. Enjoy competitive compensation along with benefits such as tuition reimbursement, hospital retirement contributions, and financial planning assistance. Start your life-changing journey today.\n__________________\n#1 in New York, \"America's Best Hospitals 2019-2020.\" - U.S.News & World Report\n2019 \"Best Places to Work: Employee's Choice.\" - Glassdoor\n2019 \"Employees' Choice: Top CEOs\" - Glassdoor\n2019 \"America's Best Employers in New York State\" - Forbes\n2019 \"150 Top Places to Work in Healthcare.\" - Becker's Healthcare\n2018 \"Top-Rated Work Places: Best Hospitals\" - Indeed\n\nDiscover why we're #1 in New York and a best employer at: nyp.org/careers\nNewYork-Presbyterian Hospital is an equal opportunity employer."}