{"title": "Content, Data Scientist", "company": "ION Media Networks", "description": "Overview\nThis role will be a key member of the ION Analytics team. You will work with senior/executive management, inspire new thoughts, and develop algorithms to solve interesting problems that have a significant influence on the organization. You will create actionable analytics and solutions that will solve challenging business problems in various departments. You will contribute to the long term analytics strategies and competencies needed to support ION across the various business units. Your experience, knowledge, translation of data and use of analytics will shape strategic plan and business growth.\nAs a member of the Analytics team at ION - which drives analytics, big data and decision science for all business functions across ION - you and your team will also promote synergies across the solutions and models we develop for other parts of ION. This role offers excellent opportunity for an innovative and driven individual who is enthusiastic about using data and analytics to drive significant results in an environment that rewards performance.\nResponsibilities\nDesign and implement quantitative analyses and predictive modeling that result in actionable solutions.\nCreate tools to empower operational and exploratory analysis and automate reporting and processes.\nMaintain and extend an internal data warehouse with large datasets from various sources.\nApply your proficiency in quantitative analysis, data mining, and visualization to see beyond the data in identifying and quantifying high-impact opportunities.\nEffective communication with non-technical team members, from creating ideas and scoping requirements to explaining methodology and results.\nDevelop a complete understanding of IONs business, processes, data & systems.\nSupport a data-driven culture, educating the organization on everyday use of data as a resource.\nQualifications\nAdvanced degree (MS or PhD) in Computer Science, Operations Research, Engineering, Statistics, Econometics or a related quantitative field.\nStrong programming skills with Python, R and familiar with Java (or a similar language).\n2-6 years professional experience in solving challenging business problems using computational techniques.\nKnowledge of relational database (Microsoft SQL is preferred) and Extract, Transform, Load (ETL) processes.\nKnowledge of common software development and ability to develop small app independently."}