{"title": "Data Scientist – Personalization", "company": "Spotify", "description": "We are seeking a Data Scientist to join our Product Insights team, focusing on Personalization. We have several roles open across different levels of seniority.\nThe Personalization team makes deciding what to play next on Spotify easier and more enjoyable for every listener. We seek to understand the world of music and podcasts better than anyone else so that we can make great recommendations to every individual person and keep the world listening.\nEveryday, hundreds of millions of people all over the world use the products we build which include destinations like “Home” and “Search” as well as original playlists such as “Discover Weekly” and “Daily Mix.” We’re a team of technologists, product insight experts, designers, and product managers in Boston, New York, Stockholm, and London.\nYou will be solving complex data problems and delivering the insight that helps to define our understanding of music, audio and our listeners to develop how we personalize at Spotify. This role works closely with a multidisciplinary team of data scientist, user researchers, data engineers, product teams and designers.\nYour work will impact the way the world experiences music and audio!\nWhat you’ll do:\nDevelop research questions and undertake data exploration to understand who our listeners are, how they get value out of Spotify, and where we can develop our product to bring greater value\nWork closely with the team including data engineering to build lasting solutions to our data modeling\nDesign, analyze, and interpret the results of experiments\nPerform exploratory analyses to understand the performance of our machine learning systems\nDefine, evaluate, dashboard and monitor key metrics, understanding root causes of changes\nContribute to the development of the Product Insights function and the wider analytics community at Spotify\nMentor and coach other data scientists\nWork from our office in New York\nWho you are:\nYou will have 2 to 5 years relevant applied experience with a degree or higher in economics, psychology, computer science, statistics, or mathematics or another quantitative discipline\nTechnical competence to perform advanced analytics:\nCoding skills (such as R, Python, or Scala)\nExperience with analytics & visualization tools (SQL, Tableau, ggplot/matplotlib or equivalent)\nExperience performing analysis with large datasets\nYou have strong statistical understanding of online testing methodologies and metric development\nYou are an independent thinker, able to work autonomously, capable of taking on loosely defined problems and translating complex thinking into practical application for diverse audiences\nYou are a communicative person who values building strong relationships with colleagues and partners and enjoys mentoring and teaching others"}