{"title": "Data Scientist, Content Analytics", "company": "Spotify", "description": "We are looking for an experienced Data Scientist to join our Content Analytics team.\nBased in New York, you will contribute to developing impactful predictive models to estimate content consumption trends on the Spotify platform, ultimately informing billions of dollars of content spend. The output of your models will be core to our understanding of the lifetime value of content and will serve as the foundation of several strategic initiatives. Above all, you will be at the nexus of data science and business at one of the most innovative companies in the world.\nIn addition to possessing a strong technical background, you will be a natural communicator who is equally comfortable explaining complex statistical frameworks to both business and engineering teams. You will also have a strong preference for forecasting, time series, and asset valuation experience. Accompanying this broad set of responsibilities is exposure to many functional areas, as well as senior management, across Spotify.\nWhat you’ll do:\nContribute to scalable solutions for forecasting content consumption, working closely with a team of peers across data engineering, data science, finance, and economics to interpret and report on model outputs.\nHelp identify the most impactful content consumption models and contribute to transitioning them to internal self-serve data products.\nPrototype novel frameworks for anomaly detection in content consumption and contribute towards deploying them into internal production environments.\nSupport leadership with research on key business initiatives and challenges.\nWhat you bring:\nDegree in Computer Science/Engineering, Mathematics, Statistics, Economics, or another quantitative field.\nAbility to communicate complex topics using plain (non-technical) language.\n2+ years (Data Scientist; ML Eng) of relevant experience analyzing and summarizing complex data via modern SQL dialects, with model development experience using a ML package supported in Python.\nExperience with iterative prototyping, scaling, and deployment across a range of machine learning model types.\nExperience with large time series datasets, alongside successfully navigating data workflows with complex DAG style data processing requirements.\nDemonstrable experience of any of the following is a plus: Google BigQuery Standard SQL, Scio/Beam/Dataflow, time series best practices, or general knowledge of distributed computing principles.\nComfort with navigating complex and fluid organizational structures within a dynamic and global company. To be successful, you will need to build and maintain cross-functional relationships spanning multiple teams and geographies."}