{"title": "2020 PhD Data Scientist Internship - Uber Eats (New York)", "company": "Uber", "description": "At Uber, we ignite opportunity by setting the world in motion. We take on big problems to help drivers, riders, delivery partners, and eaters get moving in more than 600 cities around the world.\n\nWe welcome people from all backgrounds who seek the opportunity to help build a future where everyone and everything can move independently. If you have the curiosity, passion, and collaborative spirit, work with us, and let’s move the world forward, together.\nAbout the Role\n\nAre you interested in working at the intersection of applied quantitative research, engineering development, and data science? Do you have interest in applying quantitative solutions to the uniquely challenging problems related to Uber’s on-demand delivery marketplace? If so, then this is the opportunity for you.\nWhat You’ll Do\nDevelop models for user behavior and marketplace dynamics\nDesign optimization algorithms to improve marketplace efficiency\nApply machine learning for recommendation, prediction, and forecasting\nConduct experiments to inform product decisions\nWhat You’ll Need\nStrong quantitative background\nResearch, data science modeling, or engineering experience\nFamiliarity with technical tools for analysis - Python (with Pandas, etc.), R, SQL, etc.\nResearch mindset with bias towards action - able to structure a project from idea to experimentation to prototype to implementation\nIndependence, great communication, and amazing follow-through - you aggressively tackle your work and love the responsibility of being individually empowered\nBonus Points For\nBackground in Machine Learning, Statistics, Operations Research, Operations Management, Econometrics, or similar\nExperience in software engineering\nAbout the Team\n\nUber Everything Data Scientists help solve the most challenging problems related to Uber's ambitious and rapidly expanding on-demand delivery businesses, such as Uber Eats. These fascinating and challenging problems include: demand prediction, menu ranking and recommendation, delivery time estimation, batching, scheduling, routing, dynamic pricing, supply positioning, and much more.\n\nBelow is a list of sub domains in our NYC location:\nRestaurant (NYC) | The restaurant team aims to increase restaurant selection on Uber Eats while setting up restaurant partners for success. We leverage statistics and machine learning techniques to optimize the experience of restaurants at different life cycles. From onboarding, to menu creation, marketing, and order experience, we empower them with tools to increase demand and maintain a frictionless interaction with the platform.\nMarketplace - Logistics and Marketplace Intelligence (NYC) | From dispatch and routing optimization to predicting food delivery time, the Logistics and & MI team provides DS solutions to create the best customer experience on all sides of the Eats marketplace in the most efficient way. The team also provides marketplace management solutions using state of the art machine learning techniques and our dispatch simulator."}