{"title": "Senior Data Scientist", "company": "PepsiCo", "description": "PepsiCo operates in an environment undergoing immense and rapid change, driven by eCommerce and emergent retail technologies. To ensure continued success in the food and beverage space, PepsiCo has assembled a dedicated eCommerce team – tasked with optimizing eCommerce operations and developing innovations that will give PepsiCo a sustainable competitive advantage. While tied closely to broader PepsiCo, the eCommerce group more closely resembles a start-up environment; embracing the core values of having bias for action, being results oriented, maintaining a community-focus, and prioritizing people.\nPepsiCo’s Data Science and Analytics group is a team of data scientists, technology specialists, and business innovators who operate within eCommerce to build industry-leading systems and solutions. By focusing on machine learning and automation, the Data Science & Analytics group is pushing the bounds of possibility for PepsiCo and its strategic partners.\nWhat PepsiCo Data Science & Analytics does:\nBuild machine learning systems to understand the cross-channel grocery ecosystem\nPerform statistical analysis across diverse datasets to drive and measure performance\nWork with PepsiCo’s strategic partners to expand their technical capabilities, thereby creating a more robust data environment\nUtilize natural language understanding techniques to uncover insights from contextual data\nDevelop scalable tools to drive automation and optimize business operations\nAs a Senior Data Scientist, you will play a critical role in executing the global ecommerce growth agenda. You will be tasked with identifying, designing, and implementing data science/machine learning solutions to business problems. You will collaborate with the larger data science and analytics teams to create a robust, shared codebase; on which PepsiCo will build automated eCommerce systems. You will work with internal business stakeholders and strategic partners to identify opportunities for collaborative development and foster a data-driven culture between relevant teams.\n\nResponsibilities:\nWork with the larger data science team to analyze large data sets and develop custom models/algorithms to uncover trends, patterns and insights\nWrite clean, organized machine learning code using standard software engineering methodologies\nProvide critical thought leadership to enhance organizational capabilities by utilizing big and small data; work with DSA team members to identify and execute on opportunities for enhancement\nQualifications/Requirements\nMaster’s Degree in Data Science or equivalent\nDevelopment experience in Python, Java, C or equivalent programming language\nExperience and or familiarity NumPy, Pandas, Pytorch, PostgresSQL, MSSQL, MySQL\nExperience using Tensorflow to design custom deep learning systems\nExpert in mathematical models underlying data science methods, understanding the trade-offs between different solutions\nExperience in designing systems to solve business problems\nDemonstrated ability to effectively and concisely communicate with both business and technical audiences\nRelocation Eligible: Not Applicable\nJob Type: Regular\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status.\n\nPepsiCo is an Equal Opportunity Employer: Female / Minority / Disability / Protected Veteran / Sexual Orientation / Gender Identity\n\nOur Company will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the Fair Credit Reporting Act, and all other applicable laws, including but not limited to, San Francisco Police Code Sections 4901 - 4919, commonly referred to as the San Francisco Fair Chance Ordinance; and Chapter XVII, Article 9 of the Los Angeles Municipal Code, commonly referred to as the Fair Chance Initiative for Hiring Ordinance.\n\nIf you'd like more information about your EEO rights as an applicant under the law, please download the available EEO is the Law & EEO is the Law Supplement documents. View PepsiCo EEO Policy\n\nPlease view our Pay Transparency Statement"}