{"title": "Data Scientist - Strategic Data Science", "company": "Two Sigma Investments, LLC.", "description": "Two Sigma is a different kind of investment manager. Since 2001, we have used data science and technology to derive insights to forecast the future and discover value in markets worldwide. Our team of scientists, technologists and academics looks beyond traditional finance to understand the bigger picture and to develop creative solutions to some of the world’s most difficult economic problems. Our work spans markets and industries, from insurance and securities to private investments and new ventures.\n\nThe Strategic Data Science team’s mission is to unlock new high-potential revenue streams by harnessing Two Sigma’s data, technology and modeling capability into a scalable and portable prediction engine and monetizing this engine into new investment products or non-investment business lines.\nIn particular, the Strategic Data Science team is working on building a systematic and data-driven private investment focused modeling environment, with application to investment products across the Two Sigma businesses. The team’s ambition is to leverage Two Sigma’s accumulated know-how, proprietary data-science platform and scientific investment approach in highly fragmented, illiquid and unstructured markets. By leveraging these tools, we can develop a meaningfully differentiating investment process in an industry dominated by institutions relying on local knowledge, personal networks and incomplete information.\nThe Strategic Data Science team is seeking a data scientist to join our growing team and contribute to building the initial data and modeling platform used to guide our team’s investment process and asset selection. With statistics, economics, and computation at the heart of all our work, we will be most successful when data science is used to empower our team to make data-driven, evidence-based investment decisions that scale quickly. Our mission is to give our team a significant competitive edge in this alpha-phase of the initiative, while also building a platform that scales and provides an enduring advantage: the world’s first data-driven private asset prediction engine.\nYou will take on the following responsibilities:\n\nIndependently generate and articulate hypotheses on what may affect private markets, asset valuations, and private deal processes\nLeverage existing data sets, as well as identify and trial new data sets, in order to interrogate yours — and the team’s — hypotheses\nPresent your work internally to the working teams, other modeling teams, members of Two Sigma’s leadership team and various Two Sigma businesses\nSpend time with private market partners to better understand how it works, how software is used, and what data is critical to industry practitioners daily workflows\nDevelop a deep understanding of private markets\nYou should possess the following qualifications:\n\nStrong independent development of predictive models in common open-source statistical programming languages\nExperience working with high-dimensional and sparse datasets, as well as recognition of when and how to combine such datasets to enhance their value\nFamiliarity with time-series and spatial analysis methods and software, particularly mapping tools\nDesire to work in a dynamic and evolving research and development environment, where you may be working on several parallel research tracks and will be expected to switch context frequently\nStrong communication skills, with an emphasis on the ability to understand your audience and flexibility to communicate complex topics to non-experts\nTwo Sigma employees enjoy the following benefits:\n\nCore Benefits: Fully paid medical and dental insurance premiums for employees and dependents, competitive 401k match, employer-paid life & disability insurance\nPerks: Onsite gyms with laundry service, wellness activities, casual dress, snacks, game rooms\nLearning: Tuition reimbursement, conference and training sponsorship\nTime Off: Generous vacation and unlimited sick days, competitive paid caregiver leaves\nWe are proud to be an equal opportunity workplace. We do not discriminate based upon race, religion, color, national origin, sex, sexual orientation, gender identity/expression, age, status as a protected veteran, status as an individual with a disability, or any other applicable legally protected characteristics"}