{"title": "Data Scientist - Experimentation", "company": "Disney Streaming Services", "description": "Disney Streaming Services (DSS) is creating the future of digital video entertainment products for one of the largest media brands in the world. We’re focused on delivering extraordinary experiences and distributing the incredible library of Disney content through all forms of interactive media. Our digital technology leadership and capabilities are married with a passion for crafting dynamic consumer-facing applications that integrate live and on-demand multimedia. We create great digital media products for millions of fans around the globe, and we're looking for strong performers who can help us improve what we do every day. This is an opportunity to impact experiences that will be used by millions of users worldwide.\n\nThe Data Scientist, Experimentation is a critical position within DSS and in the Data organization to apply advanced statistical methods to design and analyze A/B experimentations for product and algorithm/model changes. We make product and business decisions based on what we learned from A/B testing. Therefore, it is essential to ask the right questions and measure the right things to answer them.\n\nResponsibilities :\nDevelop sampling and allocation methodology for experimentations.\nDesign and analyze A/B experimentations for product and algorithm/model changes.\nCreate actionable metrics and design effective experiments.\nExplain experimentation results to both non-technical and technical stakeholders.\nCollaborate with engineering teams to improve the experimentation pipeline and platform.\nProcess, cleanse, and verify the integrity of data used for analysis.\n\nBasic Qualifications :\nAt least 2 years of relevant industry experience.\nDemonstrated ability to design, analyze and present A/B experimentation results and recommendations to business and technical clients.\nStrong statistics knowledge and experience to strengthen the validity of A/B tests, including statistical distributions and testing/sampling methodologies.\nExpertise in programming languages for data processing and analysis (e.g., Python and R) and big data access tools.\nExtensive background in statistical methods and data mining\nExcellent communication and presentation skills.\nGraduate degree in Statistics, Mathematics, Economics, Computer Science preferred, or equivalent professional experience."}