{"title": "Data Scientist - Bomoda", "company": "Weber Shandwick", "description": "Data Scientist - Bomoda(Job Number: 008631)\nPrimary Location-United States-New York-New York\nDescription\nBomoda is looking for a Data Scientist to join our team in New York!\n\nWe Are Seeking:\n\nAs a data scientist at Bomoda, you would be directly involved with the product team including computer scientists and data analysts, eliciting information from multiple data platforms and using that data to identify relevant and actionable trends and/or concepts. The product goal is to understand consumer behavior to better detect market conditions as well as the general perception of brands\n\nWhat You Will Be Doing...\nHelp define and scope work required to build and maintain ML systems and models\nEnsure the quality and robustness of such models\nOversee any and all data science platform changes and feature development\nWork with other technology and business stakeholders to identify areas where data science features are required\nWork with other technology stakeholders to identify and implement best practices for data management\nWork with integration teams to scope out new data sets for training as well as oversight of integration development within the data science team.\nResearch approaches in data science that address problems outlined by the data science lead\nWork with other technology stakeholders to implement best practices for data management\n\nWhat We Are Looking For...\n2-5 years data science experience in Python, Apache Spark, Tensorflow, Scikit-learn, pandas.\nNatural language processing techniques\nMachine-learning techniques\nKnowledge of Big Data Architectures and AWS environment (Hadoop/Hive, Bigquery, S3, EC2, EMR, etc.)\nStrong programming experience\nExperience with SQL and/or NoSQL\nMasters or PHD is a plus. Multilingual fluency / literacy is a plus\n\nBomoda is proud to be an Equal Opportunity/Affirmative Action employer. Weber Shandwick recruits qualified applicants without regard to race, color, religion, gender, age, ethnic or national origin, protected veteran status, physical or mental disability, sexual orientation, gender identity, marital status or citizenship status."}