{"title": "Data Analyst", "company": "Revel", "description": "Our Mission\n\nMove people.\n\nOur Values\n\nWe are independent. Creative. Gutsy. We aren’t afraid to dream big. We are accountable. To our customers. To our cities. To each other. We are humble. Human. Lighthearted. We take our work seriously, but not ourselves.\n\nMobility is the lifeblood of urban environments and cities need affordable, emissions-free transportation options that are free of delays. We believe that shared electric mopeds will become an integral part of transit networks, filling gaps not served by bike share, car share, scooter share, or public transit.\n\nAbout the role\n\nWe’re looking for a data scientist who can quickly and easily learn their way around a variety of data structures and technology. With access to warehouses of real-time geospatial data as well as business operations data, this role will work with the rest of the Data Science team to develop both predictive and descriptive reporting, visualize data, and automate associated processes. You will report to the Senior Analyst, Data Science and Analytics.\nTechnical Requirements\n2-3 years experience working as a data scientist/data analyst\nAn applied understanding of machine learning and other modeling techniques\nExperience working with large data sets - geospatial data is a plus\nStrong knowledge of R, Python and SQL, particularly Postgres and PostGIS\nExperience with data visualization toolsFamiliarity with AWS services such as Kinesis, S3, EC2, RDS, and Redshift\nAbility to quickly understand new technologies and data environments\nExperience with a Unix-based operating system\nNon-Technical Requirements\nStrong written and verbal communication skills\nAbility to summarize key findings into clear and actionable recommendations, and to interact with individuals at all levels\nStrong project management skills and ability to plan and prioritize work in a fast-paced environment\nSense of urgency and an ability to multitask\nTeam player and willing to pick up extra responsibilities as required\nYou are enthusiastic, reliable, and hardworking\nYou take your work seriously but not yourself\nResponsibilties\nUnderstand business needs across multiple tiers (for example, executive, operations and logistics, business strategy, customer acquisition and retention)\nBuild deep knowledge of relevant internal and external data repositories\nTranslate data into meaningful and insightful information for business users via appropriate tools\nWork collaboratively with operations, customer success, marketing, product, finance, and other departments to help answer questions and define KPIs\nPrioritize and respond to ad hoc requests for information from the business and productionalize as necessary\nBuild and automate visualizations and reporting"}