{"title": "Data Science Full-Time Student Opportunity (Undergraduate)", "company": "CVS Health", "description": "Data Science Full-Time Student Opportunity (Undergraduate)\n\nAetna, a CVS Health company, is the nation's premier health innovation company helping people on their path to better health. We are building a new health care model that is easier to use, less expensive, and puts the consumer at the center of their care.\n\nWho we are:\nAetna’s Analytics & Behavior Change team supports the entire organization by embedding deep analytic insights into key decision processes and focusing on our biggest, most complex problems. We use advanced analytics tools, modeling and machine learning to generate insights by leveraging data within a cutting-edge petabyte-scale Hadoop environment. We’re focused on creating new opportunities that drive change in areas such as member behavior change, digital health, provider efficiency, clinical products/programs, and health care fraud detection and prevention.\nOur goal is to make health care simpler, more affordable, and convenient. We are inspired to make a difference by connecting people to the information they need and helping our members feel the joy of achieving their best health in their own way. Our opportunities in Data Science and Data Engineering are designed to enhance your personal and professional growth and build the skills that will lead you to success. Aetna Analytics has the feel of a fresh startup within a 165 year old company, and we’re looking for people who like solving tough challenges and are motivated by a desire to drive change.\n\nWhat you will do:\nCollaborate with Analytics teams and business partners to understand their goals and objectives\nUse programming skills to explore, analyze and interpret large volumes structured and unstructured data\nUtilize predictive modeling and statistical analysis to determine analytical approaches and evaluate scenarios as well as potential future outcomes\nGenerate insights connecting analytical results with business problems or objectives\nPresent and provide recommendations to internal teams and stakeholders\nSupport the design of programs/campaigns that will improve the quality of health care, lower costs, and help our members achieve their best health\n\nRequired Qualifications\nExperience with data science techniques including mathematical and statistical analyses, modeling and data visualization\nKnowledge of R or Python and SQL\n\nPreferred Qualifications\nAbility to communicate technical concepts and implications to peers, managers, and business partners\nExcellent problem solving and critical thinking abilities\nStrong collaboration and communication skills within and across teams\nA passion to help transform health care\n\nEducation\nCurrently pursuing a Bachelor’s degree with an anticipated graduation date between December 2019 and August 2020\nPreferred/relevant majors include Statistics/Biostatistics, Mathematics, Computer Science, Data Science/Health Data Science, Engineering\n3.3+ cumulative GPA\n\nBusiness Overview\nIt’s a new day in health care.\n\nCombining CVS Health and Aetna was a transformative moment for our company and our industry, establishing CVS Health as the nation’s premier health innovation company. Through our health services, insurance plans and community pharmacists, we’re pioneering a bold new approach to total health. As a CVS Health colleague, you’ll be at the center of it all.\n\nWe offer a diverse work experience that empowers colleagues for career success. In addition to skill and experience, we also seek to attract and retain colleagues whose beliefs and behaviors are in alignment with our core values of collaboration, innovation, caring, integrity and accountability.\n\nCVS Health is an equal opportunity/affirmative action employer. Gender/Ethnicity/Disability/Protected Veteran – we highly value and are committed to all forms of diversity in the workplace. We proudly support and encourage people with military experience (active, veterans, reservists and National Guard) as well as military spouses to apply for CVS Health job opportunities. We comply with the laws and regulations set forth in the following EEO is the Law Poster: EEO IS THE LAW and EEO IS THE LAW SUPPLEMENT. We provide reasonable accommodations to qualified individuals with disabilities. If you require assistance to apply for this job, please contact our Advice and Counsel Reasonable Accommodations team. Please note that we only accept applications for employment via this site.\n\nIf technical issues are preventing you from applying to a position, contact Kenexa Helpdesk at 1-855-338-5609 or cvshealthsupport@us.ibm.com. For technical issues with the Virtual Job Tryout assessment, contact the Shaker Help Desk at 1-877-987-5352."}