{"title": "Senior Data Scientist, Machine Learning", "company": "Cityblock Health", "description": "Who we are:\nCityblock Health is a new type of healthcare company ( https://www.cityblock.com/ ), operating out of Brooklyn and backed by Alphabet's Sidewalk Labs, along with some of the top healthcare and tech investors in the country.\n\nOur mission is to radically improve the health of urban communities, one block at a time. Importantly, our solutions are designed specifically for Medicaid and lower-income Medicare beneficiaries, and we bring the capability to deliver care in the home and neighborhood with our field-based teams.\n\nIn close collaboration with community-based organizations and leading commercial partners, we are reorganizing the health system to focus on what matters to our members. We deliver personalized primary care, behavioral health, and social services through a network of neighborhood hubs with deep community-based partnerships and world-class technology.\n\nWe partner with payers and at-risk providers, accepting capitated financial risk to care for their most vulnerable, high and rising risk members. Additionally, we invest in strategic partnerships with community-based and social services organizations, in some instances bringing them into the value equation through sub-capitation and performance-based compensation.\n\nOver the next year we'll grow quickly, including entering new markets, each with their own commercial relationships and field-based teams. This role will be a key contributor to the success of our business.\n\nThe role:\nWe are looking for a Data Scientist, Machine Learning Engineer, or Research Engineer to join the Cityblock Prototype Engineering team. You will work with stakeholders across the organization to identify and prototype opportunities to use predictive modeling and machine intelligence on Cityblock data—as well as data from partners and other sources—in search of innovative, scalable solutions that address key business, operational, clinical, and product use cases.\n\nYour work may inform decisions across our Growth, Market Operations, and Clinical teams or you might develop data-powered solutions for Commons, our digital care management platform. Commons enables our clinical teams to engage with patients, collect data about medical, behavioral and social needs, and develop personalized care plans that drive good health. Your solutions may be deployed as part of product features in Commons or help guide product development for machine intelligence-driven scale.\n\nWe are looking for a curiosity-driven and solution-oriented team player with a keen interest in people to develop solutions to problems that matter. You are eager to take on the entire model development workflow. You get and prepare data, you build and deploy models. You assess the performance of your solutions and you work with users and stakeholders to ensure that your solutions meet business and product objectives.\n\nWe value experimentation and a question-oriented and hypothesis-driven approach to data. We look for an ability to make pragmatic decisions about trade offs in a fast-paced environment (e.g., development speed vs. code quality). We believe that clear communication is key to success, you will contribute to evangelizing the meaningful use of data science and machine learning across the organization.\n\nIf you're inspired by such a challenge and are an amazing teammate, we'd love to hear from you!\n\nYou will:\nDevelop data science and machine learning solutions and prototypes. We use SQL, python and R, but we are open to whatever tool is most appropriate for a task\nBe ready to guide or own the model development workflow from data ingestion and preparation to model development and deployment to quality assurance\nWork cross functionally and take part in user research to understand business, operational, clinical, and product needs as well as end user concerns\nHelp identify meaningful opportunities for data science and machine learning that address key business, operational, clinical, and product use cases to make a real contribution to Cityblock\nHelp guide data-informed tactical and strategic decision making across the organization\nHelp guide the development of Commons from a data perspective including Mixer, our data pipeline\nLearn continuously via mentorship and on your own in search of the right solution to the problem at hand, no one knows everything\nBecome deeply familiar with medical data (e.g., medical claims data)\nDevelop productive relationships across the organization and evangelize the meaningful use of data science and machine learning across the organization\nYou'd be a good fit if:\nYou have a PhD in a technical or scientific field and at least 1 year of industry experience OR you have 3+ years of experience in a data science or machine learning role with 1+ years of prototyping or applied research experience.\nYou have worked with big-ish data and you are very comfortable with at least one programming language for data processing and model development (e.g., python).\nYou can flexibly choose the right approach, model, and tool for a given challenge. You have some prior experience working with unstructured data (e.g., NLP) or geospatial data or recommender systems or related.\nYou have strong analytical and problem-solving skills. You take a critical approach to data and are mindful of the responsibilities that come with technologies that drive scale.\nYou are curious and playful with an ability to handle ambiguity. You enjoy identifying, scoping, and developing solutions with limited guidance, you have good product sense.\nYou enjoy explaining complex concepts to technical and non-technical audiences, and you are excellent at it.\nYou have a passion for doing mission-oriented work. You value solutions and people over technology.\nNice to have:\nYou have experience building health technology and/or manipulating health data\nYou have prior experience with Google Cloud Platform and Docker\nYou have previous exposure to clinical operations and/or working with physicians\nYou have worked in fast-moving startup environments\nYou should include these in your application:\nA resume and/or LinkedIn profile.\nA short cover letter\nCityblock values diversity as a core tenet of the work we do and populations we serve. We are an equal opportunity employer, indiscriminate of race, religion, ethnicity, national origin, citizenship, gender, gender identity, sexual orientation, age, veteran status, disability, genetic information, or any other protected characteristic.\n\nWe are excited to hear from you!"}