{"title": "2020 Intern Marketing Senior Data Scientist", "company": "IBM", "description": "Uncover and transform insights into creative experiences that matter to your customers. Make every touchpoint an opportunity to engage. As a Marketing Professional at IBM, you will create stories that cut through noise and have an impact on your audience. IBM is trailblazing the Agile Marketing approach, allowing you to work with speed, adaptability and creativity to uncover insights and deliver experiences that matter to your customers.\n\nSTART AND END DATES FOR THIS INTERNSHIP ARE DURING SUMMER 2020 (3 months)\n\n\nIBM Marketing has a world leading team of data scientists who are developing cutting edge solutions to help customers through the entire buying journey for enterprise offerings. The team is seeking to build the next generation of data scientists.\n\nData Science is a critical team within the Marketing Analytics, Data, & Media organization. The team builds first-of-a-kind capabilities using advanced statistical modeling techniques that scale across all of IBM’s business units and geographies. The team is positioned to bring marketing science to the next level, toward substantial revenue outcomes for IBM.\n\nMarketing Data Scientist Interns will work alongside our Marketing Analytics Experts to develop scalable analytical solutions that provide data-driven and optimization insights to IBM. Interns will work with large, complex data sets and extract knowledge or insights to solve difficult, non-routine analysis problems, applying advanced analytical methods as needed. Interns will conduct end-to-end analysis that includes industry research, data gathering and requirements specification, processing, analysis, ongoing deliverables, and presentations.\nAs a Marketing Data Scientist Intern, you’ll work collaboratively, as part of a team, on a project that addresses a strategic IBM Marketing business challenge. This is a highly visible intern program with leadership exposure throughout the summer. You will have the opportunity to showcase your final outcomes to a large audience of Marketing Leaders and Practitioners across the organization. In addition to the project, the internship includes educational and networking and activities.\n\nInterested candidates should have formal graduate-level training in statistics, machine learning, applied mathematics, and/or operations research with a passion to learn and deploy leading technologies to drive business outcomes.\n\nSummer Marketing Data Scientist intern positions are primarily based in New York, New York.\n\nMktgeph\n\n\n\n\nCurrently pursuing a graduate degree in a quantitative discipline (e.g., statistics, data science, computer science, behavioral science, applied mathematics, operations research) or another discipline involving experimental design and quantitative analysis of data.\nExperience using technology to work with datasets such as Scripting, Python, statistical software (SPSS, SAS, R, or similar).\nExperience with statistical analysis such as linear models, multivariate analysis, clustering, time series, mixed model, and Bayesian methods.\nBasic Knowledge of Marketing and Analytics\n\nCurrently pursuing a PhD in a quantitative discipline (e.g., statistics, data science, computer science, behavioral science, applied mathematics, operations research) or another discipline involving experimental design and quantitative analysis of data.\nAdvanced knowledge and experience working with large data sets and apply data mining / predictive modeling techniques to extract meaningful insights\nStrong track record of developing intellectual capital such as published works. Basic knowledge of digital marketing\nPassion for advancements in Data Science and Predictive Analytics\n\nIBM Corporate Headquarters (CHQ) team represents a variety of functions such as marketing, finance, legal, operations, HR, and more, all working together to solve some of the world's most complex problems, help our clients achieve success and build collaborative work environments for IBMers.\n\nWhat matters to you when you’re looking for your next career challenge?\n\nMaybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.\n\nImpact. Inclusion. Infinite Experiences. Do your best work ever.\n\nIBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.\n\nIBM will not be providing visa sponsorship for this position now or in the future. Therefore, in order to be considered for this position, you must have the ability to work without a need for current or future visa sponsorship.\n\nIBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status."}