{"title": "Computer Science & Data Analytics Residency", "company": "New Visions Central Office", "description": "About Us\n--------\n\nSince 1989 New Visions for Public Schools has served as a laboratory of innovation within NYC's public schools, ensuring students have access to a high-quality education that prepares them for the rigors of college and the workforce and driving significant achievement gains for tens of thousands of students. We pioneered the small high schools model creating ~150 new public high schools across NYC, produce free open-source curriculum used by thousands of teachers in New York State and across the country, and run a nationally-recognized Urban Teacher Residency program to train new teachers. The New Visions network currently supports over 200,000 students across more than 400 district and charter schools across the city.\n\nPosition Summary\n----------------\n\nComputer Science & Data Analytics Residents will support design, development, and implementation of software and tool development for the innovative School Systems and Data Analytics Department (known as sysDaar). Residents will provide critical support in developing and maintaining New Visions' suite of custom web applications that directly support educators in seizing every opportunity for student success. Residents will make meaningful contributions to new and on-going projects; leverage opportunities to learn new web development, data architecture and data analytics frameworks; and launch new projects focused on one of the following areas: test automation, release management, or data analytics.\n\nEach resident position is a six month, part-time position starting in Feb 2020, with possible renewal for up to the six subsequent months. Residents will be selected for data analytics, quality assurance, and engineering teams. Residents hired through partner program will be compensated at the contracted rate; Direct hire residents will be paid at the rate of $18-$30 per hour, depending on the level of education.\n\nCore Duties and Responsibilities\n\nThe Resident will complete both short- and long-term assignments which may include:\n\nMonitoring online communities and describing technical challenges to developers\nConducting quality assurance of New Visions' tool suite\nWorking on a team with other residents to define and complete a project for sysDaar and/or end-users\nResearching web development frameworks and facilitate meetings or professional development sessions with New Visions staff to share knowledge\nAnalyzing available open data sources to supplement and inform internal data findings\nDistilling insights from complex datasets and creating visualizations to communicate findings.\nEducation and Experience\n------------------------\n\nCandidates with computer science, engineering, mathematics, statistics or a related course of study with 30 or more credits will be considered. Students currently working towards a B.A., B.S. or a graduate degree are welcome to apply\n\nRequired Skill Sets and Knowledge Base\n--------------------------------------\n\nFamiliarity with Google Apps, including Gmail, Google Drive, Google Sheets, Google Forms\nA computer programming skill set (i.e. HTML/CSS, JavaScript, Python, R or other scripting languages) and a desire to develop professionally.\nStrong analytical and critical thinking skills\nExcellent interpersonal and written communication skills\nAbility to unpack and frame information and data into key patterns/ideas\nInitiative and proven ability to work independently with minimum supervision\nDemonstrated ability to prioritize, multi-task, work under pressure and meet deadlines\nKnowledge of or willingness to learn new programming languages and frameworks\nNew Visions for Public Schools is an equal opportunity employer. It is the policy of New Visions that all employees and applicants for employment will be treated in all respects on the basis of their merit and qualifications and without regards to their race, color, national origin, age, disability, sexual orientation, religion, gender, military status, marital status, ancestry, or any other reason prohibited by law."}