{"title": "Data Scientist", "company": "Nearpod", "description": "Level\nUndisclosed\nJob Location\nBrooklyn - , NY\nPosition Type\nUndisclosed\nEducation Level\nUndisclosed\nSalary Range\nUndisclosed\nTravel Percentage\nUndisclosed\nJob Shift\nUndisclosed\nJob Category\nEngineering\nCompany Overview:\nNearpod, recently named EdTech Digest’s Company of the Year, is the most comprehensive Student Engagement Platform for K-12 teachers. Nearpod works with any classroom technology from tablets and smartphones to laptops and Chromebooks to help engage students with activities such as Virtual Reality, PhET and Desmos and with more than 7,000 ready-to-run lessons created in partnership with leading brands like Common Sense Education and the Pulitzer Center. Beyond classroom instruction, the company revitalizes teacher development through teacher Professional Learning content that cultivates classroom-changing strategies for educators.\n\nSince its launch in 2012, Nearpod has become a leader (& teacher favorite) in teaching and learning with technology. Currently teachers in 3 out of 5 districts in the US use Nearpod.\n\nNearpod has offices in Fort Lauderdale, FL and Brooklyn, NY, and is backed by notable investors like Insight Venture Partners, Reach Capital, Storm Ventures, the Stanford StartX Fund, and the Knight Enterprise Fund.\n\nIn 2019, Nearpod acquired Flocabulary, the leading video and student creativity platform that uses educational hip-hop to engage students and increase achievement. This acquisition has brought together two of the brands most loved by teacher to help engage students in all K-12 classrooms.\n\nLocation: Brooklyn, NY\n\nPosition Overview:\nAs Nearpod’s Data Science Scientist, you are organized, analytical, and detail oriented with experience maintaining solid processes and data integrity. You are inquisitive and able to dive into the data to find answers to business problems. In this role, you'll be a key member of the team with an exciting startup with a strong social mission, and be in a position to make a significant positive impact on the business. You’ll help drive a wide range of projects.\n\nResponsibilities\nWork with the product team to collect, process, and analyze data to drive product direction in helping improve the achievement and engagement gaps in schools\nLead the team to increase the level of maturity and skill in analytical software development\nFormulate, implement, and evaluate algorithms for platform and application features\nDevelop clear documentation for summary tables, dashboards, ad-hoc reports and analytics tools\nMake sure the data we use every day in our analytics products are accurate, and be an advocate for clean and maintainable data structures. You’ll build tests to make sure this is the case, and that breaking changes to underlying data models are caught early.\nWork closely with Product Management, Technical Operations, and QA to develop, test, and deploy highly useful, high quality software\nDesign new and improving existing models to enhance our analytic capability\nSupport the creation of self-serve tools & external integrations\nSupport other ad hoc analyses as needed.\n\nAbout Analytics\nWe believe that good analytics help drive good business practices, and that the foundation is accurate data. The team is lean and is expected to be resourceful, thoughtful and creative when allocating resources, prioritizing, and solutioning.\n\nOur stack consists of:\nData Warehouse: MS SQL / Redshift\nEvent tracking: Mixpanel / Snowplow\nVisualization: Mode Analytics, Tableau\nOther Tools: Salesforce, Pardot, Intercom, Gainsight, Sendgrid\n\nRequirements\n3+ years of Data Science / Data Engineering or equivalent experience\n3+ years of Python programming experience\nPreferably with tools in our stack\nMath or science background\nClearly demonstrated organizational capacity & attention to detail\nProficient in writing & debugging SQL\nProficient in pandas, numpy, and/or scikit learn\nComfortable collecting, organizing and presenting data to stakeholders throughout the organization\nFamiliarity with infographic design is preferrable\n\nKey Traits:\nStrong organization - Our team relies on correct, timely analysis and the best way to achieve that is with solid data integrity. Your attention to detail will be a multiplier for the team.\nIntegrity - Our team depends on your insights and analysis to drive decisions that affect the direction of the product and the company. Your processes and decision making must be conducted with a high degree of integrity and responsibility.\nInquisitive - We hire eager learners who will pick up any tool they need to get the job done.\nExcellent communication - We value clarity and objectivity in communication. You possess excellent communication skills and the ability to clearly communicate technical concepts to a non-technical audience\n\n\nEmployment Requirements: Must be authorized to work in the U.S. without restrictions\n\nWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}