{"title": "Sr. Data Scientist", "company": "Nike", "description": "Become a Part of the NIKE, Inc. Team\nNIKE, Inc. does more than outfit the world’s best athletes. It is a place to explore potential, obliterate boundaries and push out the edges of what can be. The company looks for people who can grow, think, dream and create. Its culture thrives by embracing diversity and rewarding imagination. The brand seeks achievers, leaders and visionaries. At NIKE, Inc. it’s about each person bringing skills and passion to a challenging and constantly evolving game.\nFrom our flagship website and five-star mobile apps to social media, digital marketing and the retail store experience, our teams at NIKE Digital are reimagining how design and technology meet to serve consumers more directly and personally. We invest in cutting-edge technologies and work with the most creative people in the world. Our teams are innovative, diverse, multidisciplinary and collaborative, taking technology into the future and bringing the world with it.\n\nNike's Member Data Science is a growing organization responsible for building and deepening a holistic view of Nike's consumers through data and analytics and applying those insights to inform the development and growth of incredible digital services, content and experiences for our consumers.\n\nWe are looking for a data scientist with tech industry experience to work in our research group and help improve our core predictive models. Specifically, we want someone who has an excellent knowledge of statistics and machine learning methodology. Additionally, you must love writing code and have exceptional R or Python programming skills.\n\nWe’re looking for someone who thrives in a dynamic setting and can work as part of a team. You’ll be working collaboratively with other data scientists. Communication skills are key for this position and you’ll be expected to clearly explain your methodology and findings to other data scientists, engineers, and team leadership. You’ll get to work with scientists with a breadth of experiences across industry and academia, including in machine learning, statistics, marketing, and finance. You’ll be expected to go deep and learn with them, as a peer.\n\nJob Duties and Responsibilities:\n\nResearch and develop accurate models that predict customer behavior and customer lifetime value using Bayesian, frequentist, and machine learning methodologies.\nCollaborate with other data scientists to solve problems necessary to address key business questions.\nProductionize predictive models for use in a containerized environment.\n\nRequired Skills and Experience:\n\n1+ years post grad experience developing predictive or explanatory models and/or experimentation processes\nStrong demonstrated ability to do research and develop mathematical models\nStellar programming ability in Python or R (Python preferred)\nDeep understanding of statistics, Bayesian methods, and machine learning methodology including tree methods, regression, and/or neural networks.\nExpertise with at least one production-quality programming language is desirable (e.g. C/C++)\nExceptional communication abilities\nExperience working with real-world data and analytics\nExperience with customer lifetime value and segmentation algorithms a plus\nExpertise with SQL\nExperience with Cloud Platform (GCP and Kubernetes is a plus).\nExperience working in a production environment including best practice tools (e.g. cloud architecture, version control, containerization)\n\nEducation:\n\nPh. D. in applied mathematics, statistics, or machine learning or M.A. with considerable industry experience\nExceptionally qualified candidates without a graduate degree will also be considered.\n\nNIKE, Inc. is a growth company that looks for team members to grow with it. Nike offers a generous total rewards package, casual work environment, a diverse and inclusive culture, and an electric atmosphere for professional development. No matter the location, or the role, every Nike employee shares one galvanizing mission: To bring inspiration and innovation to every athlete* in the world.\nNIKE, Inc. is committed to employing a diverse workforce. Qualified applicants will receive consideration without regard to race, color, religion, sex, national origin, age, sexual orientation, gender identity, gender expression, veteran status, or disability."}