{"title": "Data Scientist – Machine Learning, NLP and ImageExpert", "company": "Novartis", "description": "Come join as at NOVARTIS, we are looking for exceptional data scientists to design and execute data and analytics use cases for COE Data & Analytics. Can you keep pace with open source revolution in AI, work alongside Digital/Data leaders and partner with business stakeholders to support Novartis transformation journey? If YES, then we want to hear from you!\nYour responsibilities:\nIn this newly created role, you will:\nInnovate and recommend advanced predictive analytics, computational science, Natural Language Processing (NLP), machine learning and deep learning techniques to answer research questions and synthesize insights that achieve business objectives.\nEstablish scalable, efficient, automated solutions for large scale data analyses, model development, model validation and model implementation. Work to translate prototypes into new products, services, and features and provide guidelines for large-scale implementation.\nBuild and fine tune algorithms that scale up from small-scale proof-of-concept stage to full production systems\nBuild knowledge artifacts of real business problems that were solved with advanced analytics techniques which can be published in journals\nWhy consider Novartis?\n750 million. That’s how many lives our products touch. And while we’re proud of that fact, in this world of digital and technological transformation, we must also ask ourselves this: how can we continue to improve and extend even more people’s lives?\nWe believe the answers are found when curious, courageous and collaborative people like you are brought together in an inspiring environment. Where you’re given opportunities to explore the power of digital and data. Where you’re empowered to risk failure by taking smart risks, and where you’re surrounded by people who share your determination to tackle the world’s toughest medical challenges.\n\nWe are Novartis. Join us and help us reimagine medicine.\nEEO Statement\nThe Novartis Group of Companies are Equal Opportunity Employers and take pride in maintaining a diverse environment. We do not discriminate in recruitment, hiring, training, promotion or any other employment practices for reasons of race, color, religion, gender, national origin, age, sexual orientation, marital or veteran status, disability, or any other legally protected status.\nMinimum requirements\nWhat you’ll bring to the role:\nAn advanced degree (master’s or doctoral) in a highly quantitative field including but not limited to Computer Science, Applied Mathematics, Operations Research, Biomedical Engineering, Computational Physics, Electrical Engineering\nThree or more years of relevant experience in Image/NLP/DS story telling\nExperience conducting end-to-end analysis for large scale data sets\nCross-industry experience highly preferred and previous experience in either pharma, biotech or healthcare desired.\nDivision\nNBS\nBusiness Unit\nIT NBS\nCountry\nUSA\nWork Location\nEast Hanover, NJ\nCompany/Legal Entity\nNovartis Corporation\nFunctional Area\nInformation Technology\nJob Type\nFull Time\nEmployment Type\nRegular"}