{"title": "Associate Data Scientist", "company": "Macy's", "description": "Job Overview:\n\nAs part of the Supply Chain group, the Associate Data Scientist will develop innovative analytical approaches to merchandising, supply chain, customer, and pricing strategies. The Associate Data Scientist will perform technical analyses to forecast demand, understand customer preferences, simulate business outcomes, and optimize inventory investments. The Associate Data Scientist will develop persuasive interactive visualizations to influence high-impact business decisions. Perform other duties as assigned.\n\nEssential Functions:\nAnswer complex business questions by applying structured problem solving and performing technical analyses.\nSupport the development of classification, forecasting, simulation, optimization, and summarization applications.\nWork closely with cross functional teams to draw insights from data and analysis.\nCreate compelling interactive visualizations and presentations to enhance decision making capabilities throughout the company.\nRegular, dependable attendance & punctuality.\nQualifications:\n\nEducation/Experience:\nB.S. or M.S. (preferred) in relevant technical field such as Applied Mathematics, Computer Science, Engineering, Physics, or Economics.\nCommunication Skills:\nAbility to communicate complex quantitative analyses in a clear, precise, and actionable manner.\nMathematical Skills:\nBasic math functions such as addition, subtraction, multiplication, division, and analytical skills.\nReasoning Ability:\nMust be able to work independently with minimal supervision and make sound decisions.\nPhysical Demands:\nThis position involves regular walking, standing, sitting for extended periods of time, hearing, and talking.\nMay occasionally involve stooping, kneeling, or crouching.\nMay involve close vision, color vision, depth perception, focus adjustment, and viewing computer monitor for extended periods of time.\nInvolves manual dexterity for using keyboard, mouse, and other office equipment.\nMay involve moving or lifting items under 10 pounds.\nOther Skills:\nStrong passion for answering complex business questions using structured problem solving and rigorous data analysis.\nFamiliarity with analytical tools such as SAS, R, Matlab, or STATA or scripting languages such as Python, Perl, or PHP.\nFamiliarity with relational databases and SQL and experience working with large data sets and distributed computing tools such as Hadoop, Map/Reduce, Hive, etc.\nFamiliarity with visualization tools such as Tableau or Spotfire.\nWork Hours:\nAbility to work a flexible schedule based on department and company needs.\nThis job description is not all inclusive. In addition, Macy's, Inc. reserves the right to amend this job description at any time. Macy’s, Inc. is an Equal Opportunity Employer, committed to a diverse and inclusive work environment."}