{"title": "Data Scientist", "company": "Source Enterprises", "description": "Source Systems is now inviting the brightest, creative and passionate minds to become a part of our Data Scientist Internship Program. Work with our industry experts to gain unrivaled knowledge at both the strategic level (generating bold and innovative ideas for data science-driven growth) and at the tactical level across multiple teams (building and testing hypotheses, creating predictive analytics models, incorporating findings into proof points supporting product launches). These invaluable experiences will greatly increase your skills and value to employers. We know what it takes to leverage powerful data systems that are used to provide important results for company planning and key decision making.\nJob Description\nA position at Source Systems is a rich experience that cannot be duplicated in any other learning/working environment. We are looking for a Data Scientist Intern that helps us discover the information hidden in vast amounts of data, and help us make smarter decisions to deliver even better products. Your primary focus will be in applying data mining techniques, doing statistical analysis, and building high-quality prediction systems integrated with our products.\nYou will collaborate with cross-functional teams to define, design, implement, data mining capabilities and effectively provide the results, in a fast paced environment, necessary to meet our business needs. This position may include working remotely and provides flexible hours to accommodate productive work-flow.\nResponsibilities:\nSelecting features, building and optimizing classifiers using machine learning techniques\nData mining using state-of-the-art methods\nExtending company’s data with third party sources of information when needed\nEnhancing data collection procedures to include information that is relevant for building analytic systems\nProcessing, cleansing, and verifying the integrity of data used for analysis\nDoing ad-hoc analysis and presenting results in a clear manner\nCreating automated anomaly detection systems and constant tracking of its performance\nStay current on modern trends and advances in data mining technology\nWork closely with our experts and other team members to efficiently prototype/develop features and functions for our various products\nPerform other duties as assigned\nQualifications:\nInternship candidates should have high interest in learning top of the line data mining platforms, programming, tools, testing, and analyzing business needs:\nUnderstanding of machine learning techniques and algorithms, such as: k-NN, Naive Bayes, SVM, Decision Forests, etc.\nSome knowledge of common data science toolkits, such as R, Weka, NumPy, MatLab, etc\nData visualization tools, such as D3.js, GGplot, etc.\nNoSQL databases, such as MongoDB, Cassandra, HBase, etc.\nStatistics skills, such as distributions, statistical testing, regression, etc.\nData-oriented personality\nExcellent writing & organizational skills\nIndependent work ethic\nDetail oriented\nStrong drive to succeed\nEntrepreneurial mindset\nProactive\nGood communicator\nTeam player\nAutonomous\nPassion for coding, solving problems and working in a team environment\nUse a provided online productivity platform to organize and keep track of your completed\ntasks.\nMakes suggestions for processes, coding, implementation, and/or performance improvements.\nPlease send a resume for consideration.\nPart time and Full time positions available.\nFlexible at home positions available."}