{"title": "Data Scientist", "company": "Ocrolus", "description": "Who We Are:\nOcrolus is a growth stage company whose core competency is a proprietary set of workflows that use attended (or human-in-the-loop) machine learning and crowdsourcing for deep financial review (i.e. fraud, risk scoring, cash flow), data digitization, and automated decisioning of semi & unstructured documents. Because of our speed and accuracy, we are an industry standard in the FinTech lending space. Ocrolus can analyze and verify data across bank statements, paystubs, tax documents, and other financial records with over 99% accuracy and in minutes rather than days or weeks. Ocrolus has raised over $30 million from firms like Oak HC/FT, FinTech Collective, Bullpen Capital, and QED Investors, among others\n\nWe're looking for a Data Scientist to join our team. Rather than just crunching data in a dark room were looking for someone passionate about delivering data products – willing to tackle whatever problem needs to be solved to provide insights to stakeholders across the company. You can easily support critical decision-making with either fast back-of-the-envelope analyses or more robust evaluations, depending on the context.\nResponsibilities\nManage competing priorities across the company\nCommunicate with Different Stakeholders regarding analytics\nCreatively explore data to find interesting stories to tell\nShepherd data models from sourcing the data to releasing models in production environments\nWorking collaboratively and mentoring Data Analysts\nRequirements\nAt least four years experience as a Data Scientist, 6+ years a plus.\nFluent in Python and SQL\nDeep understanding of statistics and probability, preferably an understanding of information theory\nStrong communication and storytelling skills, data visualization a+\nExperience working with Data Scientists and Data Analysts\nExcellent pattern recognition and predictive modeling skills\nAbility to create fast solutions to problems introduced in a changing environment with iteration towards optimal solutions\nMachine Learning experience a plus\n\nWe’re a young and rapidly growing FinTech company - if you have ever wanted to jump on a rocket ship as it’s taking off, now is your chance!"}