{"title": "Data Scientist (C13/VP) New York, NY", "company": "Citi", "description": "Global Compliance plays a critical role in the successful execution of the firm’s compliance mission. The Compliance function ensures the development and maintenance of a strong compliance culture by developing and maintaining program infrastructure that identifies measures and monitors adherence with applicable laws, regulations and rules that govern our business globally. Compliance teams work closely with business, legal, and audit functions to provide expertise on regulatory compliance matters, assess and measure compliance and related risk and, monitor and test the adequacy of the firm’s compliance control environment.\nWe are seeking highly qualified data science professionals in the execution of strategic projects designed to strengthen and support Citi Compliance's move to using predictive analytics for monitoring and surveillance functions.\nThe candidate will be a part of a team of data scientists that will be tasked with developing predictive / scoring models using supervised and unsupervised techniques. The team will leverage Citi's Enterprise Analytics platform (EAP) for this purpose.\nJOB RESPONSIBILITIES:\nAbility to perform data assessment and understand data imputations and impact\nBe able to define features in consultation with business / data SMEs\nApply statistical aggregations to data to come with features that are not hard bound to limits\nApply industry standard techniques for feature selection like PCA, MCMC, Clustering etc.\nAbility to develop and train models through use of various algorithms like random forest, GBT, Logistic regression, SVM etc.\nAble to articulate thought process and approach and develop documentation related to defensibility of the solution with auditors (external and internal)\nKNOWLEDGE & EXPERIENCE:\nMust be able to work with team members in different geographic locations.\nMust have prior proven experience in building predictive analytics solutions from ground up.\nMust have at 3+ years of relevant experience\nKnowledge of Hadoop, Hive, Spark, Python is must\nExperience with other technologies such as machine learning, Kafka and Oozie is a plus.\nExperience with NLP (Natural language Processing) systems is preferred.\nPrior banking and financial sector experience is a bonus\nCANDIDATE QUALIFICATIONS:\nMinimum Years of Experience: 3 Years\nBachelor's Degree or equivalent work experience. Master's Degree preferred.\nThis job description provides a high-level review of the types of work performed. Other job-related duties may be assigned as required.\n-\nGrade :All Job Level - All Job FunctionsAll Job Level - All Job Functions - US\n-\nTime Type :Full time\n-\nCiti is an equal opportunity and affirmative action employer.\nMinority/Female/Veteran/Individuals with Disabilities/Sexual Orientation/Gender Identity.\nCitigroup Inc. and its subsidiaries (\"Citi”) invite all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity CLICK HERE.\nTo view the \"EEO is the Law\" poster CLICK HERE. To view the EEO is the Law Supplement CLICK HERE.\nTo view the EEO Policy Statement CLICK HERE.\nTo view the Pay Transparency Posting CLICK HERE."}