{"title": "Data Scientist", "company": "7Park Data", "description": "7Park Data, a Vista Equity portfolio company, is the world’s leading alternative data intelligence firm. We have access to some of the most coveted alternative datasets – such as clickstream, geolocation, mobile app usage, credit and debit card, email receipt, and shipping cargo data – and are constantly acquiring more.\nYou will be joining other extremely passionate data scientists, product managers, and engineers that share a common interest in tackling some of the most difficult data science and machine learning problems today. With the data products and machine learning systems you design, 7Park will arm influential decisionmakers at financial and corporate giants with critical information they need to make smart, data-driven decisions. And, along the way, you will help advance the current work in artificial intelligence and predictive modeling.\nThe data science team has two major goals: to create and build data products that provide intelligence on real-time economic activity to our financial and corporate clients and to research and develop machine learning systems to extract information from large volumes of structured and unstructured text.\nWe are looking for a talented and creative Data Scientist to join our data science team. As a Data Scientist, you will be responsible for the following:\nConduct research on some of the world’s most interesting alternative datasets\nPlan, develop, and apply cutting-edge machine learning systems and statistical modeling to extract insight from vast amounts of data at scale\nWrite production-ready code to analyze, structure, and make accurate and timely predictions\nDesign systems to monitor the results of models in productions, discover and address anomalies, and ensure the robustness and reliability of these models\nLead projects from start to finish, collaborating with 7Park’s senior management, product managers, engineers, external data partners, and clients\nAn ideal candidate will be passionate about building machine learning systems on real world data and have several years of industry experience and/or a Masters or PhD in computer science, mathematics, statistics, linguistics, physics, computational finance, or a similar quantitative field.\nIt is also very important that you enjoying working in a lean, tight-knit, and highly entrepreneurial startup that marries the creative, experimental problem-solving found in academia with the hacker ethos of shipping products quickly and often.\nCompensation package: includes highly competitive salary, bonus and 401(k) plan.\nRequirements\nAt least 5 years of relevant professional experience and/or a Masters or PhD in computer science, mathematics, statistics, linguistics, physics, computational finance, or similar quantitative field.\nStrong knowledge of machine learning, computer science, mathematics, and statistics.\nStrong programming skills in Python, R, and/or Scala.\nExperience with NumPy, SciPy, Pandas, Scikit-Learn, TensorFlow, and Keras. PyTorch is also acceptable.\nExperience with building distributed machine learning systems using Apache Spark and a working knowledge of MLlib.\nExperience with several of the following concepts: decision trees, random forests, and gradient boosting; linear regression; logistic regression; linear and non-linear dimensionality reduction using PCA, kernel methods, and dictionary learning; clustering with K-means, hierarchical clustering, and DBSCAN; autoencoders; generative models; and sequential data modeling.\nBonus\nPublications in communities such as NIPS, ICML, or related.\nGitHub projects demonstrating your creative drive.\nKaggle wins demonstrating your competitive drive.\nExperience running or working at data-centric startups.\nExperience with knowledge graphs.\nWorking knowledge of GraphX and Spark Streaming."}