{"title": "Senior Associate, Data Sciences", "company": "Wavemaker", "description": "Senior Analyst, Data Sciences, L’Oréal\n\nAs part of the Data Sciences team, the Senior Analyst helps measure the performance of campaigns, illustrates clients’ return on investment, and provides insights into ad performance. He/she utilizes various analysis and measurement tools to provide timely, in-depth reporting solutions. The Senior Analyst is expected to be an active participant on the business, consistently engaged and contributing ideas and insights that will benefit our clients.\n\nDetailed Description\n\nData Analysis and Execution\nResponsible for pulling data, analyzing data, and quality control of reporting/analysis for multiple brands\nUtilizes tools and databases to report and analyze clients’ post analysis data\nEnsures that quality and timeliness of deliverables meet client expectations\nOffer attention to detail and ability to identify trends in data across sources\n\nStrategic Thinking\nAssess problems and concerns in a systematic, logical and rational manner\nProactively resolve issues\nManage multiple deliverables across client and offer an ability to seamlessly transition among them\n\nRelationship Management\nBuilds positive relationships with internal teams\nManages day-to-day client deliverables\n\nCommunication\nExpresses oneself clearly and concisely in communications\nOrganizes ideas and information logically and sequentially\nDelivers client reports that are clear and compelling\nEnsure key information is provided as needed\n\nQualifications\nBachelor’s Degree\nMust be able to demonstrate data interpretation capabilities (Exposure to analytical course work, a plus)\nThrives in a fast paced, constantly changing environment; can adapt plans due to changes in client objectives, priorities or budgets while minimizing impact on project momentum\nExcellent presentation and report writing skills\nStrong analytical skills and ability to relate results to client business objectives\nStrong computer skills (Excel, Access PowerPoint)\nKnowledge of working with large relational datasets helpful"}