{"title": "Senior Data Scientist", "company": "Kickstarter.com", "description": "Brooklyn, NY\nKickstarter PBC is looking for a collaborative Senior Data Scientist to join our Insights team.\n\nAbout the Insights Team\n\nKickstarter is a complex and diverse ecosystem with an incredibly rich data set. The Insights team is tasked with harnessing this data, providing the organization with the analytical tools and actionable insights in order to drive meaningful impact across Kickstarter’s teams and operations. We’re passionate about finding new ways to use data and research to bring more creative projects to life.\n\nOur Team’s Objectives Include:\n\nDemocratizing data access across the organization and providing tools and training to support data-informed decisions;\nAcquiring and synthesizing all relevant information about our ecosystem, our competitors, the creative landscape, and our users, to provide high quality strategic advice to decision makers at all levels of the organization;\nRaising the quality of data in our system, including improving our data infrastructure and modeling, and utilizing a variety of research methodologies to understand our users and their experiences.\n\nTo achieve this we will seek to use the most up to date data, analytical techniques, and appropriate technologies. We collaborate with teams across the organization to provide colleagues with reliable and actionable information through research, reporting, dashboards, and analytics. We value peer feedback, continuous learning, and blameless post-mortems. We prefer proven technology and have built most of our data infrastructure on AWS, but we also care about finding the right tools for the job, so we invest in cutting-edge technology when it's a good fit.\n\nAbout the Role\n\nWe’ve developed cutting-edge infrastructure to help us collect and aggregate data from our production applications, largely built on AWS. You will work with tools like R and Python to explore and visualize data, oversee the transformation and testing of our logic in DBT and our data lake, and collaborate on building out Looker, our BI tool of choice, for reporting and exploration. You will mine the data ecosystem to find fruitful signals and develop and deploy performant algorithms.\n\nIn the short term, you'll help to improve our data systems and collaborate with colleagues across Kickstarter in order to centralize our knowledge into DBT. You’ll contribute to building out new tools like Optimizely and Qualtrics, standardize our event tracking and referral systems, and build out user segments to be consumed across the company.\n\nLong term, you’ll cultivate a nuanced understanding of the Kickstarter product and data, and lead research to uncover the questions we don’t know we should be asking. Your insights and wisdom will be essential to how Kickstarter evolves, lead to new data products, and your expertise will guide us as we learn new things every step of the way. You will foster a culture of experimentation and research, and standardize and improve our data products.\n\nYou’ll also help manage and mentor more junior employees on the Insights team as we continue to grow and scale.\n\nYour background should include experience using your data skills day to day as well as a healthy understanding of the product development lifecycle. Ideally you’re adept at using statistics to separate signal from noise, but you're also completely at ease communicating the story behind the data.\n\nAbout You:\n\nYou can demonstrate extensive SQL knowledge and are at ease wrangling large datasets.\nYou have extensive experience in data-driven product analysis using languages like R and Python.\nYou have experience managing and mentoring data scientists on your team.You value communicating insights concisely, accurately, and meaningfully to a diverse audience.\nYou are oriented towards understanding and solving business problems - working to develop solutions to make data work better for decision makers across the organization.\nExperience with or desire to learn about AWS (including Redshift, Glue, Spectrum, Kinesis, and Sagemaker), DBT, Looker, or similar products is a strong plus.\n\n\nKickstarter is an equal opportunity employer. As part of our commitment to fight for equality, we work to ensure a fair and consistent interview process. We celebrate diversity and we are committed to an inclusive work environment.\n\nKickstarter is a Public Benefit Corporation, and our mission is to help bring creative projects to life. We measure our success as a company by how well we achieve that mission, not by the size of our profits. In our charter, we spell out our mission, our values, and the commitments we have made to pursue them."}