{"title": "Data Scientist", "company": "Tradeweb Markets LLC", "description": "Job Responsibilities:\nResponsible for helping build quantitative data models for Credit products\nDevelop data tools to help optimize large data sets for internal and client use\nMaintain and enhance pricing algorithms\nDevelop in Python, SQL, and Tableau\nManage multiple projects at once which are global, business aligned or group level initiatives\nCommunicate with both internal stake holders and clients to inform them on new product enhancements and releases\nPresent to senior management on updates to the product development in a timely manner\n\nBachelor’s Degree in Computer Science, Information Science, Applied Mathematics, or Engineering preferred or equivalent work experience\n1-2 years’ experience working in quantitative data analytics in the Financial Services industry, preferably Fixed Income Markets\nExperience building and updating data models and databases\nStrong development background in Python, SQL and Tableau\nExcellent communication and technical writing skills including the ability to summarize and identify key messages targeted to both technical and non-technical audiences\nExcellent project management skills\nAbility to thrive independently and in team settings\nAbout Tradeweb Markets:\nTradeweb Markets Inc. (Nasdaq: TW) is a leading, global operator of electronic marketplaces for rates, credit, equities and money markets. Founded in 1996, Tradeweb provides access to markets, data and analytics, electronic trading, straight-through-processing and reporting for more than 40 products to clients in the institutional, wholesale and retail markets. Advanced technologies developed by Tradeweb enhance price discovery, order execution and trade workflows while allowing for greater scale and helping to reduce risks in client trading operations. Tradeweb serves approximately 2,500 clients in more than 60 countries. For more information, please go to www.tradeweb.com.\n\nTradeweb Markets LLC (\"Tradeweb\") is proud to be an EEO Minorities/Females/Protected Veterans/Disabled/Affirmative Action Employer.\n\nhttps://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf"}