{"title": "Data Scientist", "company": "AETNA", "description": "Description:\nLooking for opportunities to use cutting edge technologies analyzing petabytes of data in a world class Hadoop cluster, generating insights to guide consumers in their journey to wellness and help them achieve their health ambitions, whether its running the Inca Trail Marathon or playing tackle football with their grandkids? Aetna's Member Analytics team is focused on delivering strategically-impactful programs and tools to help members across all life stages feel the joy of achieving their best health, in their own way.\nSUMMARY\nThis position is for a seasoned data scientist role in the experimentation and campaign management platform team that will help to develop a world class experimentation, optimization and personalization platform. The candidate will work with a team of data scientists to develop analytics module with a full suite of A/B testing features, build machine leaning models to provide real time next best action for users and create a self learning optimization engine.\nThis is a unique opportunity to work on new transformation initiatives with CVS Health as a result of the recent company merger\n60582\n\nFundamental Components:\n\nBackground Experience:\n2-4 years of relevant work experience within eCommerce, digital analytics, insurance, finance or other related fields\nExperience with big data, preferably using Spark, Hadoop and Hive.\n3+ years experience in statistical analysis, algorithms, building machine learning models\nFamiliarity with experiment design\nExperience with using R, Python. PySpark to manipulate large data sets and develop statistical models\nExcellent problem solving skills, critical thinking and conceptual thinking abilities\nSuperior skills to effectively communicate technical ideas and results to non-technical clients in written and verbal form\nAbility to negotiate and manage interactions across the business and project stakeholders\nExperience regularly working collaboratively with others to solve problem\n\nPotential Telework Position:\nNo\n\nPercent of Travel Required:\n0 - 10%\n\nEEO Statement:\nAetna is an Equal Opportunity, Affirmative Action Employer\n\nBenefit Eligibility:\nBenefit eligibility may vary by position. Click here to review the benefits associated with this position.\n\nCandidate Privacy Information:\nAetna takes our candidate's data privacy seriously. At no time will any Aetna recruiter or employee request any financial or personal information (Social Security Number, Credit card information for direct deposit, etc.) from you via e-mail. Any requests for information will be discussed prior and will be conducted through a secure website provided by the recruiter. Should you be asked for such information, please notify us immediately."}