{"title": "Senior Data Scientist - Threat Intelligence Researcher", "company": "Verizon", "description": "What you’ll be doing...\nThis role requires experience building, analyzing and maintaining supervised learning models, as well as familiarity with malware detection and binary analysis.\nYou are expected to analyze model results and to develop and to develop and implement automated tools for data mining.\nIn this role, you’ll be responsible for:\nExperience in applying a wide variety of unsupervised, semi-supervised, and supervised machine learning techniques, and the ability to turn big data into actionable intelligence.\nAbility to analyze, retain and improve machine learning models.\nAbility to provide and receive scientific critiques and work towards data driven solutions.\nFamiliarity with malware, host forensics, or network traffic analysis.\nExperience with reverse engineering malware.\nExperience using relational and non-relational databases.\nExtracting and transforming data using python.\nApplying big data analytics tools to large, diverse sets of collection data assess risk of adverse threat activities.\nDeveloping scripts to support cyber threat detection that outputs results in a variety of formats.\nWhat we’re looking for...\nYou’ll need to have:\nBachelor’s degree or four or more years of work experience\nFour or more years of relevant work experience\nSix or more years of experience as a Data Scientist within Threat Intelligence\nExpertise in Automation tools such as Terraform, CloudFormation, Puppet, etc\nExperience with Hadoop and Spark\nProficiency in Python\nWillingness to travel\nEven better if you have:\nA Master of Computer Science or related fields\nAbility to work in a team environment\nUnderstanding of adversarial TTPs\n#ProfessionalServices; 22CyberVES; 22CyberOPS\nWhen you join Verizon...\nYou’ll have the power to go beyond – doing the work that’s transforming how people, businesses and things connect with each other. Not only do we provide the fastest and most reliable network for our customers, but we were first to 5G - a quantum leap in connectivity. Our connected solutions are making communities stronger and enabling energy efficiency. Here, you’ll have the ability to make an impact and create positive change. Whether you think in code, words, pictures or numbers, join our team of the best and brightest. We offer great pay, amazing benefits and opportunity to learn and grow in every role. Together we’ll go far.\nEqual Employment Opportunity\nWe're proud to be an equal opportunity employer- and celebrate our employees' differences,including race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, and Veteran status. Different makes us better."}