{"title": "Data Science Product Associate", "company": "IPG Mediabrands", "description": "Title: Data Science Product Associate\nDepartment: Product Innovation\nReports To: Director, New Product Development & Innovation\nLocation: New York\nKinesso delivers the most comprehensive, highest-performing Adtech solutions on the market. We provide extensive expertise for the global brands across our IPG Mediabrands agency partner landscape. Headquartered in New York.\nWe are a fast-paced, risk-taking, close-knit environment where ideas come from everywhere at every level. We believe that diversity of background, talent, skillset and mindset create a flourishing environment for new thinking and ideas. Our business is growing and we are always looking for new talent. If you are driven by challenging work, passionate about media and technology and interested in helping to shape the future of our industry, we would like to hear from you!\nThe Innovation team within Kinesso is responsible for creating new tools and software products that will create maximum new revenue at various points around the company’s business lines. Our focus is on extracting valuable insights from data in novel ways and in directly enabling value-adding action based on such insights. Within the Innovation team, the R&D group pursues complex and ambitious algorithmic and AI-enabled methods to exploit and explore data across the digital landscape.\nPurpose (Brief Job Summary)\n\nThe Data Science Product Associate will contribute in two key areas:\n\nWorking closely with the Director of New Product Development & Innovation to take discrete outputs from the R&D team’s advanced data science work and turn them into monetizable software assets in coordination with the media agencies who will use the products.\nParticipate on ideating & developing prototypes with our Sr. Software Engineer, as well as developing data models, that align to the KPI’s for our Product team’s yearly Strategic Initiatives, as well as working with our agency portfolio of Agency Products\nThe Data Science Product Associate will be a key part of these two missions, and will be responsible for (1) coding end-to-end data science products, (2) running basic “building-block” machine learning modules and data analytics models as components of larger solutions, and (3) contributing as a team member to the fundamental design and planning of new solutions and evaluation of problem and opportunity spaces.\nThe key traits we are looking for include superior analytical ability, curiosity and a desire to explore new paths, familiarity with data science concepts, basic familiarity with the fundamental concepts of machine learning, self-starting and willingness to run with a given task, and ability to stay focused on and deliver a single end-goal in an dynamic environment.\nResponsibilities\nWork closely with Product Innovation team leadership to analyze, understand and execute efficient approaches to manipulate data for insights and leveraging those insights for value.\nBuild fully functioning data science code bases from fundamental concepts spun out by the R&D team.\nContribute to larger, complex code bases undertaken by the R&D team.\nManage and execute evaluation of data availability.\nPrepare and clean data for custom algorithmic models.\nNavigate data storage infrastructure and create efficient pipeline to provide data inputs to algorithmic models.\nSkills & Qualifications\nBachelor’s degree or 2 years’ work experience with focus on data analysis, optimization, machine learning or similar fields.\nUnderstanding and/or experience of SEM and Social Media Marketing is a plus.\nFamiliarity with data storage and access infrastructure including SQL, S3, Redshift.\nComfortable coding in Python required; R, Java, C++ all a plus\nExcellent organizational skills; capacity to manage multiple priorities and tasks simultaneously and communicate rapidly with small R&D team in midst of rapid context-switching.\nExcellent written and oral communication skills.\nExceptionally self-motivated and directed.\nExceptional executive function skills, assessing a task, designing an approach, following through and revising as necessary.\nSuperior analytical, evaluative, and problem-solving abilities.\nExperience and/or strong desire to work in a high pressure, high demand entrepreneurial environment.\nBachelor’s degree required.\nAbout Kinesso\nKinesso brings together the best minds in data, technology and media activation to deliver seamless data-driven marketing solutions. As a technology-enabler, Kinesso powers marketing systems through a proprietary suite of applications that integrate ad tech and martech. Kinesso’s application framework spans audience, planning and activation, delivering insights and business outcomes for leading global brands. Learn more at www.kinesso.com."}