{"title": "Data Scientist", "company": "New York University", "description": "Position Summary\nThe Data Scientist will transform, analyze, package and present data to university administrative leadership to inform policy and decision making. The Data Scientist, in collaboration with stakeholders, develops innovative strategies for data derived insights.\nQualifications\nRequired Education:\nMaster's Degree or equivalent\n\nPreferred Education:\nMaster's Degree Quantitative degree (Engineering, Mathematics, Statistics, Computer Science or computation-intensive Sciences and Humanities).\n\nRequired Experience:\n5+ years experience translating business problems into data problems with different stakeholders or equivalent combination of education and experience. Relevant training/experience in data science and/or statistical methods.\n\nPreferred Experience:\n2+ years Experience in quantitative and qualitative research, statistical analysis, reporting, and/or data analysis of large, longitudinal data sets. Familiarity with the operational and business needs of a large higher education institution.\n\nRequired Skills, Knowledge and Abilities:\n• Demonstrated experience querying and processing large data sets. • Demonstrated experience analyzing and reporting on large data sets. • Demonstrated ability to tell stories with data using data visualization software or other reporting/BI tools (such as Tableau, PowerBI, ArcGIS, etc.). • Demonstrated experience in programming/scripting languages and statistical software (such as R, Python, or other programming language). • Demonstrated strong verbal and interpersonal communication skills. • Demonstrated proficiency in written communication skills. • Demonstrated ability to communicate advanced analytical concepts and complex quantitative analysis in a concise, clear and actionable manner. • Demonstrated ability to respond to changing priorities and ensure timely, accurate deliverables. • Demonstrated ability to work with diverse groups/populations.\n\nPreferred Skills, Knowledge and Abilities:\n• Demonstrated experience in manipulating and analyzing complex, high-volume, high-dimensionality data from varying sources. • Demonstrated experience with intermediate statistical methods. • Demonstrated familiarity with diverse data analytics tools. • Demonstrated project management experience. • Demonstrated knowledge of database & data management concepts.\nAdditional Information\nNYU aims to be among the greenest urban campuses in the country and carbon neutral by 2040. Learn more at nyu.edu/sustainability.\n\nEOE/AA/Minorities/Females/Vet/Disabled/Sexual Orientation/Gender Identity"}