{"title": "Data Scientist", "company": "Aramark", "description": "Description\nThe Data Scientist will work closely with the operations leadership team of our innovative, app-based on-demand food delivery service organization to optimize every facet of our complex operation. You will be the epicenter of business intelligence, uncovering impactful insights that put us ahead of the curve. Your day-to-day will support aggressive growth efforts at a rapidly scaling, geographically distributed company.\nYou will tap into our rich data to help make informed decisions on inventory management, production levels, delivery van routing, hours of operation, staffing levels, etc. Your duties will take you to our markets to ensure you tangibly understand challenges and can support the in-market team members in addition to executing at the corporate level. You will become the ‘go-to’ person for the operations team to make that team more effective.\nEssential Functions:\nDevelop innovate data models to streamline the collection and synthesis of information. Use these models to recommend action items that maximize efficiency in areas such as inventory management, food production schedules, efficient routing, accurate delivery estimates, etc.\nLeverage consumer analytics to understand customer purchasing and dining behavior. Identify key consumer segments within the customer base and summarize data-driven findings in a visual way that resonates with a variety of stakeholders and audiences.\nAnalyze business performance data from a multitude of sources including labor tracking, route efficiency, and inventory management systems to identify opportunities to improve operations and recommend data-driven action plans.\nLead the creation and development of key performance reporting to multiple stakeholders.\nGenerate ad-hoc analyses to measure the outcome of short-term strategies. Work with cross-functional teams to define insights and analytics required to measure success.\nFrequent meeting and collaboration with the leadership team to identify and track Food & Beverage KPIs and generate actionable insights to drive revenue.\nTeaming with the leadership team to generate and support Tableau dashboards to provide actionable data to key stakeholders.\nQualifications\nBachelor’s degree required in Mathematics, Statistics, Accounting or Finance or another scientific discipline.\nMinimum of 1-2 years of experience in an analytical function preferred.\nSuperior analytical ability and spreadsheet modeling skills are required.\nExcellent written and verbal skills and the ability to interface with multiple levels of management are essential.\nStrong organizational, project management and time management skills\nAbility to effectively communicate findings, analysis, implications, and recommendations to varied stakeholder audiences\nMust be able to problem solve and adjust priorities with little advance notice to meet deadlines and requests."}