{"title": "Data Scientist - Investment Research", "company": "Two Sigma Investments, LLC.", "description": "Two Sigma is a different kind of investment manager. Since 2001, we have used data science and technology to derive insights that forecast the future and discover value in markets worldwide. Our team of scientists, technologists and academics looks beyond traditional finance to understand the bigger picture and develop creative solutions to some of the world’s most challenging economic problems. Our work spans across markets and industries, from insurance and securities to private investments and new ventures.\n\nTwo Sigma's data engineering platform enables us to harness some of the world's most complex & challenging content, as we structure and integrate new datasets into a diverse ecosystem of syndicated financial and industry-specific data products. Two Sigma's data scientists are focused on joining, enriching, and transforming datasets into novel creative measures of economic activity. We utilize a variety of modeling techniques to generate financially-relevant predictions feeding into Two Sigma's systematic investment management platform, we measure the performance and impact of our predictions in a variety of settings, and we further distill economic insights and thematic analyses from our data & observations.\n\nYou will take on the following responsibilities:\n\nDesign & implement granular domain-specific indicators from data, relating them to company, industry, and macroeconomic factors\nContribute to the design of investing strategies on economic predictions through multiple investing paradigms\nManage requirements for a set of dependent data products derived from a large portfolio of integrated data feeds\nContribute to data sourcing strategy across multiple industry data verticals supporting our prediction efforts\nGenerate a series of economic insights research reports relating trends in our indicators & predictions to investment themes\n\nYou should possess the following qualifications:\n\n1-5+ years of experience in applied data analysis & prediction, preferably in an industry setting\nDegree in a technical or quantitative disciplines, like statistics, mathematics, physics, electrical engineering, or computer science\nDemonstrably strong data science modeling intuition and feature engineering creativity\nExpertise in applying statistical techniques for time-series measurement/estimation and prediction\nIntimate familiarity with the potential flaws & fallacies in the applications of specific statistical methods\nExperience specifying & managing requirements for datasets leveraged in your analyses\nWorking knowledge of SQL and common data science toolkits : Python, R, Spark, Matlab\nStrong written & verbal communication and presentation skills, with experience crafting a compelling narrative supported by data\nA portfolio of open-data analyses or data-driven research publications would be ideal\n\nYou will enjoy the following benefits:\n\nCore Benefits: Fully paid medical and dental insurance premiums for employees and dependents, competitive 401k match, employer-paid life & disability insurance\nPerks: Onsite gyms with laundry service, wellness activities, casual dress, snacks, game rooms\nLearning: Tuition reimbursement, conference and training sponsorship\nTime Off: Generous vacation and unlimited sick days, competitive paid caregiver leaves\n\nWe are proud to be an equal opportunity workplace. We do not discriminate based upon race, religion, color, national origin, sex, sexual orientation, gender identity/expression, age, status as a protected veteran, status as an individual with a disability, or any other applicable legally protected characteristics."}