{"title": "Data Sciences - Associate", "company": "TheMathCompany", "description": "COMPANY OVERVIEW\nAt TheMathCompany, we enable viable and valuable data and analytics transformations for our clients. Our mission is to help Fortune 500 organizations build core capabilities that set them on a path to achieve analytics self-sufficiency. We are changing the way companies go about executing enterprise-wide data engineering and data science initiatives, by defining and delivering comprehensive and robust analytics engagements. With a holistic range of services across data engineering, data science and management consulting, we are in the business of disrupting the analytics services and product space. To help us achieve our objectives, we are looking for passionate and experienced practitioners to be part of our US organization, and be part of the growth story of one of the fastest AI/ML startups in the world.\nWe, as an organization, are committed to your personal success and professional development. TheMathCompany offers and supports our employees' development of their personal brand through professional experiences, best in-class learning opportunities, inclusion, collaboration and personal well-being.\nROLE DESCRIPTION\nWe are looking for passionate individuals to help our clients solve complex challenges enabling their sustained analytics transformation. As a member of our Client Services team, you will design, execute and implement cutting edge analytical solutions to institutionalize data driven insights and recommendations bringing customer strategies to life. The ideal candidate is an enthusiastic and entrepreneurial individual who has experience working with large datasets, is comfortable working with a variety of stakeholders and loves solving complex business problems through data and analytics.\nAs an Associate, you will:\nCollaborate with business stakeholders to design analytics strategy & roadmap to drive business outcomes and overcome challenges\nLeverage the global delivery model by working with teams that span across countries to drive value\nSolve complex business problems for organizations, leveraging conventional and new age data sources and applying cutting-edge advanced analytics techniques\nREQUIRED QUALIFICATIONS\nBachelor’s degree\n2 to 4 years’ experience utilizing data science to solve problems\n2+ years’ experience in working with SQL (any variant)\n2+ years’ experience in working with R/ SAS\n1+ years’ experience in working with Python\nWorking knowledge of a Big Data ecosystem, such as, Hadoop M/R, Pig and Hive\nA drive to learn and master new technologies and techniques\nPREFERRED QUALIFICATIONS\nBachelor’s degree in a quantitative field\nMaster’s in Business Analytics, Data Sciences or equivalent\nConsulting background is a plus\nPLEASE NOTE: Candidates must be legally authorized to work in the United States and must not require immigration-related employment benefit now or in the future."}