{"title": "Manager, Data Science", "company": "NBCUniversal", "description": "The Manager of Data Science at NBCU will be an important leader on the NBCU Ad Impact team. This role will focus on two priorities: 1) develop scientifically rigorous methods for full funnel and cross platform measurement of media efficacy, 2) drive revenue growth by demonstrating the value of the NBCU portfolio through data science.\n\nResponsibilities include but are not limited to:\nDevelop advanced statistical and data science methods for measuring the impact of advertising on our linear TV, digital and social media platforms\nBuild cutting-edge AI and machine learning algorithms for multi-touch attribution\nPartner with cross functional teams to develop and deploy state of art full funnel and cross platform attribution solutions for a wide range of industry verticals\nSupport senior sales leadership to maximize yield and hit revenue goals by demonstrating the effectiveness of advertiser spend across the NBCU portfolio\nRespond to client objectives with solutions that tap into NBCU’s vast resources\nMentor junior data scientists and analysts on the team\nQualifications/Requirements\nAdvanced degree in Statistics, Computer Science, Applied Mathematics, Econometrics, Physics or an equivalent quantitative field\nFive years of experience in data science roles at technology companies preferred\nProven expertise in experimental design, causal inference, predictive modeling, machine learning algorithms for multi-touch attribution (deep learning is a plus)\nExpert level proficiency in scientific computing with R and python (tensorflow is a plus)\nStrong proficiency in big data technology, including Hadoop, Hive / Pig, Spark\nHands on experience working with large datasets on distributed data platforms\nExperience in building automated data pipelines using open source solutions preferred\nFamiliarity with modern approaches to TV and digital direct attribution in the media industry\nPrior experience in the ad-tech measurement space preferred\nKnowledge of mobile app tracking technology preferred\nProject management experience working with third party vendor solutions a plus\nCapable of working efficiently and accurately with excellent attention to detail while handling multiple projects in a fast paced, deadline driven environment\nCapable of creative storytelling, data visualization and presentation\nTeam player with strong communication and interpersonal skills\nPrevious people management experience preferred\nMust be willing to work in New York, NY\nSub-Business\nAd Sales Insights and Measurement\nCareer Level\nExperienced\nCity\nNew York\nState/Province\nNew York\nCountry\nUnited States\nAbout Us\nAt NBCUniversal, we believe in the talent of our people. It’s our passion and commitment to excellence that drives NBCU’s vast portfolio of brands to succeed. From broadcast and cable networks, news and sports platforms, to film, world-renowned theme parks and a diverse suite of digital properties, we take pride in all that we do and all that we represent. It’s what makes us uniquely NBCU. Here you can create the extraordinary. Join us.\nNotices\nNBCUniversal’s policy is to provide equal employment opportunities to all applicants and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation, marital status, pregnancy, veteran status, membership in the uniformed services, genetic information, or any other basis protected by applicable law. NBCUniversal will consider for employment qualified applicants with criminal histories in a manner consistent with relevant legal requirements, including the City of Los Angeles Fair Chance Initiative For Hiring Ordinance, where applicable."}