{"title": "Data Scientist", "company": "Dow Jones", "description": "By selecting “Apply” above, you indicate you have read and acknowledge the Dow Jones Applicant Privacy Notice and Dow Jones Cookie Policy , including data transfers as described in the Policy.\nJob Description:\nWe are looking for a data scientist to join the Data Science & Analytics team for The Wall Street Journal’s Membership group. In this role, you will lead our efforts in machine learning and product analytics, working on the development and refinement of critical models for our business—including the propensity model behind WSJ’s dynamic paywall. Additionally, you will serve as an evangelist for analytics within our organization and develop metrics for measuring engagement within our products.\nThe role will require a strong understanding of data wrangling, log-level usage data, and production models. You will need strong organization skills, and will oversee the execution of large scale data projects. An interest in best-in-class design and engineering, as well as visualization and storytelling, will also be critical to your success in this role.\nRequirements:\nYou have at minimum bachelor’s degree in information systems, computer science, mathematics, data analytics, data science, or a related quantitative discipline. Applicants with strong technical experience and a professional background in media are also encouraged to apply.\nAt least 2-5 years of experience working in a data-related role is preferred.\nYou have strong coding skills in R and/or Python and understand version control software (git/GitHub).\nYou have a mastery of analytics tools (SQL, Tableau, Adobe/Google Analytics).\nYou are well versed in the fundamentals of statistics and have a working understanding of machine learning algorithms and their applications.\nYou have an entrepreneurial attitude toward work and sweat the details.\nYou have an interest in continued learning and stay well versed in new technologies that can be applied to your work.\nDow Jones , Making Careers Newsworthy\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, protected veteran status, or disability status. EEO/AA/M/F/Disabled/Vets .\nDow Jones is committed to providing reasonable accommodation for qualified individuals with disabilities, in our job application and/or interview process. If you need assistance or accommodation in completing your application, due to a disability, please reach out to us at TalentResourceTeam@dowjones.com . Please put “Reasonable Accommodation\" in the subject line.\nBusiness Area: WSJ MEMBERSHIP GROUP\nJob Category: Sales Ops/Planning/Support Group\nAbout Us\nDow Jones is a global provider of news and business information, delivering content to consumers and organizations around the world across multiple formats, including print, digital, mobile and live events. Dow Jones has produced unrivaled quality content for more than 125 years and today has one of the world’s largest news gathering operations globally. It produces leading publications and products including the flagship Wall Street Journal, America’s largest newspaper by paid circulation; Factiva, Barron’s, MarketWatch, Financial News, DJX, Dow Jones Risk & Compliance, Dow Jones Newswires, and Dow Jones VentureSource.Dow Jones is a division of News Corp (NASDAQ: NWS, NWSA; ASX: NWS, NWSLV).\nIf you are a current employee at Dow Jones, do not apply here. Please go to the Career section on your Workday homepage and view \"Find Jobs - Dow Jones.\" Thank you.\nReq ID: 18133"}