{"title": "Data Scientist, CCM", "company": "Simons Foundation", "description": "Primary Responsibilities\nThe aim of the Center for Computational Mathematics (CCM) is to become a leading international center for the study of applied mathematics, machine learning, signal processing and related fields. Tremendous opportunities exist at the intersection of mathematics, computer science, statistics, and their scientific applications, with the lines between theory, algorithm development and software implementation often blurred. A major goal of CCM is to develop the next generation of simulation and analysis methods and to make them available to the scientific community. The center will also host an array of meetings, workshops and conferences, serving as a focal point for the field internationally.\nAs such, CCM is currently seeking a full-time Data Scientist or Software Engineer (based on experience), reporting to a Research Scientist. The successful applicant will primarily assist in the development and maintenance of CaImAn, the popular open source software package developed in the Flatiron Institute for the analysis of fluorescence microscopy (calcium imaging) neuroscience data. Duties will include optimizing the existing codebase, developing new or incorporating existing algorithms in the codebase, and supporting a large and diverse userbase. Participation in other projects within the CCM is also possible.\nMINIMUM QUALIFICATIONS\nEducation\nB.S., M.S. or Ph.D. in computer science, engineering, mathematics or related technical discipline.\nIdeal Experience\nSeveral years of professional experience with back-end software development\nExperience with analysis of functional fluorescence microscopy data (calcium imaging)\nProficiency in Python\nBackground in linear algebra, high dimensional statistics and machine learning\nExperience with developing and using TensorFlow and/or PyTorch\nExperience in processing high volume data on computing clusters and cloud environments\nFamiliarity with Linux\nRelated Skills & Other Requirements\nKnowledge of software engineering practices for working in groups, including software development life cycles, coding standards, code review and version control systems (Git).\nExpertise in algorithms and data structures\nExperience with C++, QT and GPU programming\nBackground in image processing & computer vision\nTechnical and scientific curiosity\nProfessional communication skills and a demonstrated commitment to customer service\nApplication Materials\nA current CV with complete list of publications and links to software repositories\nTwo (2) names and emails of people who can be consulted for confidential references\nTHE SIMONS FOUNDATION'S DIVERSITY COMMITMENT\nMany of the greatest ideas and discoveries come from a diverse mix of minds, backgrounds and experiences, and we are committed to cultivating an inclusive work environment. The Simons Foundation provides equal opportunities to all employees and applicants for employment without regard to race, religion, color, age, sex, national origin, sexual orientation, gender identity, genetic disposition, neurodiversity, disability, veteran status, or any other protected category under federal, state and local law."}