{"title": "Data Scientist Associate - Workforce Analytics", "company": "JP Morgan Chase", "description": "Human Resources – Workforce Analytics – Data Scientist\nJPMorgan Chase & Co. (NYSE: JPM) is a leading global financial services firm with assets of $2.6 trillion and operations worldwide. The firm is a leader in investment banking, financial services for consumers and small business, commercial banking, financial transaction processing, and asset management. A component of the Dow Jones Industrial Average, JPMorgan Chase & Co. serves millions of consumers in the United States and many of the world's most prominent corporate, institutional and government clients under its J.P. Morgan and Chase brands. Information about JPMorgan Chase & Co. is available at www.jpmorganchase.com.\n\nHuman Resources plays an integral role in designing, implementing, and managing global initiatives across the firm. The functional areas within HR include global Recruiting, Training, Talent and Development, Diversity, Compensation, Benefits, Employee Relations, Technology, Finance, HR Service Delivery, and the Chief Data & Analytics Office.\nWorkforce Analytics (WFA) is the firm’s centralized global HR analytics function, positioned within the HR Chief Data & Analytics Office. WFA applies quantitative methods, technology, and research to people data and people decisions across the firm.\nPosition Overview & Responsibilities:\n\nThis position will focus largely on building tools and applications that apply classification modeling and natural language processing to large amounts of text data from a variety of internal and external sources. This individual will report to the Head of Data Science and join a cross-functional data science team that leads some of the most critical projects in HR.\nCandidate Profile\n\nThe ideal candidate will demonstrate skill in client engagement, applied ML and NLP, and creative problem solving. They will possess significant knowledge and experience with natural language processing, particularly text pre-processing, word embedding, and topic modeling. She or he will also be skilled in predictive model development and in communicating technical subject-matter to a variety of audiences.\nBeyond strong programming and modeling skills, the ideal candidate will be innovative, self-motivated, and inclined to create genuine business value through the alignment of technology, data, and business interests.\n\nKey Responsibilities\nPartner with HR, business leaders, and functional groups to gather, manipulate, and explore large datasets, test hypotheses and extract useful insights\nDevelop innovative models, tools and applications that apply NLP and machine learning algorithms at scale\nPartner with other data scientists and data engineers on the team and in aligned support functions to deploy ML and NLP models as integrated data products\n\nRequirements\n\nB.S. in Computer Science or a quantitative field preferred\n2+ years of professional experience in a related field desired\nSignificant Python programming experience required\nFamiliarity with NLP, classification modeling, and network analysis preferred\nStrong communication skills and a team-oriented attitude"}