{"title": "Data Scientist, Media and Advertising Analytics", "company": "Spotify", "description": "We are looking for a Data Scientist, Media and Advertising Analytics to join Spotify’s Advertising Research and Measurement team. Our mission is to turn terabytes of data into insights, and get a deep understanding of the world of music and listeners. Together with us you will study user behavior, evaluate strategic initiatives and experiment with new features. Above all, your work will impact the way the world experiences music.\nWhat you’ll do\nWork closely with cross-functional teams of analysts, designers and engineers who are passionate about Spotify’s success\nAnalyzing the depth and breadth of Spotify’s user, music and podcast data to help drive thought leadership for both our advertising partners as well as publications for Brands @ Spotify\nBuild data pipelines for first party Spotify data, staging data for analysis and reporting\nDeveloping Tableau dashboards for use by the research, measurement and insights teams\nCollaborating with data science, research and engineering teams across Spotify.\nWho you are\nYou know how to understand and solve loosely defined problems and come up with relevant answers and actionable insights\nYou have 3-5 years of relevant experience, with a degree in economics, psychology, social science, statistics, mathematics or another quantitative discipline\nYou have a passion for digital media and advertising and want to uncover new insights to guide the market\nYou have the technical competence to perform advanced analytics: coding skills (Python primarily), experience with analytics tools (Pandas, SQL, Tableau / Tableau Server) and experience performing analysis with large datasets include hosted data architectures (BigQuery/Google Cloud)\nYou have experience building data pipelines for reporting and analytics\nYou are Tableau fluent and can drive production and management of Tableau dashboards for non-technical users\nYou possess statistical competence (such as regression modeling, a/b testing, significance testing etc)\nIt is a plus if you\nhave demonstrated experience with hands-on statistical modeling and possess knowledge about machine learning (such as predictive modeling, decision trees, classification models, clustering techniques)"}