{"title": "Venture Capital Analyst - Data Scientist", "company": "Simon Property Group", "description": "Job Location:\nCorporate New York City\nABOUT SIMON VENTURES\nSimon Ventures is the venture capital affiliate of Simon Property Group (Simon), an S&P 100 company as well as the largest publicly traded real estate investment trust in the S&P 500. Simon Ventures specializes in investing in next generation commerce as well as the retail technologies that power or optimize for those consumer experiences with CB Insights most recently recognizing Simon Ventures as one of the 10 most active investors in retail technology.\nSimon Ventures can serve as a unique investment partner to founders by leveraging Simon's operational platform and access to market distribution channels to impact the slope and velocity of their growth while supporting their continued creative and shareholder control. This service proposition resonates with founders who are looking for a partner that can strategically amplify their abilities to create value and capitalize on unfair market advantage.\n\nPRIMARY PURPOSE\nThe analyst role will be based in New York City. As an analyst you will have an opportunity to learn the venture capital business, including the fundamentals of asset allocation and the process of selecting high quality investments using both quantitative and qualitative analysis to support due diligence efforts, and gain insight into many fascinating startups that are innovating at the intersection of retail and technology. You will also contribute to building an investment platform that is focused on leveraging the best in assets across real estate, technology, brands and social influence to offer a service proposition to founders that is uniquely differentiated for venture capital.\nThe primary role of the analyst is to support the Managing Director, including due diligence and active portfolio management (including assisting and supporting portfolio companies with operational initiatives). Core duties include the following:\nSupporting deal origination efforts, including performing market research relating to investment trends, global market environments and analysis of bench-marking and comparative statistics\nSupporting the Managing Director in a variety of analytic and investment management activities, including running due diligence for potential investments and assisting in the preparation of IC memos and presentations\nWorking with and supporting portfolio companies, including with the activation of any operational initiatives, research projects, competitor analysis, valuation work and board meeting support\nConducting valuation updates and monitoring performance across the existing portfolio\nHelping with the coordination and production of regular reporting for IC review, including quarterly updates and other reports\n\nTHE IDEAL CANDIDATE\nEducation & Experience:\nBachelor’s degree and one to three years of investment banking, finance, investment management, start up or retail operating experience\nDemonstrated ability to execute detailed financial analysis\nProficiency in MS Excel, Word and PowerPoint\nStrong writing skills\nKnowledge Skills and Abilities:\nInterest in next generation commerce and retail technology\nCritical thinker, intellectually curious, detail-oriented and unafraid to ask questions\nDriven to work hard within a high performance environment with ability to work across a number of investments and projects simultaneously, sometimes on tight deadlines\nStrong technical/quantitative skills\nStrong fit within a team oriented, no ego, intellectually curious culture\nStrong interpersonal skills\n#ZR"}