{"title": "Data Scientist / ML Engineer", "company": "PA Consulting Group", "description": "Do you crave a collaborative organization where your contributions will make a strong impact?\n\nDo you want to develop products in the latest cloud-based technologies building ecosystems rather than creating client-facing slides?\n\nAre you ready to roll up your sleeves and embrace a work culture that’s insanely passionate and committed to bringing the latest advanced analytics to life?\n\nThe Data Science & AI group at PA Consulting is your dream community. As part of the fastest growing innovation practice within PA Consulting, you will work with the latest advanced analytics, machine learning, and big data technologies to generate actionable insights from data and develop innovative data products. We focus on Life Science, Healthcare, Energy & Utilities and CPG sectors and work with various data sets, from social media to public health data. Our domain focus is broad and covers everything from computer vision and NLP, recommender engines, classification and clustering algorithms, linear programming and optimization.\n\n\nJob Requirements\n2-5 years professional experience as a data scientist, software engineer or statistical modeler\nMaster’s degree from top tier university in Computer Science, Statistics, Economics, Physics, Engineering, Mathematics, etc.\nExpertise in machine learning algorithms and methods\nStrong understanding and application of statistical methods\nExperience writing production level code in one of the following: Python, Java, C++, C\nPreferred:\nExperience working with database systems (e.g. SQL, NoSQL, MongoDB, Postgres, ect.)\nExperience working with big data distributed programming languages, and ecosystems (e.g. S3, EC2, Hadoop/MapReduce, Pig, Hive, Spark, etc)\nExperience building scalable data pipelines and with data engineering/ feature engineering.\nWebscraping leveraging Beautifulsoup, Selenium, Scrapy, etc\nExperience with front end (UI), HTML5, JavaScript, CSS, R Shiny, Tableau\nExperience leveraging ML techniques to build recommender systems, NLP engines, computer vision algorithms, etc..\n\n\nAbout PA Consulting Group\nBringing Ingenuity to Life: We’re an innovation and transformation consultancy that believes in the power of ingenuity to build a positive-human future in a technology-driven world. Our diverse teams of experts combine innovative thinking with breakthrough-technologies to progress further, faster.\n\nWith a global network of FTSE 100 and Fortune 500 clients, we’ll offer you unrivalled opportunities for growth and the freedom to excel. Combining strategies, technologies and innovation, we turn complexity to opportunity and deliver enduring results, enabling you to build a lasting career.\n\nIsn’t it time you joined us?\nWe are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class. VEVRAA Federal Contractor"}