{"title": "Data Scientist", "company": "VROOM", "description": "Vroom.com is a venture-backed, fast-growing start-up focused on revolutionizing the car buying experience. Our approach is unique in that we recondition pre-owned vehicles to a high standard, sell online, and deliver anywhere across the US. We have experienced tremendous growth in our first 5 years of operation and have become a disruptive force in the automotive industry. Vroom is an exciting, accelerating workplace, and there's no better time to join the team than right now.\n\nVroom.com is on a mission to transform the used car market into a modern, online and data-driven industry! We are constantly exploring new ways to improve our car pricing algorithms, to optimize our inventory and merchandising models, and to leverage data to better understand our customers. To help out, we are looking for experienced Data Scientists to join our Data Science and Analytics Team. The ideal candidates will be looking to apply their passion for data and technology to drive business-critical decisions. This is a role with high visibility into the business and with strong potential for growth within the company.\nResponsibilities\nOwn end-to-end data workflows and develop deep domain expertise on the underlying actors and behaviors manifested through data\nImplement and validate predictive models and create and maintain statistical models to optimize inventory and with a focus on the used car market pricing, vehicle attributes and demand indicators\nIdentify standard and novel data sources to assess consumer-related demand levels and other market indicator\nAcquire, organize and leverage insights derived from that data\nCollaborate with data engineers to rapidly deploy newly developed models\nDevelop and maintain ETL pipelines to optimize the integration and the use of all available data sources\nPropose solutions and strategies to business challenges\nQualifications\nStrong and demonstrated technical skills and a desire to continue to expend on those skills\nA quantitative/technical/analytics education (Masters/PhD in a quantitative discipline preferred)\nContemporary data engineering / data science technical skills (e.g. SQL, R, Python) and a desire to try out the cutting edge\nExperience in supply chain planning, demand modeling, inventory optimization, and/or AdTech technology and industry preferred\nProficiency in applying statistical/machine learning methods in the real world\nBenefits\n\nThis full-time role offers competitive compensation; health, dental, and vision insurance through United Healthcare; a 401k plan; fully company-paid short term disability, long term disability, and life insurance; access to a healthcare concierge service with virtual visits; and 15 annualized days of paid vacation.\n\nBut our biggest benefit is being part of a low-ego, high performing team that's transforming the used car market into a modern, online and data-driven industry. We are looking for people who want to be a part of a contemporary startup culture. What gets us out of bed is working with talented people on a mission that matters.\n\nTo Apply\n\nIf you think you might be who we’re looking for, apply below with your resume and a cover letter telling us why you think you’d be a great addition to the team."}