{"title": "Senior Data Scientist – Customer Support Experience", "company": "Spotify", "description": "We are looking for a Senior Data Scientist to join the Customer Support Product Insights team in our Premium Mission. The Premium Insights team consists of 20+ highly motivated and extremely friendly individuals, specialising in both Data Science and User Research, leveraging their skills to build a holistic understanding of our Premium users.\nAs part of our team you will study user behaviour, strategic initiatives, product features, and more bringing data and insights into every decision we make. Your work will impact how we think about our users, our ability to identify and satisfy their needs, and create compelling customer support offerings and experiences informed by those needs..\nThis is a highly impactful role where you and the rest of the team will be able to directly impact how millions of Spotify users are supported around the world.\nWhat you’ll do\nPerform analyses on data sets to extract actionable insights that will help drive decisions for our customer support experiences\nWork on larger ‘user-understanding projects’ to inform the direction of the user experience\nWork end-to-end on projects to ensure your findings are executed, tested and communicated in the desired way\nWork closely with cross-functional teams of product owners, engineers, marketers, designers, user researchers, business stakeholders and others across the company who are passionate about Spotify’s support experiences and success\nWork from our New York office and be willing to travel internationally\nWho you are\nYou have 5+ years experience in a hands on role\nYou have the technical competence to perform more advanced analytics\nCoding skills (such as Python, R or similar)\nAnalytics tools experience (such as SQL, Pandas, R, Spark or similar)\nData visualisation tools (such as Tableau, Qlik Sense, matplotlib, ggplot2 or similar)\nYou have extensive experience performing analysis with large datasets\nYou have experience designing, monitoring and analyzing A/B tests or other methods of causal inference\nYou are a self-driven person who’s capable of tackling loosely defined problems\nYou are a communicative person that values building strong relationships with colleagues and stakeholders and have the ability to explain complex topics in simple terms\nYou’re capable of mentoring more junior data scientists to set them up for success\nYou thrive in a fast-paced, dynamic and high energy environment and are comfortable with ambiguity"}