{"title": "Data Scientist, Advertising", "company": "Amazon.com Services, Inc.", "description": "MS with 2+ years of industry experience or Bachelors with 5+ years of experience in Quantitative field (CS, ML, Mathematics, Statistics, Physics)\n3+ years of experience with data querying languages (e.g. SQL), scripting languages (e.g. Python), or statistical/mathematical software (e.g. R, SAS, Matlab)\nExperience in creating data driven visualizations to describe an end-to-end system\nHighly skilled in data and math/statistical methods (i.e. modeling, algorithms)\nEvidence of using of relevant statistical measures such as confidence intervals, significance of error measurements, development and evaluation data sets, etc. in data analysis projects\n\nAmazon is investing heavily in building a world class advertising business and we are responsible for defining and delivering a collection of advertising products that drive discovery and sales. Our products are strategically important to our Retail and Marketplace businesses driving long term growth. We deliver billions of ad impressions and millions of clicks daily and are breaking fresh ground to create world-class products. We are highly motivated, collaborative and fun-loving with an entrepreneurial spirit and bias for action. With a broad mandate to experiment and innovate, we are growing at an unprecedented rate with a seemingly endless range of new opportunities.\n\nMajor responsibilities include:\n\nTranslate / Interpret:\nTranslate business questions and concerns into specific quantitative questions that can be answered with available data using sound methodologies. In cases where questions cannot be answered with available data, work with engineers to produce the required data.\nMeasure / Quantify/Expand\nRetrieve, synthesize, and present critical data in a format that is immediately useful to answering specific questions or improving system performance.\nAnalyze historical data to identify trends and support decision making.\nImprove upon existing methodologies by developing new data sources, testing model enhancements, and fine-tuning model parameters.\nProvide requirements to develop analytic capabilities, platforms, and pipelines.\nApply statistical or machine learning knowledge to specific business problems and data.\nExplore / Enlighten\nFormalize assumptions about how our systems are expected to work, create statistical definition of the outlier, and develop methods to systematically identify these outliers. Work out why such examples are outliers and define if any actions needed.\nGiven anecdotes about anomalies or generate automatic scripts to define anomalies, deep dive to explain why they happen, and identify fixes.\nMake Decisions or Recommendations\nBuild decision-making models and propose solution for the business problem you defined\nConduct written and verbal presentation to share insights and recommendations to audiences of varying levels of technical sophistication.\nUtilize code (python or another object oriented language) for data analyzing and modeling algorithms\n\nDepth and breadth in quantitative knowledge. Excellent quantitative modeling, statistical analysis skills and problem-solving skills. Sophisticated user of statistical tools.\nExperience processing, filtering, and presenting large quantities (Millions to Billions of rows) of data\nCombination of deep technical skills and business savvy enough to interface with all levels and disciplines within our customer’s organization\nDemonstrable track record of dealing well with ambiguity, prioritizing needs, and delivering results in a dynamic environment\nExcellent verbal and written communication skills with the ability to effectively advocate technical solutions to research scientists, engineering teams and business audiences\nAbility to develop experimental and analytic plans for data modeling processes, use of strong baselines, ability to accurately determine cause and effect relations\nDemonstrable track record of dealing well with ambiguity, prioritizing needs, and delivering results in a dynamic environment\nExperience in advertising is a plus\n\nAmazon is an Equal Opportunity-Affirmative Action Employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation"}