{"title": "Data Scientist, Forecasting", "company": "Spotify", "description": "We seek an exceptional Data Scientist to join our Forecasting team in New York. This individual will contribute to the development of cutting-edge models to predict Spotify’s future user growth and content consumption. The output of your models will serve as the basis for the company’s financial forecast as well as provide context for business performance to both internal and external stakeholders. Your work will also help the team create a time series forecasting infrastructure that can be leveraged throughout the company. Above all, you will be at the nexus of data science and business at one of the most innovative companies in the world.\nIn addition to possessing strong technical background of their own, the ideal candidate will be a natural communicator who is able to explain complex statistical frameworks to business and engineering teams in both New York and Stockholm. We also have a strong preference for candidates with experience in analyzing and forecasting time series. Accompanying this broad set of responsibilities is exposure to many functional areas, as well as senior management, across Spotify.\nWhat you’ll do\nSupport the production of Spotify’s public-facing user growth estimates on a quarterly basis.\nDevelop scalable solutions for forecasting Spotify’s growth and work closely with Data Engineering to put your solutions into practice.\nConsult with functional analytics teams tasked with building predictive frameworks for their discrete business units.\nVisualize time series data in intuitive ways for a non-technical audience.\nContribute to a machine learning framework to measure and predict Spotify user lifetime value metrics.\nSupport Finance leadership with research on key business initiatives and challenges.\nWho you are\nDegree in Computer Science/Engineering, Mathematics, Statistics, Economics, Econometrics, or another quantitative field.\nMinimum 3 (5+ preferred) years of relevant experience, particularly in forecasting time series using Python, SQL, Scala, and/or R.\nExperience with feature engineering for machine learning models.\nKnowledge of Google BigQuery and Java/Scala is a plus.\nComfort operating independently in a fast-paced work environment.\nWe believe that everyone should enjoy their job, so we live by a work hard, play hard ethos. Spotify is a positive, fun, high-energy work environment that you’ve always wanted to be part of!"}