{"title": "Data Scientist", "company": "S&P Global", "description": "Discover insights and identify opportunities through the use of statistics, algorithms, data mining and visualization techniques\nBuild and evaluate models, make predictions, gather results, and communicate findings to stakeholders\nUse advanced business knowledge and advanced machine learning techniques to acquire, combine & transform multiple datasets to solve a business use case\nCollaborate with engineering and product teams to create and build strategic models that drive product improvements while maintaining cost efficiency\nHelp in building and maintaining re-usable machine learning and model validation procedures for the rest of the team to use\nExperience and qualifications:\nBachelor’s Degree in Mathematics, Statistics, Computer Science, Engineering, Operations Research or related fields preferred (Master’s degree an advantage)\n2+ years practical experience with statistical analysis and creating complex models, preferably in the financial services sector\nExcellent analytical and problem solving skills\nAdvanced experience in at least one data analysis/data transformation package (R, Python, Alteryx)\nExposure to one or more data discovery, data visualization tools\n2+ years of hypothesis testing, web analytics and python scripting\nExperience with Machine Learning\nAbility to remain focused and to think logically in a fast-paced environment\nGrade 10 (For Internal Purpose)\nTo all recruitment agencies: S&P Global does not accept unsolicited agency resumes. Please do not forward such resumes to any S&P Global employee, office location or website. S&P Global will not be responsible for any fees related to such resumes.\nS&P Global is an equal opportunity employer committed to making all employment decisions without regard to race/ethnicity, gender, pregnancy, gender identity or expression, color, creed, religion, national origin, age, disability, marital status (including domestic partnerships and civil unions), sexual orientation, military veteran status, unemployment status, or any other basis prohibited by federal, state or local law. Only electronic job submissions will be considered for employment.\nIf you need an accommodation during the application process due to a disability, please send an email to: EEO.Compliance@spglobal.com and your request will be forwarded to the appropriate person.\nThe EEO is the Law Poster http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdfdescribes discrimination protections under federal law."}