{"title": "Senior Machine Learning Engineer / Data Scientist", "company": "Meet Sally", "description": "We’re looking for an experienced machine learning engineer or data scientist to join our small team of talented engineers and data scientists and play a major role in shaping an exciting platform.\nResponsibilities\nLead development efforts of key features\nPartner closely with data scientists and product managers to develop algorithms and drive key product or modeling decisions\nResearch the best metrics and experiment design to measure models performance\nPresent your research and insights to all levels of the company, clearly and concisely\nYour profile\nExpert programming experience with a scripting language such as Python (preferred)\nDeep understanding of modern machine learning techniques and their mathematical underpinning, such as classification, recommendation systems and natural language processing\nExperience in deploying and scaling machine learning algorithms into production environments\nStrong SQL skills\nProficiency with a statistical analysis tool such as R or Python\nExperience visualizing data and reporting\nExperience with ETL (Extract-Transform-Load) systems is a plus\nDeep product sense & Self-starter\nProficiency at translating unstructured business problems into an abstract mathematical framework. You are able to make intelligent approximations of mathematical models in order to make them practical and scalable\nAbility to articulate and execute on your practical vision; you are an effective partner who listens well and incorporates others’ feedback and ideas\nRequirements\nDegree in Computer Science, Statistics, Math, Engineering, or related disciplines\n3+ years of professional experience in engineering, data science, or related\nProfessional work ethic coupled with sound judgment\nExperience working in rapid growth environment that requires flexibility and continuous innovation\nAble to roll up your sleeves to do what is needed in urgent situations while maintaining a big-picture view. You are excited about the idea of working with a small team to get the job done, even if you sometimes need to do things that are outside of your direct job description\nAbility to prioritize and handle multiple projects with tight deadlines."}