{"title": "Data Scientist", "company": "Major League Baseball", "description": "Who is likely to renew their season tickets? Or churn? Which fans are likely to upgrade to a package? Or buy again? How do we best communicate with fans and encourage them to attend another game? Which team is a fan's favorite? How do we quantify the strength of that relationship?\n\nMLB is looking for a Data Scientist to join its Analytics team in our New York City office. The Analytics team aggregates data from hundreds of online and offline sources and leverages it to provide insight, better serve fans, and drive growth for the league and its 30 Clubs.\n\nIn this crucial role, you will be responsible for manipulating and analyzing complex, high-volume, high-dimensionality data from a myriad of sources. You will help drive a deeper understanding of MLB's fans, develop and validate predictive models, partner with Data Engineering to deploy them at scale, and collaborate with the Marketing and Product teams and Clubs to drive ticket sales, fan engagement and business impact. You will also have the opportunity to present and share insights with business leads at MLB and the 30 Clubs.\n\nIf you love Data, Baseball, and delivering work that makes an impact, you've come to the right place.\n\nCore Responsibilities\n\nTranslate business challenges into data pipelines & model framework.\nTrain, validate, and tune predictive models around fans' behavior.\nAnalyze, interpret & communicate the results of experiments.\nDeliver business value by translating complex data into meaningful insights.\nEffectively present and explain complex concepts to a non-technical audience.\nQualifications\n\n2-4 years of relevant experience in Data Science\nBachelor's degree or higher in a quantitative field such as mathematics, statistics, computer science, etc.\nA strong foundation in probability, statistics, and algorithm development\nProgramming skills that allow you to be self-sufficient in handling large datasets (Python, SQL, Scala, Java)\nExperience with statistical tools or packages: Python (strongly preferred; specifically with scipy, numpy, scikit-learn etc), R, SAS, SPSS, or Matlab\nExperience programmatically structuring and cleaning data, and not just analyzing highly cleaned data sets\nYou're a self-starter that's highly accountable and will take ownership of delivering your work\nStrong understanding of building models, ability to validate and measure efficacy of models via various metrics, and the knowledge to know what metrics make sense for which situation\nComfort manipulating and analyzing complex, high-volume, high-dimensionality data from varying sources\nExperience with cloud services platforms (Amazon Web Services, Google Cloud, etc.)"}