{"title": "Associate Data Scientist SNKRS", "company": "Nike", "description": "Become a Part of the NIKE, Inc. Team\nNIKE, Inc. does more than outfit the world’s best athletes. It is a place to explore potential, obliterate boundaries and push out the edges of what can be. The company looks for people who can grow, think, dream and create. Its culture thrives by embracing diversity and rewarding imagination. The brand seeks achievers, leaders and visionaries. At NIKE, Inc. it’s about each person bringing skills and passion to a challenging and constantly evolving game.\nNIKE, Inc.'s storytellers, Marketing and Communication sets the brand tone. A creative force of specialists tell Nike’s stories of innovation and sport through advertising, brand strategy, digital engagement and product presentation. Using channels ranging from retail stores to social media, Marketing & Communication teams connect the science and art of Nike innovations to the hearts and minds of athletes around the world.\nJoining us in Nike’s Digital Innovation Studio in New York City, the Associate Data Scientist, SNKRS App will embed themselves within Nike Digital’s SNKRS digital product management team serving as a data and analytics center of excellence. With our strategic focus on the evolution of the digital launch business and strengthening the consumer’s connection within the Nike digital ecosystem, this position plays a key role in driving sneaker culture forward for both Nike and the Jordan Brand.\n\nWe are looking for scientists with tech industry experience to help build our core data products and machine learning and statistical modeling processes. We want someone who loves modeling and writing code, someone who likes to dive in, solve problems, and create premier experiences for Nike consumers.\n\nKey responsibilities:\nUse contemporary data science and analytics methods and tools to derive actionable business insights\nMaster big data fundamentals: gather, clean, and validate large amounts of data on Nike’s cloud platform\nCreate foundational pipelines and repeatable production queries in our data warehouse to analyze large sets of internal data on billions of consumer interactions\nDevelop processes and continuous improvement of core projects through automation and process enhancement\nCreate reports and visualizations of core app features and marketing campaigns to help communicate technical results and concepts to a non-technical audience\nProvide ongoing insights and analysis on consumer engagement, experience, and usage of the SNKRS platform\nContribute to larger consumer statistical modeling and machine learning projects\nManage multiple concurrent projects in fast-paced environment\n\nBA/BS degree required; a focus in statistics, econometrics, applied math, or a quantitative behavioral sciences field strongly preferred\n2+ years’ experience doing quantitative analysis on digital products or digital marketing experiences is a plus\nRequired Skills\nAbility to work in multiple data environments and perform complex joins, data cleaning, and feature creation using SQL or SQL based languages (Hive) is required\nExperience with statistical software, e.g., R or Python\nExperience working with real-world, structured and unstructured data\nExperience with data visualization, e.g., Tableau\nExperience analyzing and manipulating data sets to understand patterns and provide insights\nExcellent communications skills, in particular, the ability to communicate technical content to general audience\nCore mathematical ability to understand and apply state-of-the-art machine learning algorithms and/or statistical modeling\nPreferred Skills\nExperience collecting / creating data when the perfect data don’t exist\nConsumer experience with Nike digital apps (NTC, NRC, SNKRS, Nike App)\nKnowledge of Nike’s physical merchandise and company history\nPassion for Nike sneakers and sneaker culture\n\n\nNIKE, Inc. is a growth company that looks for team members to grow with it. Nike offers a generous total rewards package, casual work environment, a diverse and inclusive culture, and an electric atmosphere for professional development. No matter the location, or the role, every Nike employee shares one galvanizing mission: To bring inspiration and innovation to every athlete* in the world.\nNIKE, Inc. is committed to employing a diverse workforce. Qualified applicants will receive consideration without regard to race, color, religion, sex, national origin, age, sexual orientation, gender identity, gender expression, veteran status, or disability."}