{"title": "Data Scientist, Basketball Integrity", "company": "the NBA", "description": "At the NBA, we’re passionate about growing and celebrating the game of basketball. Through the intensity of the game and the amazing athletic skill of our players, we deliver excitement to hundreds of millions of fans around the world.\nAs a global sports and media business, the NBA is so much more. While Basketball Operations runs the league’s on-court activities, other departments manage relationships with television and digital media partners, develop marketing partnerships with some of the world’s most recognizable companies, oversee the licensing of NBA merchandise, and handle a wide range of responsibilities that drive the NBA’s success.\n\nPosition Summary: The Data Scientist will support the Basketball Integrity Analytics Lead in compiling and analyzing data relating to game play, team and referee trends in conjunction with sports betting data. The position will contribute to efforts to keep all Integrity stakeholders abreast of key analyses undertaken using a variety of reporting and visualization tools.\n\nMajor Responsibility:\nCreate and execute models for flagging anomalous performance, trends etc. that may be consistent with but not necessarily indicative of manipulation\nDesign and undertake secondary checks to understand if the flagged event/trend under investigation is of genuine concern.\nPrepare reports for senior leadership in Basketball Strategy and Analytics as well as related groups within the NBA such as Legal/Security and undertake follow-up analysis as directed\nConduct innovative and original analysis to better understand player and referee performance and incorporate player tracking data and other proprietary data in these models\nUse statistical techniques to better understand salient betting trends and market movements, especially on NBA games across different markets\nWork with technical partners to automate data flows and reduce reliance on manual data development\n\nRequired Skills/Knowledge:\n3+ years of experience in data analytics, ideally related to the sports or gaming industries\nSelf-starter with exceptional problem-solving skills and ability to communicate with a non-technical audience and deal effectively with senior management\nExperience with a database management language (e.g. SQL), scripting languages (e.g. R or Python) and data visualization tool (e.g. Shiny or Tableau)\nApplied knowledge of statistical regression methods and other supervised learning techniques and unsupervised learning techniques (e.g. dimensionality reduction and clustering)\nConfident individual, able to work in a fast-paced environment and manage short term deliverables along with long-term projects. Must exercise good judgement and be able to maintain confidentiality with sensitive projects\n\nEducation: Bachelor's Degree Required; Major in Mathematics, Statistics, Computer Science or related discipline or Master's Degree are preferred\n\nWe Consider Applicants For All Positions On The Basis Of Merit, Qualifications And Business Needs, And Without Regard To Race, Color, National Origin, Religion, Sex, Gender Identity, Age, Disability, Alienage Or Citizenship Status, Ancestry, Marital Status, Creed, Genetic Predisposition Or Carrier Status, Sexual Orientation, Veteran Status, Familial Status, Status As A Victim Of Domestic Violence Or Any Other Status Or Characteristic Protected By Applicable Federal, State, Or Local Law."}