{"title": "Data Scientist", "company": "BNY Mellon", "description": "Summary:\nBNY Mellon Investment Management is one of the world's leading investment management organizations and one of the top U.S. wealth managers. Our business encompasses BNY Mellon's affiliated investment management firms, wealth management organization, and global distribution companies. Our goal is to build and deliver investment and wealth management strategies and solutions to meet our clients’ needs.\nDrawing on deep expertise, we collaborate with our clients to tailor our best ideas and resources to meet their specific requirements. Through our global network we have developed a significant understanding of local requirements. We pride ourselves on providing dedicated service through our teams.\n\nWith extensive experience in anticipating and responding to the investment and financial needs of the world's governments, pension plan sponsors, corporations, foundations, endowments planned giving programs, advisors, intermediaries, individuals and families, and family offices, BNY Mellon Investment Management can help our clients reach their goals.\nThe Role:\nReporting to the Head of Investment Management (IM) Data Solutions, the Data Scientist will lead, design and architect solutions to complex data integration, data science, and automation problems. This is a unique opportunity to join the IM Data Solutions team, a small, multi-disciplinary team that is transforming the way information is created, used, and communicated within BNY Mellon IM. The group works directly with BNY Mellon’s Investment Management companies on strategic projects, creating valuable tools and insights for decision makers across portfolio management, sales, marketing, and other key areas of the business. The Data Solutions team capitalizes on opportunities across business lines using the best tools and practices, like machine learning, econometrics, agile development (scrum/kanban), and modern collaborative data platforms.\nResponsibilities:\nLead data science and/or data engineering projects to support IM Investment Management companies\nUse domain expertise to understand business requirements and design the right solution\nBuild or implement data pipelines, databases, visualizations, and other data tools (hands-on)\nContribute to team in a wide range of technical areas by instituting new practices and staying abreast of the latest technical developments\nTake initiative to contribute to overall team efforts in software development, data science, and technical consulting\nWork closely with Data Engineers to improve processes and enable faster insight-generation from complex datasets\nQualifications\nBA/BS Degree (advanced degrees and/or CFAs are great too)\n5-7 years of general business experience, especially in financial services, asset management, and/or management consulting or similar environments\n2-3 years of hands-on data/coding experience\nProficiency with Python (pandas, numpy, scikit-learn)\nProficiency with query languages, databases, and large datasets\nExperience with modern data pipelines and/or data operating platforms (e.g. Dataiku, Alteryx, Spark)\nStatistical competence\nExperience with machine learning algorithms and techniques\nAble to lead ad-hoc and structured product teams within an agile framework\nExcellent interpersonal skills necessary to accomplish goals through others, including employees, peers, and other function/business areas of the company\n\n\nBNY Mellon is an Equal Employment Opportunity/Affirmative Action Employer.\nMinorities/Females/Individuals With Disabilities/Protected Veterans.\n\nPrimary Location: United States-New York-\nInternal Jobcode: 70125\nJob: Asset Management\nOrganization: IM Infrastructure-HR14826\nRequisition Number: 1913998"}