{"title": "Associate Data Scientist", "company": "Macmillan", "description": "Macmillan Publishers is a global trade book publishing company with prominent imprints around the world, publishing a broad range of award-winning books for children and adults in all categories and formats. Macmillan Publishers is committed to our authors, our employees, and to the environment.\n\nU.S. publishers include Celadon Books, Farrar, Straus and Giroux, Flatiron Books, Henry Holt & Company, Macmillan Audio, Macmillan Children’s Publishing Group, Picador, St. Martin's Press and Tor Books. In the UK, Australia, India, and South Africa, Macmillan publishes under the Pan Macmillan name. The German company, Holtzbrinck Deutsche Buchverlage, includes among its imprints S. Fischer, Kiepenheuer and Witsch, Rowohlt, and Droemer Knaur.\n\nMacmillan Publishers is a division of the Holtzbrinck Publishing Group, a large family-owned media company headquartered in Stuttgart, Germany.\n\nWe are an Equal Opportunity Employer. We are actively seeking job applicants who reflect a broad representation of differences, including race, ethnicity, religion, sex, sexual orientation, gender identity/expression, physical ability, neurodiversity, age, family status, economic background and status, geographical background and status, and perspective. We believe that the best companies reflect the incredible diversity in viewpoints, backgrounds, and identities of the world in their staffs, and are committed to inclusive hiring across departments and levels. The successful candidate for this position will be an employee of Holtzbrinck Publishers, LLC.\n\nPosition Description:\n\n\nAs an Associate Data Scientist, you will play a part in shaping Macmillan’s future, helping it become a more data-driven company. In this role, you will help answer tactical and strategic questions from stakeholders across the company. To do that, you will know/learn how to frame business questions; write statistical code to collect data; extract signals from noise; and communicate quantitative information to a non-technical audience.\n\n\nMajor Responsibilities:\n\n\nBuilds and maintains in a reproducible manner sales and other relevant databases\n\n\nConducts statistical analyses by writing code that draws on millions of rows of data\n\nPresents data in an accessible, often visual way\n\nCommunicates findings to senior management and through regular reporting\n\nCollaborates with publishers, marketing, sales and Data Warehouse departments\n\nIdentifies new and useful data for use in analyses\n\nHelps determine our data strategy by evaluating the impact of various projects\n\n\n\nRequired Skills/Knowledge:\n\n\nBachelor’s degree in a quantitative field (e.g., economics, statistics)\n\n1-3 years of experience\nStrong analytical skills\n\nKnowledge of relevant software packages:\n\n-Statistical programming (e.g., Stata, R)\n\n-Database (e.g., Python, SQL, Cognos)\n\nGood written, verbal and interpersonal skills\n\nSelf-starter"}