{"title": "Data Science Internship - Summer 2020", "company": "Etsy", "description": "Etsy is looking for Data Science Interns to join our Data Science team in Brooklyn, New York. We are committed to advancing the fields around E-commerce by building technologies to help understand our customers and the world. We are seeking individuals passionate in areas such as Machine Learning, Data Mining, Recommender Systems, Information Retrieval, Natural Language Processing, Computational Advertising, Deep Learning and Computer Vision.\n\nOur interns have a chance to create core algorithmic advances and apply their ideas in the dynamic world of E-commerce. Interns could publish their innovations at top tier conferences such as KDD, NIPS, ICML, ICLR, CVPR, ICCV, WWW, WSDM, SIGIR and etc.\n\nThis position is to be based in Brooklyn, New York.\nAbout the Role\nRecommendation and Personalization\nNatural Language Processing and Query Understanding\nImage Processing and Understanding\nText Understanding\nRanking for Search and Ads\nFraud and Abuse Detection\nLarge-scale Machine Learning\nAbout You\nCuriosity and modesty. We are dedicated to learning and constantly improving. We hope you also value things like blamelesspostmortems and have a natural aim to determine how everything works.\nKeeping it real. Etsy’s mission and values are a part of everything we do. We care about how our work affects real people in the community and enjoy opportunities to meet them. We are motivated by this mission every single day.\nPlease note: Resumes without a cover letter will not be considered.\nWhat’s Next\n\nInterested in working with us? Send us a cover letter and your CV or resume explaining why you’d be great for the job. We value your unique talents and point of view, so feel free to tell us what you are all about. And if you write, draw, craft, or contribute to something you’re proud of, we’d love to hear about it.\nAt Etsy, we believe that a diverse, equitable and inclusive workplace makes us a more relevant, more competitive, and more resilient company. We welcome people from all backgrounds, ethnicities, cultures, and experiences. Etsy is an equal opportunity employer. We do not discriminate on the basis of race, color, ancestry, religion, national origin, sexual orientation, age, citizenship, marital or family status, disability, gender identity or expression, veteran status, or any other legally protected status."}