{"title": "Principal Data Scientist", "company": "Walmart eCommerce", "description": "Position Description\n\nA Principal Data Scientist is responsible for collaborating with a business segment to determine long-term vision and provide analytical support and guidance. A Principal Data Scientist analyzes large data sets to develop multiple, complex custom models and algorithms to drive innovative business solutions. Principal Data Scientists work on large project teams in order to provide analytical support and guidance to a large project team (for example, email targeting, business optimization, consumer recommendations, shrink reduction) within Walmart. Principal Data Scientists are the subject matter experts for statistical analysis and modeling for their project team and frequently are responsible for functional team leadership, guidance and mentoring.\nBuild learning systems to analyze and filter continuous data flows and offline data analysis.\nConduct advanced statistical analysis to determine trends and significant data relationships.\nDevelop machine learning models to apply test data algorithms to future data.\nDevelop models of current state in order to determine improvements needed.\nDrives the execution of multiple business plans and projects\nEnsures business needs are being met\nInterpret data to identify trends to go across future data sets.\nLead project teams to develop innovative solutions to drive innovative business solutions.\nLead the implementation of data modeling solutions.\nCombine data features to determine search models.\nScale new algorithms to large data sets.\nTrain algorithms to apply models to new data sets.\nTranslate business needs into data modeling initiatives.\nPromotes and supports company policies, procedures, mission, values, and standards of ethics and integrity\nProvide guidance to cross-functional leadership regarding data modeling possibilities.\nProvides supervision and development opportunities for associates\nResearch new techniques and best practices within the industry.\nReview business strategies to ensure alignment across initiatives.\nValidate models and algorithmic techniques.\nMinimum Qualifications\n\nBachelor of Science and 7 years' data science experience OR Master of Science and 5 years' data science experience or PhD.\nHigh proficiency in data mining, modeling, validation and insight generation.\nExcellent working knowledge of statistics, mathematics and machine learning algorithms.\nHigh proficiency in coding languages, including Python and SQL.\nAbility to work with large data sets. Has sound understanding of big data technology stack.\nAdditional Preferred Qualifications\n\nUnderstanding of cloud computing platforms and large-scale databases\nProven ability to collaborate and work in teams\nExcellent with communications and stakeholder engagement\nData science publications in recognized platforms/journals\nProven ability to lead agile data science sprint projects\nCompany Summary\n\nThe Walmart eCommerce team is rapidly innovating to evolve and define the future state of shopping. As the world’s largest retailer, we are on a mission to help people save money and live better. With the help of some of the brightest minds in technology, merchandising, marketing, supply chain, talent and more, we are reimagining the intersection of digital and physical shopping to help achieve that mission.\nPosition Summary\n\nA Principal Data Scientist is responsible for collaborating with a business segment to determine long-term vision and provide analytical support and guidance. A Principal Data Scientist analyzes large data sets to develop multiple, complex custom models and algorithms to drive innovative business solutions. Principal Data Scientists work on large project teams in order to provide analytical support and guidance to a large project team (for example, email targeting, business optimization, consumer recommendations, shrink reduction) within Walmart. Principal Data Scientists are the subject matter experts for statistical analysis and modeling for their project team and frequently are responsible for functional team leadership, guidance and mentoring.\nBuild learning systems to analyze and filter continuous data flows and offline data analysis.\nConduct advanced statistical analysis to determine trends and significant data relationships.\nDevelop machine learning models to apply test data algorithms to future data.\nDevelop models of current state in order to determine improvements needed.\nDrives the execution of multiple business plans and projects\nEnsures business needs are being met\nInterpret data to identify trends to go across future data sets.\nLead project teams to develop innovative solutions to drive innovative business solutions.\nLead the implementation of data modeling solutions.\nCombine data features to determine search models.\nScale new algorithms to large data sets.\nTrain algorithms to apply models to new data sets.\nTranslate business needs into data modeling initiatives.\nPromotes and supports company policies, procedures, mission, values, and standards of ethics and integrity\nProvide guidance to cross-functional leadership regarding data modeling possibilities.\nProvides supervision and development opportunities for associates\nResearch new techniques and best practices within the industry.\nReview business strategies to ensure alignment across initiatives.\nValidate models and algorithmic techniques."}