{"title": "Data Scientist / Senior Data Scientist – Spotify Free ML", "company": "Spotify", "description": "We’re a team of technologists, product insight experts, designers, and product managers based in New York.\nWe are seeking a Data Scientist or Senior Data Scientist to join our Product Insights team, focusing on the development of our Machine Learning driven experiences and advertiser outcomes. You will help develop innovative solutions around the core problem of getting the right ad to the right user at the right time, while embodying Spotify’s values and taking our users’ best interest at heart.\nWhat you’ll do\nPerform analyses on large sets of data to extract actionable insights that will help drive ML driven product decisions\nDesign and conduct A/B tests to drive iterative improvement to both user and advertiser metrics through efficient experimentation\nCommunicate data-driven insights and recommendations to key stakeholders\nWork closely with cross-functional teams of ML engineers, user researchers, product owners and designers who are passionate about Spotify’s success\nBuild lasting solutions to surface critical data and performance metrics\nHelp us develop our knowledge and practice around the development and evaluation ML driven products\nDevelop individually to continue to grow your impact, and help mentor peers\nWho you are:\nYou have at least 4+years of experience in a similar data science role and a degree in science, computer science, statistics, economics, mathematics, or similar quantitative discipline.\nIdeally you have experience working in an analytics role working with ML functions and have conducted A/B tests, defined metrics and delivered exploratory analysis\nYou have the technical competence to perform more advanced analytics:\nCoding skills for analytics and data extraction (SQL, R, Python, Pandas)\nData visualization (such as Tableau, D3, ggplot, Looker)\nExperience performing analysis with large datasets\nStrong understanding of statistics and machine learning\nYou are capable of tackling very loosely defined problems.\nYou are a communicative person that values building strong relationships with colleagues and stakeholders and have the ability to explain complex topics in simple terms."}