{"title": "Data Scientist", "company": "Butterfly Network", "description": "Job Description\n\nWe are looking for a highly motivated and experienced data scientist to drive data-driven strategy and product decisions. You will be responsible for extracting actionable insights from the usage of our mobile, web and e-commerce apps as well from sales, marketing and manufacturing datasets. The ideal candidate will have experience understanding levers to improve engagement with SaaS products and with boosting conversion for e-commerce flows. The role is anticipated to grow quickly with the company’s success allowing the candidate to build a world-class team.\nAs part of our team, your core responsibilities will be:\nModel lead and customer behavior to direct marketing and sales strategy, e.g. customer segmentation, predict Net Promoter Score, identification of potential churn risk and upsell opportunities.\nAnalyze e-commerce data to identify opportunities to improve conversion. Run A/B testing to test hypotheses and optimize e-commerce platform\nProvide data to inform cloud and mobile app product roadmap. Segment users, design and surface key metrics (e.g user retention), analyze feature usage, identify associations between mobile and web usage,\nIdentify opportunities to improve customer support. Alert on emergent reliability issues based on support interactions, cluster patterns of failure e.g. using NLP, work with manufacturing team to predict issues based on self-test data\nBuild dashboards and presentations to surface insights to leadership\nMake data accessible to the company as a whole with self-service tools and training\n\nQualifications\n\nBaseline skills/experiences/attributes:\nBachelor’s or higher degree in a quantitative field\n3 + years of data science experience\nKnowledge of statistics including hypothesis testing\nKnowledge of supervised and unsupervised ML techniques for data science: clustering, association-rule mining, prediction, anomaly detection\nDeep experience with Python data science ecosystem: pandas, numpy, scipy, Jupyter Notebooks/Labs\nAdvanced SQL user\nAble to create compelling data visualizations, using Tableau or similar tooling\nAble to manage projects with technical and non-technical stakeholders in a fast-paced environment\nKnowledge of data model for source operational systems beneficial (Netsuite, Salesforce, Zendesk)\nIdeally, you also have these skills/experiences/attributes (but it’s ok if you don’t!):\nKnowledge of Git, Airflow and Google Cloud Platform tools\n\nAdditional Information\n\nWe offer great perks:\nFully covered medical insurance plan, and dental & vision coverage - as a health-tech company, we place great worth on our teams’ well-being\nCompetitive salaried compensation - we value our employees and show it\nEquity - we want every employee to be a stakeholder\nPre-tax commuter benefits - we make your commute more reasonable\nFree onsite meals + kitchen stocked with snacks.\n401k plan - we facilitate your retirement goals\nBeautiful office overlooking the Flatiron building in NYC\nThe opportunity to build a revolutionary healthcare product and save millions of lives!\nFor this role, we provide visa assistance for qualified candidates.\nButterfly network does not accept agency resumes.\nButterfly Network Inc. is an E-Verify Company and is an equal opportunity employer regardless of race, color, ancestry, religion, gender, national origin, sexual orientation, age, citizenship, marital status, disability or Veteran status. All your information will be kept confidential according to EEO guidelines."}