{"title": "Data Scientist - Alpha Insights", "company": "Two Sigma Investments, LLC.", "description": "Two Sigma is a different kind of investment manager. Since 2001, we have used data science and technology to derive insights that forecast the future and discover value in markets worldwide. Our team of scientists, technologists and academics looks beyond traditional finance to understand the bigger picture and develop creative solutions to some of the world’s most challenging economic problems. Our work spans across markets and industries, from insurance and securities to private investments and new ventures.\n\nThe Alpha Insights team at Two Sigma is looking for an entrepreneurial data scientist to contribute to its data-driven investment initiatives. Alpha Insights crowdsources the world’s investment insights and through such data creation we are an integral part of Two Sigma investment management process. We interact with people external to the firm to collect and analyze their investment insights through our web and mobile products.\n\nData science in Alpha Insights has 3 missions: (1) make relevant data and metrics accessible to the team (2) perform analyses to guide business and product decisions and (3) build data-driven features that power our products.\n\nYou will take on the following responsibilities:\nDeliver metrics and analyses to all functions within Alpha Insights including product, design, and business units\nWrite ETLs to convert structure/unstructured data into stable data assets\nBuild visualizations to enable team members to extract relevant insights\nApply statistical analysis and exploratory techniques to enable data-driven decision making\nOwn data-driven product components (e.g. ranking and recommendation algorithms)\nYou should possess the following qualifications:\n3-5 years of experience in data analysis or similar role\nMS or PhD in Computer Science, Statistics, Economics or related, quantitative field\nExperience applying statistical methods (distribution analysis, classification, regression, clustering, etc.). Application of these methods to user behavior a plus\nDemonstrated experience highlighting innovation, creativity, and intuition, e.g. the ability to laterally identify other sources of useful information and think 'outside the box'\nStrong data transformation skills (e.g. using Pandas, R,)\nSoftware engineering skills in at least one imperative programming language\nCommunication skills to explain metrics/analyses to members of management, engineering, product and business teams.\nPrior experience in finance is not required\nYou will enjoy the following benefits:\nCore Benefits: Fully paid medical and dental insurance premiums for employees and dependents, 401k match, employer-paid life & disability insurance\nPerks: Onsite gyms with laundry service, wellness activities, casual dress, snacks, game rooms\nLearning: Tuition reimbursement, conference and training sponsorship\nTime Off: Generous vacation, sick days, and paid caregiver leaves\n\nWe are proud to be an equal opportunity workplace. We do not discriminate based upon race, religion, color, national origin, sex, sexual orientation, gender identity/expression, age, status as a protected veteran, status as an individual with a disability, or any other applicable legally protected characteristics."}