{"title": "Senior Data Scientist – Metrics", "company": "Spotify", "description": "The Personalization team makes deciding what to play next on Spotify easier and more enjoyable for every listener. We seek to understand the world of music and podcasts better than anyone else so that we can make great recommendations to every individual person and keep the world listening.\nEveryday, hundreds of millions of people all over the world use the products we build which include destinations like “Home” and “Search” as well as original playlists such as “Discover Weekly” and “Daily Mix.” We’re a team of technologists, product insight experts, designers, and product managers in Boston, New York, Stockholm, and London.\nWe are looking for Senior Data Scientist to join our central research team at Product Insights in our Personalization organization. This team is responsible for developing our capabilities in measuring the performance and impact of our models and features, and developing foundational research knowledge, methods and tools.\nWhat you’ll do:\nWork closely with the team to build lasting solutions to experimentation and attribution modeling\nContribute to the development of the Product Insights function and the wider analytics community at Spotify\nMentor and coach other data scientists\nWork from our offices in New York or Boston\nWho you are:\nYou will have at least 5 years relevant applied experience with a degree or higher (MS/PhD) in economics, psychology, computer science, statistics, or mathematics or another quantitative discipline\nTechnical competence to perform advanced analytics: coding skills (such as R, Python, or Scala), experience with analytics & visualization tools (SQL, Tableau, ggplot/matplotlib or equivalent), and experience performing analysis with large datasets\nYou have strong statistical understanding of online testing methodologies and metric development\nYou are capable of taking on loosely defined problems and translating complex thinking into practical application for diverse audiences\nYou are a communicative person who values building strong relationships with colleagues and partners and enjoys mentoring and teaching others"}