{"title": "Data Scientist", "company": "DataDog", "description": "About Datadog:\nWe're on a mission to build the best platform in the world for engineers to understand and scale their systems, applications, and teams. We operate at high scale—trillions of data points per day—providing always-on alerting, metrics visualization, logs, and application tracing for tens of thousands of companies. Our engineering culture values pragmatism, honesty, and simplicity to solve hard problems the right way.\n\nThe team:\nThe Internal Analytics Platform team’s mission is to provide all teams at Datadog with data and analytics about our business, operations and product usage.\n\nThe opportunity:\nAs a Data Scientist for the Internal Analytics Platform team, you will be working on problems that have a strong data engineering component where scale is a major factor. You can expect the position to be a split of between 60% data engineering and 40% model building and quantitative methods.\n\nYou will:\nCreate predictive algorithms for improving operations around the company and increasing product engagement\nApply machine learning and other quantitative methods to revenue and growth metrics\nConduct A/B testing for new designs and products to drive engagement and improve discoverability in our application\nUtilize quantitative methods to improve our marketing automation and audience segmentation\nCollect data from a wide range of sources: AWS S3, Redshift, PostgreSQL, and various APIs\nBuild data analytics pipelines using Spark, Luigi, and other open-source technologies, with programming languages like Scala, Python, and SQL\n\nRequirements:\nYou have experience with tools such as Luigi, Spark, Scala, Python, Pandas, and Redshift\nYou have 2+ years of work experience in building production data engineering pipelines\nYou have backend programming experience in one or more languages\nYou have significant experience applying machine learning to real business problems\nYou want to work in a fast, high-growth startup environment and thrive on autonomy\nYou care about code simplicity and performance\nYou have a BS/MS/PhD in a scientific field or equivalent experience"}