{"title": "Data Center Technician", "company": "GTS", "description": "Overview\nGTS is a growing global electronic market maker, powered by combining market expertise with innovative, proprietary technology. As a quantitative trading firm continually building for the future, GTS leverages the latest in artificial intelligence systems and sophisticated pricing models to bring consistency, efficiency, and transparency to today’s financial markets. GTS accounts for 3-6% of daily cash equities volume in the U.S. and trades over 10,000 different instruments globally, including equities, futures, commodities, foreign exchange and interest rate products. GTS, with more than 150 people on its team, is the largest Designated Market Maker (DMM) at the New York Stock Exchange, responsible for nearly $12.5 trillion of market capitalization and trading some of the world’s best known companies.\n\nAbout the role:\nThe Information Technology team provides and supports the cutting-edge technology infrastructure to the company. Members of the team are focused on continuous learning and seeking ways to constantly evolve and improve the infrastructure. This team collaborates with all areas of the business to provide high quality service delivery, exceptional project management in the most cost-effective manner.\nResponsibilities\nServe as primary point of contact for technical issues related to the Data Center\nWork quickly and efficiently under pressure and in situations of server/hardware failure\nRespond to service tickets and requests for assistance in the Data Center in a timely manner\nWork closely with the customer and IT team to troubleshoot technical issues and determine the most efficient path to solving the problem\nMaintain a well-organized, orderly, clean data center and all associated work areas\nDeal with all hardware associated with the Data Center, including: Rack and stack servers, manage cabling activities, replace network cards, swap hardware\nPlan and execute a Data Center move from start to finish\nFollow and update standard operating procedures to ensure efficient problem solving\nParticipate in all manner of Desktop Support activities as necessary\nQualifications\nDegree in relevant computer-related field (EE, CE, CS, Telecommunications etc.)\nExperience in dealing with problems at the intersection of hardware and software\nStrong troubleshooting and problem-solving skills\nExcellent communication and ability to face off to customers\nStrong attention to detail\nWillingness to travel within the tri-state area\nAbility to lift 50+ lbs\nValid driver’s license and car\nSix or more months of experience working in a data center is preferred"}