{"title": "Data Scientist", "company": "SoftVision - North America & UK", "description": "WE ARE A TRANSFORMATIONAL PARTNER\nWe marry design and engineering language in ways that produce impactful and memorable experience journeys. We partner all the way to continuously improve our clients’ digital maturity. Our Studio network brings the optimal combination of skill, scale, and cost for each stage of the product development lifecycle. And to do this we need great transformational people that want to impact the projects and organizations that they work with.\n\nWe are looking for an exceptional Data Scientist to work with our cross-functional team, and join our world-class community of talented experts. Core to this need are expertise in:\n\nMid to Senior Level Data Scientist with 5+ years of experience in Data Science\nExperience in Banking domain is a plus\nExcellent communication skills\nPerson should be able to lead the entire data science project from\nCoding and executing the project (from model building to model testing to model deployment)\nPresenting regular updates to clients (including updates from exploration)\nExcellent in R or Python\nUnderstanding of Big Data and cloud platforms like (Cloudera Hadoop or Microsoft Azure) is a plus\nIdeally you will also have:\nUndergraduate Degree in Computer Science, Physics or Mathematics (Graduate Degree always is a plus)\n5-10 years experience in Data Science role\nAn Agile mindset with experience working in Agile environment\nA spirit of collaboration and transparent communication\nA natural curiosity for new scripting languages , frameworks and technologies\nHigh personal code/development standards (peer testing, unit testing, documentation, etc)\nWe are a thriving Community of top technology talent that is globally connected. We Engage, Make, Run and Evolve the technology that makes many brands that you know and love. So let’s take this journey together. No matter where you are on your digital career roadmap, we can help you grow and have fun doing it.\n\nPack and move relocation available. Softvision LLC is an Equal Opportunity Employer. No 3rd Party Agency Candidates."}