{"title": "Data Scientist, Engineer", "company": "BAI Communications", "description": "Data Scientist, Engineer - (19000056)\nDescription\nHelp us create better connected futures\nMake your mark. See the difference. Be recognized.\nWork with aligned engaged team members.\n\nAbout us\n\nAt Transit Wireless we create even better connected futures.\nOurs is a story of being big enough to deliver and maintain large-scale operations but being nimble enough to make things happen.\nOur future-makers thrive on rewriting yesterdays rules. So we put Wi-Fi, fiber and wireless connectivity on subways and we create new services for our customers and communities every day.\nWe build technology and teams that people want to be part of and we have the courage to not only imagine, but to do what really matters.\n\n\nAbout the role\nDevelop statistical models to drive key core products for an innovative company in a data rich environment.\nCombine real world intelligence with sensor data to drive actionable insights for our clients.\nDesign and develop efficient and scalable data pipelines between enterprise systems and analytics platform\nWork closely with team and participate in development and deployment of machine learning models and feature engineering pipelines\nProvide technical expertise in the area of design and implementation of Ratings Integrated Data Facility with modern AWS cloud technologies such as S3, Redshift, EMR, Hive, Presto and Spark\nBuild and maintain a data environment for speed, accuracy, consistency and ‘up’ time\nSupport analytics by building a world-class data lake environment that empowers analysts to determine insights into revenue and power products across the organization\nEnsure data governance principles adopted, date quality checks and data lineage implemented in each hop of the data\nBe in tune with emerging trends Big data and cloud technologies and participate in evaluation of new technologies\nEnsure compliance through the adoption of enterprise standards and promotion of best practice / guiding principles aligned with organization standards\n\nAbout you\nDemonstrated ability to distill data-driven insights through informative visualizations & executive level communications\nExperience with geospatial datasets & tool-chains\nExperience designing a measurement strategy to evaluate the performance of complex systems against challenging requirements\nDeep understanding of statistics and/or applied math as basis for choosing techniques & experiments\nAbility to develop D&A related Microservices in mainstream cloud infrastructure\nLead the data science and data engineering team in a cross-functional work environment\nLead/mentor the team to design, develop and maintain D&A solutions\nBS or MS degree in Computer Science or Information Technology\n8+ years of experience as data engineer at an innovative organization\n4+ years of hands-on experience in implementing data lake systems using AWS cloud technologies such as S3, Redshift, EMR, Hive, Presto and Spark\nExpert managing AWS services (EC2, S3, Route 53, ELB, VPC, cloudwatch, Lambda) in a multi account production environment\nExperience With Machine Learning Frameworks, such as TensorFlow, PyTorch, H2O, scikit-learn, Theano, Caffe or Spark MLib is an added advantage\nExposure to R, SparkR, SparklyR or Other R packages is a plus\nExperience in constructing fast data staging layers to feed machine learning algorithms\nExperience in building data APIs to consume analytic model output\nFamiliarity with machine learning model training and deployment process is a plus\nExperience with development frameworks as well as data and integration technologies such as Python, Scala or Informatica\nExpert knowledge of Agile approaches to software development and able to put key Agile principles into practice to deliver solutions incrementally.\nMonitors industry trends and directions; develops and presents substantive technical recommendations to senior management\nExcellent analytical thinking, interpersonal, oral and written communication skills with strong ability to influence both IT and business partners\nAbility to prioritize and manage work to critical project timelines in a fast-paced environment\n\nWhy work with us\n\nWe are a courageous culture and we do what really matters, putting people, customers and communities at the heart of every decision.\nWe believe there is strength in diversity and opportunity through inclusion.\nAnd we provide a learning environment, meaningful recognition for your contribution and competitive compensation.\nHelp us imagine and create what’s next. Join us.\n\nPrimary Location: US-NY-New York\nWork Locations: TW - Transit Wireless, LLC 1350 Broadway 3rd Floor New York 10018\nJob: Product Development\nOrganization: Transit Wireless (USD)\nSchedule: Full-time\nShift: Day Shift\nEmployee Status: Regular\nJob Type: Standard\nJob Level: Individual Contributor\nJob Posting: 17-Sep-19, 9:05:14 PM"}