{"id": 47, "title": "Consultant", "experience": [{"title": "Analyste/Développeur", "description": "Mission : Analyste, Développeur et Intégrateur Web\n\n    N3RD    Projet1 : http://www.paulette-magazine.com/fr/\nPaulette Magazine est le premier magazine féminin 100% participatif dont le site éditorial regroupe plus de 200 000 visiteurs mensuels, 1,9 million de vues et plus de 200 000 fans sur les réseaux sociaux.\n    Durée: 8 mois\n\n    Taches:\n\n    *    Conception de bases de données pour les différents modules à implémenter Back-Office et Front-Office. ; \n    *    Rédaction des spécifications fonctionnelles. ; \n    *    Développement et intégration de l'interface administrateur et l'implémentation des modules nécessaires. ; \n    *    Export / Import de nouveaux utilisateurs depuis le backoffice ; \n    *    Développement, intégration du site paulette magazine (Responsive design) et liaison du Back et du Front. ; \n    *    Intégration de la solution de paiement atos dans le site pour la vente des magazines et des abonnements et l'envoie des mails (API native du framework) après la validation du paiement. ; \n    *    Récupération des dernières informationsTwitter via javascript et Ajax. ; \n    *    Maintenance et correction des anomalies et ajout des fonctionnalités sur le site après la mise en ligne.", "duration": 4}, {"title": "Développeur Front-End", "description": "Keyrus    Projet1 : www.camaieu.fr/ - file:///C:\\Users\\saloua\\AppData\\Local\\Microsoft\\Windows\\INetCache\\Content.Outlook\\4GGTLDIE\\www.camaieu.fr\\\n    Intégration, correction et maintenance du site Camaïeu(Responsive), entreprise de distribution textile focalisée sur le segment de la femme.\n    Durée: 4 mois\n\n    Taches:\n\n    *    Installation d'environnement à l'aide de tuto confluence ; \n    *    Minimisation et optimisation du code\n    *    Fixation des bugs HTML et javascript ; \n    *    Minimisation et optimisation du code ; \n    *    Design de nouveaux écrans et/ou améliorer l'ergonomie d'écrans existants ; \n    *    Création / refactoring des templates de page et des feuilles de style CSS ; \n    *    Découpage / optimisation des éléments graphiques ; \n    *    Développement des interactions et des effets visuels ; \n    *    Responsive Design ; \n    *    Intégration duLess pour générer les fichiers styles. ; \n    *    Intégration duGrunt pour compiler, minimiser les fichiers styles et les fichiers JavaScript ; \n    *    Création des Pull-Request et écrire des commentaires en anglais sur les PR et les Tickets\n\n    Environnement technique:\n    Méthode Agile SCRUM, Java EE, Hybris, GIT (sourceTree), XHTML, CSS3, JQUERY, NodeJs, LESS, Grunt\n\n    Projet 2:\n    https://www.grandoptical.com/ https://www.grandvision.com/\n    GrandVision est une entreprise néerlandaise de distribution d'optique.\n    Elle a deux sites: Grandoptical et Grandvision.\n    Durée: 3 mois\n\n    Taches:\n    Il y a deux versions de ce projet:\n    Pour la V1 :\n\n    *    Correction des anomalies Html \t Javascript ; \n    *    Intégration HTML de contenus, des templates des deux thèmes du site ; \n    *    Amélioration des fonctionnalités Exemples : \n    *    Réglage de l'affichage sur Google map des magasins ; \n    *    Correction de l'affichage des infos Bulles des informations associées aux magasins sur le map \n    Pour la V2 :\n\n    *    Découpage de la maquette.\n    *    Refonte totale des deux sites en utilisant :\n    *    La méthodologie BEM du CSS ; \n    *    LESS pour générer et compiler les fichiers styles ; \n    *    Grunt pour générer les fichiers styles, concaténer et minimiserle code javascript\n\n    Environnement technique:\n    Méthode Agile SCRUM, Java EE, Hybris, GIT (sourceTree), XHTML, CSS3, JQUERY, NodeJs, LESS, Grunt\n\n    Projet 3: http://www.keyrus.com/\n\n    C'est un projet interne pour la société Keyrus représentant les activités de toutes ses filières internationales.\n    Durée: 5 mois\n\n    Taches:\n\n    *    Veille technologique sur les modules nodeJs\n    *    Fixation des bugs HTML et Javascript.\n    *    Intégration HTML\n    *    Correction des anomalies ; \n    *    Migration vers la V2 avec le développement des web services (Entièrement Python) et ajout et amélioration des fonctionnalités.\n\n    Environnement technique:\n    Méthode Agile SCRUM, Python 2.7 ,REST, NodeJs, Angular1, XHTML, CSS3, SASS/COMPASS, Grunt", "duration": 77}]}