{"id": 23, "title": "Ingénieur d’études et développement PHP / Symfony", "experience": [{"title": "Développeur Joomla", "description": "PROJETS: Elaboration de Sites Web et Application pour le Groupe BOUJBEL EQUIPE: 2 développeurs REALISATIONS : Le groupe Boujbel est un ensemble de société ayant des activités dans plusieurs domaines (cliniques, hôtels, boisson, pharmaceutique, agroalimentaire …)  Elaboration de quatre sites web pour le domaine de la Chirurgie Esthétique.  Elaboration de deux sites web pour le domaine de l’INVITRO.  Elaboration d’un site web pour le domaine de l’Agroalimentaire.  Développement d’une application desktop pour  la collection des Emails.  Développement d’une application desktop pour la collection des statistiques. Activités récurrentes : Maintenance des sites web (ajout, modification er suppression d’articles, images et vidéos)\nENVIRONNEMENT : C#, MySQL, CMS Joomla, SQL Server", "duration": 25}, {"title": "intégrateur", "description": "DéveloppeurPHP/Symfony2     \n\nPROJET :    Dans Le domaine d'\nIntégration et modification dans la plateform myHolidea.\n    http://voyages.myholidea.be/\n\nEQUIPE :    2 développeurs, 1 CP, 1 intégrateur\n\nREALISATIONS :    *    Comprendre le métier de l'agence de voyage myHolidea,\n    *    Analyse du Cahier des Charges des différents modules supplémentaires \n    de la plateforme myHolidea,\n    *    Maintenance et évolution dans les différents modules ; \n    *    Développement d'un bundle pour la location de voiture.\n\nENVIRONNEMENT :    Symfony2.5, GuzzleBundle, FOSJSRoutingBundle, JQuery, Bootstrap,\n    phpStorm, MySQL, GIT, REST API.", "duration": 120}, {"title": "Développeur PHP/Symfony2", "description": "PROJET 1 :    Conception et Développement de l'application Win-Takwira.\n    www.win-takwira.tn\n\nEQUIPE :    1 Chef de projet et 2 développeurs\n\nREALISATIONS :    *    Développement de la partie FrontOffice destinée aux amateurs de foot \n    pour réserver en ligne,\n    *    Développement de la partie BackOffice destinée aux propriétaires ; \n    *    des terrains de foot pour gérer leurs terrains et clients.\n\nENVIRONNEMENT :    Symfony2.4, JQuery, Twig, PHP5,    NetBeans, SVN, VisualSVNServer,\n    Scrum\n\nPROJET 2 :    Conception et Développement de l'application Boussole.\n    www.boussole.tn\n\nEQUIPE :    1 Chef de projet et 2 développeurs\n\nREALISATIONS :    *    Développement d'un annuaire d'entreprises en utilisant google maps,\n    *    Développement d'un module permettant de générer automatiquement \n    des sites web dynamiques.\n\nENVIRONNEMENT :    Symfony2.4, JQuery, Twig, PHP5,    NetBeans, SVN, VisualSVNServer,\n    Scrum\n\nPROJET 3 :    Dans le domaine de recherche :\n    Développement d'application de mesure et d'analyse de la Satisfaction d'une\n    population (La méthode MUSA).\n\nEQUIPE :    1 Chef de projet et 2 développeurs\n\nREALISATIONS :    *    Analyse du sujet de la thèse avec le maitre-assistant (le client),\n    *    Recherche de l'algorithme le plus adéquat pour la solution ; \n    *    Conception de l'application en utilisant l'Algorithme Génétique ; \n    *    Développement en Symfony2 sous windows 7 64bits ; \n    *    Obtention d'un résultat satisfaisant avec un taux d'erreur qui tend vers \n    zéro,\n    *    Génération de différents types de chartes graphiques pour les \n    statistiques en utilisant un plugin JQuery,\n    *    Rédaction des documents techniques pour le déploiement de\n    l'application.\n\nENVIRONNEMENT :    Symfony2.3, JQuery, Twig, PHP5,  NetBeans, SVN, VisualSVNServer,\n    Scrum\n\nPROJET 4 :    Développement et déploiement d'une application de Gestion Commerciale et \n    de Facturation\n\nEQUIPE :    1 Chef de projet, 2 développeurs\n\nREALISATIONS :    *    Compréhension du métier de la gestion commerciale : achats, ventes, \n    gestion des stocks en multi-dépôts, gestion des tiers, gestion des \n    gammes de produits, grilles de tarifs personnalisées, facilité de paiement \n    *    Conception de l'application en utilisant la méthodologie UML2 et \n    développement en Symfony 2.\n    *    Tests unitaires et d'intégration sur les différents fonctionnalités devis, Bon \n    de Livraison, Bon de Commande, Facture, Bon de Retour, Bon de\n    Transfert ...\n    *    Formation des clients à distance et sur site. ; \n    *    Maintenance évolutif et correctif de l'application.\n\nENVIRONNEMENT :    Symfony2.3, JQuery, Twig, PHP5,    NetBeans, SVN, VisualSVNServer,\n    Scrum\n\nPROJET 5 :    Développement et déploiement d'une application de Gestion pour\n    Restaurant et Café\n\nEQUIPE :    1 Chef de projet, 2 développeurs\n\nREALISATIONS :    *    Installation de l'infrastructure réseau au sein du café (câble KX106,\n    routeur, écrans tactiles, serveurs d'application).\n    *    Compréhension des différentes fonctionnalités à développer, par \n    exemple : Impression de 3 tickets (barman, préparateur du chicha, client)\n    au même temps dès l'envoi de la commande par le serveur à travers un \n    écran tactile\n\n    *    Formation et support des clients.\n\nENVIRONNEMENT :    Symfony2.3, JQuery, Twig, PHP5,    NetBeans, SVN, VisualSVNServer,\n    Scrum\n\nPROJET 6 :    Développement d'une application de gestion commerciale et production pour \n    menuiserie d'Aluminium\n\nEQUIPE :    1 Chef de projet, 2 développeurs\n\nREALISATIONS :    *    Compréhension du métier de menuiserie d'Aluminium.\n    *    Développement d'une application Desktop Multi-dépôt en C  .NET . ; \n    *    Création des DEVIS à travers l'application composés par des Produits ; \n    *    Création des Produits à travers l'application composés par des Articles \n    en utilisant la quantité, le type ainsi que la formule pour construire le\n    Produit.\n    *    Formation des clients\n\nENVIRONNEMENT :    Microsoft Visual Studio 2010, SQL Server Management 2008, WPF,\n    DevExpress, EntityFramework, C ,SQL Server,Agile.", "duration": 76}, {"title": "Développeur PHP/Symfony", "description": "PROJET :    Conception et développement d'une partie d'un ERP\n\nEQUIPE :    1 Chef de projet, 4 développeurs\n\nREALISATIONS :    *  Développement de la solution web multi-dépôt avec la plateforme\n    Symfony1.4\n    * Conception et développement des différents modules :\n    o Gestion Commerciale (DEVIS, BL, BL RETOUR, Bon de Transfert ...)\n    o Gestion de Paie (Fiche de Paie, Congé ...)\n    o module de Comptabilité (Facture, Suivi Compte Bancaire, Impression\n    Bordereaux Bancaire ...)\n    o Gestion  des camions (Destination  d'un camion, kilométrage, \n    amortissement, entretien du camion, stock dans le camion...)\n    o Gestion des foires. (Stock du foire, date ouverture, date fermeture, \n    emplacement ...)\n    * Exécuter les tests fonctionnels et les tests d'intégration. ; \n    * Formation et support du client.\n\nENVIRONNEMENT :    Symfony1.4, JQuery, PHP5, NetBeans, SVN, VisualSVNServer, Scrum\n\nPROJET :    Encadrement de stagiaires.\n\nREALISATIONS :    *    Préparation du Cahier des Charges\n    *    Conception et développement de l'Application de Gestion de Control \n    pour les appareils Android.\n    *    Accompagner les stagiaires tout au long de leur projet.\n\nENVIRONNEMENT :    Android, Eclipse, Java", "duration": 3}, {"title": "opérateur", "description": "PROJET    Conception et développement d'un module Pour le Système d'Information\n    SOPHIA (S.Ide Orange Tunisie)\n\nEQUIPE :    1 CP, 2 développeurs\n\nREALISATIONS :    *    Analyse du Cahier des Charges de l'opérateur français Sewan\n    Communication.\n    *    Exploration du Système d'Information SOPHIA utilisé par Sewan\n    Communication et Orange Tunisie.\n    *    Conception et développement d'un module de portabilité des numéros \n    français utilisant le protocole MOP pour le système d'information\n    SOPHIA.(OPA, OPR, OPD)\n    *    Vérification des mises à jour offertes par l'APNF. ; \n    *    Appliquer les différents scénarios spécifiés dans le cahier des tests \n    envoyés par SEWAN Communication.\n\nENVIRONNEMENT :    Python, MySql, SVN, Linux, Agile", "duration": 116}]}