{"id": 27, "title": "Consultant", "experience": [{"title": "Consultant Expert Qlikview", "description": "Organisme public qui a vocation à développer, coordonner et participer à la régulation de la e-santé en France.\nNom du poste occupé : Consultant Expert Qlikview\nMise en place des nouveaux indicateurs de suivi du déploiement de MSSanté et le suivi de l'activité support d'ASIP Santé\nChallenge(s) / Objectifs de la mission\n    *    Développement évolutif pour la mise en place des nouveaux indicateurs de suivi du déploiement de MSSanté. ; \n    *    Mise en place des indicateurs de suivi de l'activité support de l'ASIP Santé\n\nRessources\n    *    1 consultant BI\nTâches\n    *    Définir les nouveaux indicateurs de suivi du déploiement de MSSanté. ; \n    *    Evolution des applications existantes (Extraction, transformation et reporting) ; \n    *    Présentation permanente des indicateurs au consultant chargé du suivi de déploiement de MSSanté afin de vérifier les données. ; \n    *    Définir les indicateurs à mettre en place pour le suivi de l'activité support de l'ASIP Santé. ; \n    *    Définir les sources de données et la structure de données à mettre en place. ; \n    *    Définir la procédure d'extraction des données depuis GRC (Gestion relation Client sous MicrosoftDynamics).", "duration": 119}, {"title": "Consultant DataVisualization ", "description": "Dynamiser la présentation PPT « Comité Mensuel Gouvernance » sous Tableau desktop et mise en place des indicateurs de suivi des tickets HelpDesk.\nChallenge(s) / Objectifs de la mission\n\tRendre dynamique la présentation PowerPoint  de 90 Pages destinée au comité de suivi des projets BI d’Hermès\n\tMise en place des indicateurs de suivi des tickets incidents/demandes de service.\n\nRessources\n\t1 consultant BI\nTâches\n\tRecueil et analyse du besoin auprès du directeur du pôle BI Hermès et directeur du help desk.\n\tDéfinir les maquettes et les modèles de données des deux applications.\n\tRéalisation  de deux applications sous tableau desktop en multi sources (3 sources de données).\n\t Présentation des deux applications aux directeurs du pôle BI et HelpDesk.\n", "duration": 44}, {"title": "Consultant Datavizualisation confirmé", "description": "Cabinet de conseil, expertise en Business Intelligence.\nConsultant Datavizualisation confirmé\nChallenge(s) / Objectifs de la mission \n    *    Formation à l'outil de Datavizualisation Tableau Software.\n\nTâches\n    *    Formation des autres consultants en interne. ; \n    *    Intervention chez nos clients pour évangéliser la solution. ; \n    *    Formation des utilisateurs. ; \n    *    POCS, démonstrations et accompagnement dans l'optimisation de la solution.", "duration": 35}, {"title": "Consultant solution confirmé", "description": "Groupe français de  télévision - https://fr.wikipedia.org/wiki/T%C3%A9l%C3%A9vision  et de  radio - https://fr.wikipedia.org/wiki/Radiodiffusion .\nConsultant solution confirmé\nTMA décisionnelle\nChallenge(s) / Objectifs de la mission\n    *    Maintenance et évolution du système décisionnel de France télévision.\n\nRessources\n    *    6 dont d'un chef de projet et 5 consultants.\nTâches\n    *    Analyse et rédaction des devis pour les demandes métiers. ; \n    *    Spécifications techniques et fonctionnelles des devis validés. ; \n    *    Développement et réalisation des demandes métiers (évolution, correction d'anomalie...).\n\nEnvironnement technique/ fonctionnel / méthodologie\nSAP BO XI 3.1, Genio OTIC 7 .1, TOAD Oracle 12.1, TOAD Sybase 2.1.", "duration": 110}, {"title": "Consultant solution confirmé", "description": "Avant-vente Qlik\nChallenge(s) / Objectifs de la mission\n    *    Développement d'une application RH afin de la présenter à des clients potentiels.\n\nRessources\n    *    2 dont une responsable RH et un consultant.\nTâches\n    *    Définition et choix des KPI.\n    *    Modélisation des KPI.\n    *    Réalisation du script de développement\n    *    Réalisation de l'interface utilisateur\n    *    Réalisation des tableaux de bord et KPI.", "duration": 14}, {"title": "Consultant BI", "description": "Assurer les formations des collaborateurs du groupe Thales.\nConsultant BI Datavizualisation\nMise en place de nouveaux indicateurs dans l'application «Thales ASIRH ».\n\nChallenge(s) / Objectifs de la mission \n    *    Evolution de l'application Thales ASIRH.\n\nRessources\n    *    2 dont un chef de projet MOA et un consultant.\nTâches\n    *    Analyse des besoins et de l'existant. ; \n    *    Réunion quotidienne de suivi des évolutions avec le client ; \n    *    Intégration des nouveaux indicateurs dans l'application de génération des QVD et ensuite dans l'application de restitution. ; \n    *    Tests et mise en quarantaine des données liées à chaque indicateur. ; \n    *    Recette intermédiaire avec le client.\n\nEnvironnement technique/ fonctionnel / méthodologie\nQlikview 11 / Agile intelligence, Fichiers Text, Fichiers Excel, Fichiers QVD,  Méthode Agile Intelligence.", "duration": 52}, {"title": "Consultant BI", "description": "Acteur majeur du logement social à Paris et en proche banlieue.\nEvolution du système décisionnel de Paris Habitat\nChallenge(s) / Objectifs de la mission\n    *    Mise en place d'un nouveau module de gestion des sinistres et planification de plus de 100 rapports.\n\nRessources\n    *    4 dont un chef de projet MOA, deux développeurs Genio et un consultant BI.\nTâches\n    *    Recueil et analyse des besoins. ; \n    *    Mise en place du modèle décisionnel sous PowerAMC. ; \n    *    Création de la base de données décisionnelle. ; \n    *    Création des traitements pour extraire, transformer et charger les données. ; \n    *    Création des rapports avec MyReportBuilder. ; \n    *    Création des diffusions des rapports et un batch de lancement de ces diffusions. ; \n    *    Tests des performances.\n    *    Rédaction d'un guide utilisateur.\n    *    Recette et mise en production.\n\nEnvironnement technique/ fonctionnel / méthodologie\nMyReport Data, MyReport Messenger, MyReportBuilder, Genio, SQLServer 2008, PowerAMC, les bonnes pratiques SCRUM.", "duration": 37}, {"title": "Consultant BI", "description": "Entreprise américaine proposant des études et du conseil pour les industries du médicament et les acteurs de la santé.\n\nConsultant BI\nDéveloppement et maintenance des applications Pharma.\n\nChallenge(s) / Objectifs de la mission \n    *    Conception et évolution des applications Pharmaceutique de suivi des ventes.\n\nRessources\n    *    2 dont un chef de projet MOA et un consultant BI.\nTâches\n    *    Recueil et analyse des besoins. ; \n    *    Recueil et analyse des besoins auprès d'un MOA IMS. ; \n    *    Conception et réalisation d'une application de suivi des ventes d'un laboratoire. ; \n    *    Prise en charge de 4 applications de suivi des ventes et mise en place d'un fichier de paramétrage de chargement des données. ; \n    *    Rédaction d'un USER DOCUMENT pour l'application Data_Pharmanalyser en anglais destiné à des consultants indiens.\n\nEnvironnement technique/ fonctionnel / méthodologie\nQlikview 11, Fichiers Excel Fichiers Text, NPrinting, Méthode Agile Intelligence.", "duration": 91}, {"title": "Consultant BI", "description": "Assurer les formations des collaborateurs du groupe Thales.\nConsultant BI\nDéveloppement évolutif et configuration du serveur Qlikview.\n\nChallenge(s) / Objectifs de la mission \n    *    Evolution, optimisation d'une application de E-Learning et configuration du serveur Qlikview.\n\nRessources\n    *    2 dont un chef de projet BI et un consultant BI.\nTâches\n    *    Participation au Recueil et analyse des besoins. ; \n    *    Participations aux comités de pilotage. ; \n    *    Mise en place d'un script de chargement incrémental des QVD. ; \n    *    Optimisation de l'application de restitution. ; \n    *    Support technique et applicatif.\n\nEnvironnement technique/ fonctionnel / méthodologie\nQlikview 11, Qlikview 9, Fichiers QVD, Méthode Agile Intelligence.", "duration": 55}, {"title": "Consultant BI", "description": "Société française spécialisée dans la vente par correspondance.\nConsultant BI\nMise en place de nouveaux KPI.\nChallenge(s) / Objectifs de la mission \n    *    Conception et mise en place des indicateurs de suivi du stock et des ventes.\n\nRessources\n    *    3 dont un chef de projet MOA, Intervenant anglais et un consultant BI.\nTâches\n    *    Recueil et analyse des besoins.\n    *    Conduite du projet en mode agile. ; \n    *    Analyse de la quarantaine des données de trois sources de données. ; \n    *    Conception et réalisation d'une application d'analyse des ventes et du stock pour surveiller les Ruptures Longues/courtes du stock, suivi des commandes fournisseur par gestionnaire, mesurer la qualité des prévisions et le taux de service, analyser la santé du stock et analyser les ventes web.\n\nEnvironnement technique/ fonctionnel / méthodologie\nQlikview 11, SQLServer 2008 / Agile intelligence, Fichiers Excel, Fichiers QVD, Méthode Agile Intelligence.", "duration": 36}, {"title": "Consultant BI", "description": "Commercialiser les annonces classées et les annonces légales.\nConsultant BI\nPOC\n\nChallenge(s) / Objectifs de la mission\n    *    Réalisation de l'application yield_Analysis et installation de la plateforme QlikView.\nRessources\n    *    2 consultants BI.\nTâches\n    *    Installation et Configuration serveur et publisher ; \n    *    Conception et réalisation d'une application d'analyse des transactions. \nEnvironnement technique/ fonctionnel / méthodologie\nQlikview 11, Fichiers Excel, Méthode Agile Intelligence\nSpécialisé  dans la location de matériel pour réceptions, événement, mariage et décoration.\nConsultant BI\nDéveloppement évolutif de 3 applications.\n\nChallenge(s) / Objectifs de la mission \n    *    Evolution de 3 applications.\n\nRessources\n    *    2 consultants BI.\nTâches\n    *    Participation au recueil des besoins auprès d'un directeur financier. ; \n    *    Développement évolutif d'une application de suivi de l'activité commercial. ; \n    *    Développement évolutif d'une application d'analyse de l'exploitation. ; \n    *    Développement évolutif d'une application de suivi des incidents sur prestations. ; \n    *    Présentation et ajustements des évolutions.\n\nEnvironnement technique/ fonctionnel / méthodologie\nQlikview 11, SQLServer 2008. Méthode Agile Intelligence.", "duration": 120}, {"title": "Consultant BI", "description": "Entreprise est une entreprise développant et commercialisant des bases de données et des logiciels dans le domaine de la santé.\n\nConsultant BI\nDéveloppement Evolutif.\n\nChallenge(s) / Objectifs de la mission \n    *    Evolution et optimisation de deux applications du domaine Pharma et distribution.\nRessources\n    *    2 dont un chef de projet MOA et un consultant BI.\nTâches\n    *    Recueil et analyse des besoins.\n    *    Estimation des charges ; \n    *    Développement évolutif d'une application de suivi des ventes. ; \n    *    Analyse d'impact et Optimisation d'une application du domaine de distribution. ; \n    *    Présentation et ajustement des applications.\n\nEnvironnement technique/ fonctionnel / méthodologie\nQlikview 11, Qlikview 9, SQL SERVER 2008, Méthode Agile Intelligence.", "duration": 63}, {"title": "Consultant BI", "description": "Société de holding.\nConsultant BI\nConception et réalisation d'une application de suivi budgétaire.\n\nChallenge(s) / Objectifs de la mission \n    *    Conception d'une application de suivi budgétaire de La Vigie.\n\nRessources\n    *    3 dont un chef de projet et 2 consultants BI.\nTâches\n    *    Participation au recueil des besoins. ; \n    *    Conception et réalisation d'une application de suivi budgétaire. ; \n    *    Support maintenance applicatif.\n\nEnvironnement technique/ fonctionnel / méthodologie\nQlikview 11, SQLServer 2008, Méthode Agile Intelligence.", "duration": 41}, {"title": "Consultant BI", "description": "Acteur majeur du logement social à Paris et en proche banlieue.\nRéalisation d'un POC.\n\nChallenge(s) / Objectifs de la mission\n    *    POC de migrations des rapports et univers BO vers MyReport.\n\nRessources\n    *    2 dont un chef de projet MOA et 1 consultant BI.\nTâches\n    *    Participation au recueil des besoins.\n    *    Installation de la plateforme.\n    *    Analyse des requêtes BO. ; \n    *    Migration et ajustement des univers BO vers les modèles Myreport. ; \n    *    Réalisation d'une dizaine de rapports sur Myreport.\n\nEnvironnement technique/ fonctionnel / méthodologie\nMyReport 7.0, BO XI3.1, SQLServer2008, Méthode Agile Intelligence.", "duration": 97}, {"title": "Consultant BI", "description": "Acteur majeur du logement social à Paris et en proche banlieue.\nRéalisation de migration.\n\nChallenge(s) / Objectifs de la mission\n    *    Migrations des rapports et univers BO vers MyReport.\n\nRessources\n    *    2 dont un chef de projet MOA et 1 consultant BI.\nTâches\n    *    Installation de la plateforme MyReport. ; \n    *    Analyse et estimation des difficultés des requêtes BO. ; \n    *    Participation aux ateliers de priorisation des tâches. ; \n    *    Migration des univers Business Object. ; \n    *    Elaboration des référentiels de données My Report. ; \n    *    Migration de 170 rapports de BO 6.5 vers My Report. ; \n    *    Tests et validation, assistance à la recette. ; \n    *    Transfert de compétences auprès des équipes DSI. ; \n    *    Documentation.\n\nEnvironnement technique/ fonctionnel / méthodologie\nMyReport 7.0, Oracle10g, SAP BO 6.5, SAP BO XI3.1, Méthode Agile Intelligence.", "duration": 93}, {"title": "Ingénieur d'études Assistant chef de projet", "description": "Entreprise de Service en Numérique.\nIngénieur d'études/ Assistant chef de projet\nPilotage RH.\n\nChallenge(s) / Objectifs de la mission\n    *    Mise en place des indicateurs de pilotage RH.\n\nRessources\n    *    5 dont un chef de projet et 4 ingénieurs d'études.\nTâches\n    *    Réalisation du Plan Qualité Projet. ; \n    *    Participation aux interviews utilisateurs. ; \n    *    Définition des axes et indicateurs. ; \n    *    Spécifications fonctionnelles et techniques. ; \n    *    Participation aux Développement des rapports et tableaux de bord pour pilotage des ressources humaine dans le secteur public.\n\nEnvironnement technique/ fonctionnel / méthodologie\nTalend (TOS), Business Object, Pléiade NG, Infocentre Pléiade / Scrum.", "duration": 38}, {"title": "Chef de projet junior", "description": "Assure la mise en œuvre des demandes informatique des différents domaines du groupe HSBC.\nChef de projet junior\nPilotage projet.\nChallenge(s) / Objectifs de la mission\n\tPilotage de la mise en place d’un Outil de gestion des demandes métiers.\n\nRessources\n\t2 dont un chef de projet et 1 développeur \nTâches\n\tParticipation à la finalisation du cahier des charges\n\tConduite des réunions d’avancement avec la MOE et le métier.\n\tParticipation à la réalisation du cahier de spécification.\n\tRéalisation des cas de tests.\n\tValidation de l'UAT (User Acceptance Test).\n\tPrésentation de l'application aux RMs et PMs.\n\tLa définition des évolutions fonctionnelles de la release 2 de l'application.\n", "duration": 38}]}