{"id": 43, "title": "Consultant", "experience": [{"title": "Développeur fullstack JavaScript", "description": "XTECH    Projet 1: meinUnterricht.de - https://www.meinunterricht.de/\n    Intégrer l'équipe Dev en tant que développeur frontend pour la création d'un site web d'éducation allemand meinUnterricht.de.\nDurée: En cours (Depuis 5 mois)\n\n\n    Taches:\n\n    *    Travailler dans un environnement Agile suivant la méthode SCRUM. ; \n    *    Utiliser AngularJS comme framework pour créer une application SPA.\n\n    *    Intégrer Angular material comme librairie UI permettant de créer une application web responsive et qui respecte les principes modernes de conception web. ; \n    *    Configurer et développer des tâches Gulp pour l'organisation, la compilation et le packaging des fichiers sources. ; \n    *    Utiliser principalement les technologies AngularJS, Gulp, SASS et HTML.\n\n    Environnement technique:\n    Angular1, Angular material, SASS, Gulp.\n\n    Projet 2:\n    Développer des modules Nodejs pour des projets internes.\n\n    Taches:\n\n    *    Création d'une API REST générique et documentée en utilisant Swagger conformément aux spécifications OpenApi. ; \n    *    Réalisation de présentations en interne sur les nouveaux concepts et features de Javascript.\n\n    Environnement technique:\n    NodeJS, Hapi, Vanilla JS, Docker, Angular1.", "duration": 12}, {"title": "Développeur fullstack JavaScript", "description": "Mission :     Projets : OpenPaas - http://open-paas.org/  /  La Cerise - http://la-cerise.org/\nLINAGORA    Durée: 10 mois\n    *    Membre du groupe R&D et développeur dans l'équipe Social de OpenPaas, la platforme open source professionnelle de collaboration. ; \n    *    Développement d'une application mobile de mobilisation sociale (La Cerise).\n\n    Taches:\n\n    *    Utiliser Express le framework backend de Nodejs pour créer l'API REST, MongoDB pour la sauvegarde des données et REDIS pour le caching. ; \n    *    Développer la partie frontend en utilisant le framework AngularJS. ; \n    *    Implémenter les tests unitaires et midway pour backend et frontend. ; \n    *    Configurer Grunt pour automatiser les tests et compiler les fichiers LESS. ; \n    *    Travailler dans un environnement Agile en mode SCRUM et participer au meeting mensuel avec les équipes OpenPaas.\n\n    Environnement technique:\n    NodeJS, Express, MongoDB, Angular1, Jade, LESS, Grunt, Docker.", "duration": 51}]}