{"id": 9, "title": "Java JEE developer", "experience": [{"title": "Ingénieur d’étude et développement JAVA", "description": "Développement d’une application web d’une entreprise de thermoformage\n                        REALISATIONS :\n                         Développement de la partie front end en utilisant AngularsJS,  Adaptation de la partie back end en utilisant les Web Service.  Rédaction de la documentation technique.", "duration": 33}, {"title": "Ingénieur d’études & développement JAVA", "description": "Associé à l’équipe GAO008 qui gère des applications de sécurité du groupe IT de la BNPP, mon objectif est d’intégrer les applications de l’équipe sur la Plateforme d’Intégration Continue (PIC) en allant de la structuration et mavenization d’une application jusqu’au déploiement automatisé avec ARA (Application Release Automation) sur les différents environnements du DEV au PROD.\n                         Structurer les applications Web Single Sign On (WebSSO) et Référentiel Sécurité Groupe (RefSG) pour respecter les conventions et les conventions BNPP.\n                         Convertir les applications gérées par l’équipe GAO008 pour qu'elles soient sous le format Maven.\n                         Intégrer les applications dans la Plateforme d'Intégration Continue (PIC) en utilisant Git, Maven, Jenkins et Sonar.\n                         Collaborer avec l’équipe ARA pour automatiser le déploiement des applications sur les différents environnements.\n                         Réécriture en Shell des scripts de traitement et de configuration.", "duration": 29}, {"title": "Formateur JAVA / J2EE", "description": "Formateur dans le centre de formation ADAMING de Lille, des développeurs juniors sur les technologies JAVA/JEE en plein temps. La formation devait se terminer par la réalisation d’un une application web pour gérer un compte bancaire.\n                         Présentation des concepts détaillés ci-dessous avec le développement des projets pour chaque partie.\n                         Java : les bases et les concepts avancés : collection, design patterns, ...  Servlets, JSP et EJB3\n                         Design patterns\n                         Struts2 et le modèle MVC2\n                         JSF2\n                         Développement des interfaces graphique avec JSF2 et la librairie primeFaces et richFaces.\n                         JDBC, Persistance, JPA et Hibernate.\n                         Injection de dépendance : illustration sous EJB3 et Spring\n                         Administration d’un serveur d’application (Wildfly) et configuration du\n                        datasource.\n                         Administration du serveur web tomcat et le déploiement d’une application\n                        web par IHM.", "duration": 101}]}