{"id": 18, "title": "Ingenieur etude et developpement", "experience": [{"title": "Formateur JAVA J2EE", "description": "PROJET :    Formateur dans le centre de formation ADAMING de Lille, des développeurs \n    juniors sur les technologies JAVA/JEE en plein temps. La formation devait se \n    terminer par la réalisation d'un une application web pour gérer un compte \n    bancaire.\n\nREALISATIONS :    *    Présentation des concepts détaillés ci-dessous avec le développement \n    des projets pour chaque partie.\n    *    Java : les bases et les concepts avancés : collection, design patterns, ... ; \n    *    Servlets, JSP et EJB3\n    *    Design patterns\n    *    Struts2 et le modèle MVC2\n    *    JSF2 ; \n    *    Développement des interfaces graphique avec JSF2 et la librairie\n\n    primeFaces et richFaces.\n    *    JDBC, Persistance, JPA et Hibernate. ; \n    *    Injection de dépendance : illustration sous EJB3 et Spring ; \n    *    Administration d'un serveur d'application et configuration du \n    datasource. \n    *    Administration du serveur web tomcat et le déploiement d'une application \n    web par IHM.\n    *    XML : les bases, la syntaxe, les enjeux, CSS, XSL, DTD et Schéma XML,\n    JDOM.\n    *    Communication sous java : sockets et RMI ; \n    *    Les web services SOAP, REST, WSDL, JAXB, Jersey, Jackson. ; \n    *    SQL, JPQL, Criteria ; \n    *    Spring-core, Spring-Boot, Spring-Data, Spring-Security, Spring-MVC ; \n    *    Développement de projets `Application Web' :\n    Backoffice en Spring et Front-office avec JSF2, JSP et AngularJS\n    IHM : AngularJS, HTML5 et Bootstrap\n    *    Qualité logiciel et Qualimétrie : Maven (en ligne de commande), SVN,\n    Jenkins, Sonar\n    *    Junit et les tests unitaires et log4J. ; \n    *    Programmation par aspect AOP (journalisation, calcul de temps\n    d'exécution, mécanisme d'introduction)\n    *    Réalisation d  un Projet de Fin de Formation : Développement d'une\n    application web de gestion des comptes bancaires.\n    Développement d IHM : AngularJS, HTML5 et Bootstrap\n    Utilisation de Spring-Boot pour l'injection de dépendances.\n    Développement de la partie back-end en java\n    Persistance des données avec Spring-Data\n\nENVIRONNEMENT :    JavaJEE, AngularJS, Bootstrap, HTML5, PrimeFaces, Rich Faces, Spring-\n    Boot, Spring-Data, Spring Security, Spring MVC, Spring-core, JPAHibernate,\n    Web Service Rest et SOAP, AOP, Junit, log4J, Maven, SVN, MySQL,\n    Tomcat, Wildfly, Windows", "duration": 108}, {"title": "Ingénieur détudes  développement JAVA", "description": "PROJET 3:    Développement d une application web d une entreprise de thermoformage\n\nREALISATIONS :    *    Développement de la partie front end en utilisant AngularsJS,\n    *    Adaptation de la partie back end en utilisant les Web Service. ; \n    *    Rédaction de la documentation technique.\n\nPROJET 2 :    Développement   une application web une entreprise de thermoformage\n\nREALISATIONS :    *    Analyse du cahier des charges. \n    *    Conception de l'application web en UML en utilisant les diagrammes : de \n    cas d utilisation, de classes, de séquence de systèmes, d interaction et \n    de déploiement.\n    *    Conception de  architecture de l application web : architecture en n-tiers. ; \n    *    Développement de la partie back end avec Spring-core, JPA. ; \n    *    Développement de la partie front end en utilisant xhtml5, Bootstrap. ; \n    *    Rédaction de la documentation technique.\n\nPROJET 1 :    Développement d  un site de E-commerce\n\nREALISATIONS :    *    Analyse du cahier des charges. \n    *    Conception de  application web en UML. ; \n    *    Conception de  architecture de l application web : architecture en n-tiers. ; \n    *    Développement de la partie back end avec Spring-core, JPA. ; \n    *    Développement de la partie front end en utilisant xhtml5, Bootstrap. ; \n    *    Rédaction de la documentation technique.\n\nENVIRONNEMENT :    Java JEE, Junit, log4J, Maven, SVN, UML, AngularJS, Spring core,\n    JPA Hibernate, JPQL, MySQL, Tomcat, Windows, Java JEE, Junit, log4J,\n\n    Maven, SVN, UML, JSF2 PrimeFaces, BootFaces   , Bootstrap, xhtml, Spring \n    core, JPA   Hibernate, JPQL, MySQL, Tomcat, Windows", "duration": 51}, {"title": "Ingénieur d'études & développement JAVA", "description": "PROJET 3:    OPERAS-AXA assurance : Refonte de la totalité des interfaces comptables \n    de la comptabilité auxiliaire d AXA et de ses sociétés sœurs.\n\nREALISATIONS :    *    Maintenance évolutive des applications et des solutions de paramétrage \n    des produits AXWAY.\n    *    Conversion des projets AXA en projet MAVEN\n    *    Développement :\n    En Java des solutions pour assurer  interfaçage entre les produits\n    AXWAY.\n    En Shell  une application de « Backup/Restore » des releases.\n    En Shell de l application qui assure l automatisation du déploiement\n    d'une release.\n    En Shell des scripts contenant des requêtes SQL pour interagir avec \n    la  BDD.\n    *    Livraison et assistance au déploiement des releases sur  environnement\n    User AcceptanceTesting d AXA-assurance.\n    *    Débogage des erreurs durant la phase de livraison. ; \n    *    Utilisation des produits AXWAY : Integrator, SAI, BDI, Sentinel,\n    FlowManager.\n    *    Tests unitaires  d intégration et de validation.\n\nENVIRONNEMENT :    UNIX (Red Hat), Windows, JAVA, Shell, awk, Sharepoint, SVN, SQL-\n    Developper, SQLPlus, VisualStudio, vim, sed, putty, WinSCP.", "duration": 78}, {"title": "reporter", "description": "PROJET :    Conception et développement d'une application pour reporter les portfolios   \n    deals au Depository Trust   Clearing Corporation (DTCC) dans le cadre du \n    projet European Market Infrastructure Régulation (EMIR)\n\nREALISATIONS :    *    Etude et conception détaillée.\n    *    Concevoir l'architecture du logiciel.\n    *    Développement front END avec JSF2.\n    *    Développement Back end avec Spring. ; \n    *    Mise en œuvre la sécurité avec Spring Security. ; \n    *    Déploiement des Services REST.\n    *    Gérer le cycle de vie de projet avec Maven.\n    *    L'intégration continue avec Jenkins.\n    *    Codage et développement de la solution.\n    *    Tests Unitaires.\n    *    Déploiement de la solution.\n\nENVIRONNEMENT :    Java  J2EE, Spring  Core, AOP, Secruity  JSF2,  Oracle, Documentum\n    Maven 3, Tomcat 7, SVN, Eclipse,Jenkins.", "duration": 38}, {"title": "Ingénieur études", "description": "PROJET :    Développement d'un simulateur de déploiement et de dimensionnement des \n    réseaux sans fils maillés basés sur les technologies WIFI IEEE802.11  et\n    WIMAX IEEE802.16 \n\nREALISATIONS :    *    Simulation de différents scénarios de réseaux sans fil avec Network\n\n    Simulator et analyse des traces.\n    *    Développement d'un simulateur en C C++ qui permet le déploiement d'un\n    réseau maillé  mesh  sans fil :\n    *    Proposition,  implémentation et optimisation de deux solutions de \n    déploiement de routeurs mesh.\n    *    Proposition, implémentation et optimisation de trois solutions d'allocation\n    de fréquences.\n    *    Implémentation et optimisation d'une solution afin de réduire les \n    interférences par l affectation optimale des fréquences.\n    *    Implémentation d une solution pour la formation du réseau sans fil dorsal ; \n    *    Développement du module de calcul de débit dans tout l environnement\n    en utilisant le multithreading.\n    *    Implémentation en Java de l'interface homme-machine du simulateur. ; \n    *    Test et validation.\n    *    Formation utilisateurs. ; \n    *    Maintenance corrective et évolutive de  application.\n\nENVIRONNEMENT :    JAVA, Linux, Windows, Shell, standards IEEE, AWK, Matlab, Octave, C C++.", "duration": 28}, {"title": "Ingénieur R D,développeur JAVA", "description": "PROJET :    Conception et réalisation d une station de  télé-opération d un robot par \n    réseau Internet.\n\n\nREALISATIONS :    *    Configuration du serveur web et de la caméra installée sur le site distant.\n    *    Développement de l'application Client portable pour envoyer des \n    commandes au serveur.\n    *    Développement d une application Serveur qui permet de recevoir les \n    données du client, de téléopérer le robot et d'envoyer les données du \n    robot vers le Client via le réseau Internet.\n    *    Programmation réseau en Java : \n    *    Etablir une connexion réseau entre un utilisateur et le serveur en utilisant \n    les sockets TCP et UDP.\n    *    La programmation multithreading en JAVA pour la gestion des tâches \n    concurrentes.\n    *    Développement d une interface graphique de reconstruction virtuelle du \n    robot en 3D, et l intégrer dans l'interface IHM.\n    *    Récupération de la vidéo du site distant et son intégration dans l IHM. ;", "duration": 12}]}