{"id": 48, "title": "Consultant", "experience": [{"title": "Ingénieur étude et développement senior Java/J2EE", "description": "EDELIA    Taches:\n\n    *    Développement d'applications en architecture micro-services. ; \n    *    Développement de batch d'analyse des données avec Spark/Scala. ; \n    *    Rédaction de la conception détaillée des composants. ; \n    *    Accompagnement des équipes de recettes et production pour l'analyse des bugs. ; \n    *    Contribution à la mise en place des meilleurs pratiques de développement autour spring-boot et les micro-services. ; \n    *    Rédaction des livrables, administration des versions.\n    Projet 1 : E.DELIA.\n    Développement des micro-services pour la gestion de la consommation en énergie des clients du groupe EDF.\n    Développement de la brique de sécurité des micro-services.\n    Environnement technique:\n    Spring, Apache Camel, Cassandra, Spark, MySql, GIT, UML, Agile, Scrum, IntelliJ, PlantUml, Jenkins, Sonar.\n\n    Projet 2 : PLATFORME IOT\n\n    Mise en place d'une plateforme pour connecter et gérer des objets communicants.\n\n    Environnement technique:\n    Apache Kafka, Spark, Spring, AWS Lambda, Gatling, Rspec, GIT, UML, Agile, Scrum, IntelliJ, PlantUml, Jenkins, Sonar, AWS, Docker, Cassandra, Mysql ;", "duration": 12}, {"title": "Ingénieur étude et développement senior Java/J2EE", "description": "SOFRECOM\n    Taches:\n    *    Assurance de la maintenance corrective et évolutive de l'application BUSE. ; \n    *    Assurance du support niveau 3 pour les incidents en productions. ; \n    *    Analyse et correction des bugs de production et livraison de patch correctif. ; \n    *    Encadrement et assistance des équipes de développement. ; \n    *    Rédaction des livrables, administration des versions, administration des bases de donnée, installation des serveurs pour le client final.\n\n    Projet 1 : BUSE-STATS\n    Client : ORANGE France\n    Développement de job Hadoop/MapReduce pour le module d'analyse de logs et génération des statistiques \n    Environnement technique:\n    Hadoop, MapReduce, SVN, UML, UP, Scrum, Netbeans\n\n    Projet 2: IMPORT LOGIN\n    Client : ORANGE France\n    Développement d'un batch d'import de données clients dans BUSE.\n\n    Environnement technique:\n    Spring Batch, SVN, UML, UP, Scrum, Netbeans.\n\n    Projet 3: BUSE\n    Client : ORANGE France\n    Maintenance, développement et intégration des évolutions et encadrement de l'équipe de développement.\n    Environnement technique:\n    ApacheCXF, Spring Core, Hibernate, SVN, UML, UP, Scrum, Jonas, MySql, Visual Architect.", "duration": 34}, {"title": "Ingénieur étude et développement senior Java/J2EE", "description": "ARDIA\n    Taches:\n    *    Conception et développement des applications web entreprise. ; \n    *    Définition de l'architecture logicielle des différentes applications, choix des frameworks et technologies utilisés. ; \n    *    Encadrement et assistance des développeurs sur le développement essentiellement sur les taches complexes techniquement et la revue de code. ; \n    *    Rédaction des livrables, administration des versions, administration des bases de donnée, installation des serveurs pour le client final.\n\n    Projet 1 : SERVEUR D'ATELIER\n    Client : Actia Toulouse\n\n    Développement d'une application qui offre des web-services auxquels les différents équipements d'un garage de maintenance se connecte pour avoir les informations sur les véhicules et les différentes prestations qu'ils vont passer durant l'opération de maintenance\n\n    Environnement technique :\n    Apache CXF, WSS4J, Hibernate3, Spring3, Tomcat 7, SVN, UML, UP, Scrum, Netbeans, Tomcat 7, base de données Postgres sql, Visual Paradigm UML, Tomcat 7, base de données Postgres sql\n\n    Projet 2 : Système de gestion des inspections des véhicules\n    Client : Actia Muller\n\n    Etude, conception et développement d'une application de gestion pour les centres de visite technique des véhicules.\n\n    Environnement technique :\n    JSF2, primefaces, primemobile, EJB3, Hibernate3, jasper report, SVN, UML, UP, Scrum, Netbeans, Glassfish 3, base de données Oracle, Visual Paradigm UML, ireport, Glassfish 3, base de données Oracle.", "duration": 5}, {"title": "Ingénieur étude et développement Java/J2EE", "description": "Taches:\n    JAVATECH    *    Conception et développement des applications d'entreprise basée sur l'architecture Java/J2EE en respectant les meilleurs pratiques (design pattern, règles de nommage, intégration continue et suivi du projet).\n    *    Assistance technique et formation chez des clients sur les frameworks de développement J2EE/Web. ; \n    *    La Mise en place d'une plateforme d'intégration continue au sein de la société.\n\n    Projet 1 : Développement de composants GWT\n    Client : VERMEG\n\n    Développement d'un composant permettant le contrôle et la vérification du format des ordres de transfert en affichant les lignes dans une règle avec les limites de chaque champ. Il permet aussi d'éditer le format d'une manière interactive via des drags and drops.", "duration": 46}]}