{"id": 22, "title": "Ingénieur d’études et développement Lead Développeur PHP7 Symfony2/3 ", "experience": [{"title": "Ingénieur d'études et développement PHP5", "description": "PROJET :    Développement et réalisation d'une application Back-office.\n\nEQUIPE :    1 Chef de projet et 2 développeurs\n\nREALISATIONS :    -    Etude des besoins,\n    -    Rédaction des spécifications techniques générales et détaillées ; \n    -    Connexion oAuth avec système OTP (One Time Password) ; \n    -    Accés aux données via une API\n    -    Système de mapping des classes reçues de l'API ; \n    -    Installation des serveurs et Optimisation du code et des performances ; \n    -    Ajout d'un serveur de fichiers (base de données MySQL) ; \n    -    Le Framework Symfony2 est utilisé pour le back-office ; \n    -    Environnement de développement Ubuntu ; \n    -    Utilisation du gestionnaire de templates Twig ; \n    -    Emploi de JQuery ; \n    -    Emploi de l'API Youtube pour la gestion des vidéos ; \n    -    Emploi de la librairie Imagick pour la création des vignettes des images et \n    des pdf,\n    -    Usage de npm et de bower pour la gestion des librairies JavaScript ; \n    -    Utilisation de la librairie javascript CKEditor pour l'édition de contenu en \n    ligne,\n    -    CSS compilés à l'aide de SASS ; \n    -    Utilisation de méthodes agiles pour le cycle de développement ; \n    -    Emploi de phpunit pour les tests unitaires, de phpmd, phpcs pour \n    contrôler la qualité du code, de composer pour la gestion des librairies,\n    -    internes et externes, de grunt pour l'automatisation de la mise en \n    production,\n    -    Développement, tests unitaires\n    -    Réécriture du code pour une V2,\n\nENVIRONNEMENT :    PHP5, MySQL, OTP (One Time Password), Unbuntu, Twig, CKEditor, CSS,\n    JavaScript, JQuery, Symfony2", "duration": 22}, {"title": "Lead Développeur PHP5 / Symfony", "description": "CONTEXTE :    France Media Monde regroupe les rédactions de RFI, France 24 et\n    MonteCario Doualya. Leurs sites sont traduits en une douzaine de langues, \n    incluant entre autres l'arabe, le russe ou le chinois.\n\nPROJET :    Corrections des anomalies et réalisation de nouveaux projets des sites FMM.\n\nREALISATIONS :    -    Etude des besoins, \n    -    Correction des bugs et optimisation des performances ; \n    -    Ajout d'éléments dynamiques (carrousels, pagination) ; \n    -    Intégration des contenus multi-langues ; \n    -    Intégration des vidéos hébergées par Dailymotion sur RFI ; \n    -    Publication sur les réseaux sociaux (Twitter, Facebook, VKontakte pour \n    la Russie),\n\n    -    Installation des serveurs et des postes clients sur le centre de service.\n    Ecriture de scripts,\n    -    Le CMS Drupal6 est utilisé pour le back-office ; \n    -    Environnement de développement Windows et Ubuntu ; \n    -    Utilisation du gestionnaire de templates Twig ; \n    -    Emploi de JQuery ; \n    -    Usage de requireJs pour la gestion du chargement du code JavaScript ; \n    -    Utilisation de la librairie javascript CKEditor pour l'édition de contenu en \n    ligne,\n    -    CSS compilés à l'aide de LESS ; \n    -    Utilisation de méthodes agiles pour le cycle de développement ; \n    -    Emploi de phpunit pour les tests unitaires, de phpmd, phpcs pour \n    contrôler la qualité du code, de composer pour la gestion des librairies \n    internes et externes, de phing pour l'automatisation de la mise en \n    production.\n\nENVIRONNEMENT :    PHP5.5, CSS, JavaScript, JQuery, Symfony2, Drupal6, Windows, Unbuntu,\n    Templates Twing, CKEditor,", "duration": 78}, {"title": "Ingénieur d'études et développement PHP5", "description": "CONTEXTE :    Analyse et résolution d'un problème existant sur une application intranet de\n    PSA.\n\nREALISATIONS :    -    Correction des bugs et optimisation des performances,\n    -    Passage en SFTP du transfert de fichiers entre    les serveurs de\n    l'application,\n    -    Identification de bugs etcorrection.\n\nENVIRONNEMENT :    PHP, Script Shell, JavaScript", "duration": 97}, {"title": "Ingénieur d'études et développement PHP5", "description": "CONTEXTE :    Mises à jour, refontes et migrations des sites du portail Orange.\n\nREALISATIONS :    -    Services Mobiles (http://services-mobiles.orange.fr/),\n    -    DemSA (outil interne) ; \n    -    Orange en France (http://orange-en-france.orange.fr/) ; \n    -    Travel (http://travel.orange.fr/)\n    -    Environnement de développement WAMP ; \n    -    Utilisation du gestionnaire de contenus Magic v5 (propre à Orange) ; \n    -    Emploi de templates XSLT\n    -    Emploi de JQuery ; \n    -    Usage de la librairie Highcharts (javascript) pour la gestion et l'affichage\n    des statistiques, \n    -    Utilisation de la librairie javascript TinyMCEpour l'édition de contenu en \n    ligne,\n    -    Génération de fichiers Excel ; \n    -    Élaboration d'expression des besoins, des spécifications fonctionnelles \n    générales et détaillées,\n    -    Rédaction du cahier des charges et initialisation du projet.\n\nENVIRONNEMENT :    PHP5, MySQL, JAvaScrit (JQuery), Wamp, Magic V5, TinMCE, DemSA,\n    Excel, MagicV5", "duration": 81}, {"title": "Ingénieur d'études et développement PHP5", "description": "CONTEXTE :    Filiale du groupe SOLOCAL (anciennement Pages Jaunes) est spécialisée \n    dans la mise en relation entre particuliers et artisans spécialisés dans les \n    travaux de la maison ou dans la décoration.\n\nPROJET :    Refonte et réalisation de nouveaux projets dessites SOTRAVO\n\nEQUIPE :    8 développeurs, 2 CP techniques, 2 CP fonctionnels\n\nREALISATIONS :    -    Optimisation de la prospection des clients dans l'interface\n    d'administration de Keltravo,\n    -    Refonte du site Déco-Travaux (www.deco-travaux.fr) (Front et Backoffice) ; \n    -    Conception et developpement du système d'opt-ins et de la gestion des \n    contacts sur l'ensemble des sites de SOTRAVO et partenaires (Pages\n    Jaunes : www.pagesjaunes.fr/maison-travaux, MyTF1 : devis-\n    travaux.tf1.fr),\n    -    Publication automatisée sur les réseaux sociaux (Twitter et Facebook) et \n    création d'une API dédiée (REST),\n    -    Conception et développement de l'automatisation du traitement des", "duration": 90}, {"title": "Ingénieur d'études et développement PHP5", "description": "CONTEXTE :    Site intranet pour EDF Bleu Ciel, application web de gestion des boutiques et \n    de leurs campagnes publicitaires.\n    Un gros travail a été effectué sur l'ergonomie (géolocalisation des boutiques, \n    gestion des horaires, des galléries, sélection et affichage des graphiques, \n    time line des campagnes...) pour une utilisation naturelle de l'application.\n\nPROJET :    Maintenance d'un site avec Ruby On Rails et de sites avec ZendFramework\n\nREALISATIONS :    -    Environnement de développement WAMP,\n    -    Réalisé à l'aide du Framework Symfony(1.4)\n    -    Utilisation de JQuery ; \n    -    Emploi de l'API Google Maps pour la géolocalisation des boutiques et\n\n    des banques, stations de transports environnantes, calcul de trajet,\n    -    Usage de la librairie Highcharts (JavaScript) pour la gestion et l'affichage\n    des statistiques,\n    -    module PostGIS intégré à la base de données (gestion des coordonnées \n    géographiques),\n    -    Élaboration de spécifications fonctionnelles générales.\n\nENVIRONNEMENT :    PHP5, PostgreSQL, JavaScript (JQuery), Symfony (1.4), Wamp, API Google\n    Maps, PostGIS,", "duration": 112}, {"title": "Ingénieur d'études et développement PHP", "description": "PROJET :    CEZAR-NG, application web de gestion des incidents survenant dans les \n    gares.\n\n    Dans le cadre d'une refonte de l'application CEZAR (développée en Java, \n    client lourd), de constituer une maquette très avancée du projet.\n\nREALISATIONS :    -    Environnement de développement WAMP\n    -    Utilisation de Jquery ; \n    -    Emploi du gestionnaire de template TWIG (Symfony 2) ; \n    -    Élaboration de spécifications fonctionnelles détaillées.\n\nENVIRONNEMENT :    PHP MySQL, JavaScript, JQuery, Symfony2, Wamp, Twig", "duration": 70}, {"title": "Ingénieur d'études et développement", "description": "PROJET :    DIGIPOSTE.FR, Application web de dématérialisation de courrier (factures, \n    documents importants,) et de stockage sécurisé de donnés.\n    L'application est composée de deux parties IHM. Leur architecture est basée \n    sur le modèle REST : travail pour GFI sur la partie IHM en tant que \n    concepteur/développeur aux cotés de la société AF83\n\nEQUIPE :    14 personnes coté API, 6 personnes coté IHM\n\nREALISATIONS :    -    Environnement de développement LAMP,\n    -    Utilisation de JQuery\n    -    Documentation.\n\nENVIRONNEMENT :    PHP4, MySQL, JavaScript (JQuery)", "duration": 91}, {"title": "Ingénieur d'études et développement PHP5", "description": "CONTEXTE :    Réalisation de sites web en PHP/MySQL avec le Framework Symfony.\n\nREALISATIONS :    -    Animation en JQuery,\n    -    Streaming de vidéos hébergées sur le serveur ou YouTube ; \n    -    Galeries photos\n    -    Boutique en Ligne avec paiement par PayPal\n    -    Diffusion de musique ; \n    -    Cartographie avec Google Maps/Mapstraction ; \n    -    Envoi de mails\n    -    Gestion d'articles et de commentaires ; \n    -    leguepard.net :    Site d'informations sur la Guinée. ; \n    -    flyfeet.fr :    Site de vente d'articles sportifs.\n\n    -    wesley-choir.com :  Site vitrine d'une chorale.\n\nENVIRONNEMENT :    PHP, MySQL, Framework Symfony, Google Maps, Mapstraction", "duration": 47}, {"title": "Ingénieur d'études et développement PHP", "description": "PROJETS: Différentes missions en prestation. REALISATIONS : SFRIngénieur d’études et développement PHP5 (11 mois –juin.09 à avr.10)  Développement et maintenance corrective d’applications intranet concernant la gestion des lignes du réseau SFR professionnel.  Support technique niveau 3 : intervention sur le code,  Création d’outils permettant le contrôle des anomalies : scripts de requetés SQL comprenant des requêtes imbriquées et des procédures stockés (PHP, Scripts SQL) THALES Ingénieur d’études et développement PHP5 (10 mois –d’aout.08 à mai.09) Orchestra suite logicielle destinée à la gestion de projets  Développement de plugins Eclipse,  Base de données Oracle 10g,  Elaboration des spécifications fonctionnelles détaillées,  Recette (Java, Oracle, Eclipse, Base de données Oracle 10G) SOPAC Ingénieur d’études et développement PHP5 (13 mois – de juil.07 à juil.08) « Maintenance d'équipements urbains », application web permettant la gestion des parcs d'équipements des collectivités locales (phase de tests réalisée avec l'agglomération de Cergy-Pontoise).  Développement des modules :  Administration,  Gestion des équipements,  Gestion des interventions,  Statistiques sur les pannes, (PHP, Framework Copix, ProstgreSQL 8.1, JavaScript) PSA Ingénieur d’études et développement PHP5 (1mois–Mai 2007) PALMA : Réalisation de maquettes et dossiers de tests (en équipe de trois personnes)  Développement des modules en PHP (PHP, Framework Copix, ProstgreSQL 8.1, JavaScript) SYLIS Ingénieur d’études et développement PHP5 (22 mois – nov.06 à juil.08) : Réalisation de projets web PHP/PostgreSQL, Ajax sur le modèle MVC au forfait  Création d’un page Web respectant les standards HTML,  Initiation aux feuilles de style CSS,  Gestion des événements JavaScript/Ajax  Recueil des besoins.  Participation aux réunions de travail et comités de projet.  Elaboration des spécifications fonctionnelles.  Réalisation de maquettes.  Développement.  Recette : rédaction de plan de tests, tests unitaires et d'intégration.  Gestion de la mise en production.  Support utilisateur.  Développement des modules en PHP (PHP, PostgreSQL, Ajax, Modèle MVC) GDF-SUEZ Ingénieur d’études et développement PHP5 (8 mois–nov.06 à juin.07): Création et maintenance d’une application Intranet de Logiciels des modules :  Gestion de fiches,  Administration,  Reprise de données de fichiers Excel vers une base de données,  Annuaire des utilisateurs,  Sécurisation de l’accès à l’application", "duration": 73}]}