{"id": 30, "title": "Consultant Talend / Cognos MSBI / Control-M   ", "experience": [{"title": "Ingénieur", "description": "CONTEXTE    IKKS est une marque française de prêt-à-porter, fondée en 1987 qui\n    possède plus de 500 magasins en France et à l'étranger.\n\nPROJET    Mise en place d'une solution BI pour le suivi des indicateurs de ventes et\n    de stocks pour 526 boutiques, d'une dizaine d'usines sur les 5 continents.\n    En autonomie sur la partie ETL Talend et en équipe sur la partie reporting\n\n    Effectif : 1 CP + 4 développeurs\n\nREALISATIONS    Développements :\n    * Construction d'un Data Warehouse afin d'héberger toutes les données \n    provenant des ventes des différents magasins, du stock et de la gestion \n    commerciale,\n    * Modélisation et conception des scénarios à partir des besoins du client ; \n    * Développement ETL pour alimenter le Data Warehouse qui sert de base \n    aux rapports. Cette partie comprend : Le nettoyage des données,\n    l'exécution de toute les modifications (transcodage, intégration des \n    données de différentes sources vers les différentes destinations). \n    * Administration et surveillance des chaînes ETL\n    Reporting :\n    * Participation à l'installation des environnements de Cognos 8.4 et Talend\n    5.2 sous l'environnement de développement, de recette et de production,\n    * Etude des besoins client et rédaction des spécifications techniques et \n    fonctionnelles,\n    * Développement des packages sous Framework Manager (FM) ; \n    * Création des rapports sous Report Studio\n    * Création des cubes OLAP SSAS ; \n    * Génération des rapports SSRS de suivi d'indicateurs des ventes et des \n    stocks,\n    * Assurer le transfert des tâches d'exploitation vers l'équipe Exploitation ; \n    * Gérer les incidents de niveau 2 provenant de l'exploitation\n    Tests :\n    * Développement et recette de l'application ; \n    * Tests unitaires et validation par les équipes ; \n    * Livraison de l'application en recette et en pré prod ; \n    * Rédactions des documentations de transfert de compétences.\n\nENVIRONNEMENT    Talend Enterprise Data Integration 5.2.1, Cognos 84, Shell Linux, Bash,\n\n    PL/SQL, Oracle 10.2, RedHat, Windows, Toad, SQLDevelopper, Report\n    Studio, Framework Manager", "duration": 110}, {"title": "Responsable d'exploitation", "description": "CONTEXTE    Kidiliz Groupe, anciennement Groupe Zannier, est un groupe français de\n    prêt-à-porter positionné sur le marché de la mode enfantine.\n\n    Extension de la mission sur deux nouveaux projets.\n\nPROJETS    Projet 1 : Mise en place d'un nouvel ordonnanceur Control-M 8 dans le SI du\n    groupe.\n\n    Effectif : 1 Responsable d'exploitation + 7 développeurs\n\n    Projet 2 : « Réassort Boréal» : Ce process a pour objet d'assurer la livraison \n    des bons de préparation de livraison en entrepôt le matin. Il met en œuvre \n    une suite d'applications grâce à une série de calculs et d'enchainements de \n    traitements qui interviennent consécutivement à la remontée des ventes de la \n    veille en provenance des boutiques.\n\n    Effectif : 1 CP +  3 développeurs\n\nREALISATIONS    Développements :\n    Projet 1 :\n    * Participation à l'installation de Control-M et de ses agents sur les trois \n    environnements : développement, recette et production sous RedHat /\n    linux / Windows,\n    * Migration des traitements existants vers Control-M sous différents outils\n    (Talend, Crontab, tache Planifier, Backup, PL/SQL, etc..) vers la nouvelle \n    solution d'ordonnancement,\n    * Mise en place du backup des bases de données sous Control-M ; \n    * Traitement des demandes provenant de la MOA en cours du projet ; \n    * Gestion d'une équipe de 8 personnes qui assure la surveillance et\n    l'exploitation du SI du groupe 7/7,\n    * Gestion du planning de l'équipe à l'aide de SharePoint ; \n    * Participation à la rédaction et à l'évolution des procédures d'exploitation\n    mises en place sous wiki et/ou SharePoint,\n\n    Projet 2 :\n    * Rédaction des spécifications techniques détaillées ; \n    * Conception, développement et administration de la chaîne ETL ; \n    * Développement des batchs shell et ordonnancement des chaines ETL ; \n    * Réalisation des tests unitaires et recettes\n    * Mise en place des évolutions correctives,\n\n    Tests :\n    * Développement, recette et tests unitaires de l'application et validation par \n    la MOA,\n    * Livraison de l'application en recette, en pré prod et en prod ; \n    * Rédaction des documentations techniques et fonctionnelles détaillées.\n\nENVIRONNEMENT    Control-M 8, Talend Enterprise Data Integration 5.2.1, Script Shell Linux,\n    PL/SQL, Oracle 10.2, Toad, MSQLServer, Shinken, Nagios, Wiki, Sharepoint", "duration": 102}, {"title": "Ingénieur", "description": "PROJET    Mise en place d'une solution BI pour le suivi des indicateurs de ventes et\n    de stocks pour 900 boutiques en propre, plus que 10000 points de ventes et \n    des centaines d'usines sur les 5 continents.\n\n    En autonomie sur la partie ETL Talend et en équipe sur la partie reporting.\n\n    Effectif : 1 CP + 4 développeurs\n\nREALISATIONS    Développements :\n    * Etude de l'existant et conception de la base Data Warehouse ; \n    * Développement des flux d'intégration de données dans le centre de \n    données de plusieurs applications,\n    * Développement des scripts shell ; \n    * Création des procédures stockées pour des calculs spécifiques ; \n    * Administration et surveillance de la chaîne ETL\n    Reporting :\n    * Participation à l'installation des environnements de Cognos 8.3 et talend\n    5.2 avec ses jobservers sous l'environnement de dev, recette et prod.\n    * Etude des besoins client et rédaction des spécifications. ; \n    * Développement des packages sous Framework Manager (FM) ; \n    * Création des rapports sous Report Studio.\n    * Migration du cognos 8.3 en cognos 8.4 ; \n    * Création des cubes OLAP SSAS et des rapports SSRS de suivi des \n    indicateurs de ventes et de stocks\n    Tests :\n    * Développement et recette des tests unitaires ; \n    * Livraison de l'application en recette et en pré prod ; \n    * Rédactions des documentations techniques détaillées.\n\nENVIRONNEMENT    Talend Intégration Suite 3.2 migrée en 4.2 puis en Talend Enterprise Data\n    Integration 5.2.1 jusqu'à la version 6, Cognos 83 migrée en 84, MSBI (SSAS,\n    SSRS), Script Shell Linux, Bash, PL/SQL, Oracle 10.2, SqlServer, RedHat,\n    Toad, SQLDevelopper, Framework Manager", "duration": 68}, {"title": "Ingénieur", "description": "CONTEXTE    Conception et développement d'une application Business Intelligence.\n\nPROJET    Mise en place et industrialisation de la partie ETL d'intégration de données\n    dans le Data Warehouse.\n    Réalisation d'une interface WEB qui sert à visualiser les différents tableaux \n    de bord,\n\n    Effectif : 2 CP MOA + 1 Team Leader + 3 développeurs", "duration": 117}]}