{"id": 50, "title": "PRODUCT OWNER, GESTION DE PROJET ", "experience": [{"title": "UX designer", "description": ": GRDF : Délégation Transformation Digitale - MOA Digital et Pilotage\ndes outils \n\nContexte\n\nPilotage des outils de transformation digitale utilisés par GRDF qui sont les suivants :\n\n    *    Rapid'site : usine à site pour la création d'un site web par un utilisateur en se basant sur un \n    ensemble de composants à configurer (article, titre, image, formulaire d'inscription,...) avec un \n    workflow (création, validation, personnalisation du contenu, mise en ligne, fermeture). Les \n    statistiques de chaque site sont créées dans Google Analytiques en attribuant un UI à chaque \n    site.\n    *    Rapid'Créa : usine de création de support de communication : flyer, badge, affiche, invitation... ; \n    *    E-Card : outil de génération des cartes de vœux envoyées par GRDF ; \n    *    FluidBook : outil de génération de magazine à partir de PDF\n\nTechnologie\n\nLiferay, Google Analytiques, Mantis\n\nActivités MOA\n\n    *    Proposer des évolutions sur Rapid'site ; \n    *    Proposer et conseiller sur les dispositions des pages et du contenu aux créateurs de site ; \n    *    Recueil du besoin auprès de la DSI, des métiers et différents collaborateurs utilisant le\n    Rapid'site\n    *    Elaboration des spécifications fonctionnelles du besoin en collaboration avec l'UX designer ; \n    *    Définition du backlog produit en collaboration avec le chef de projet ; \n    *    Création de Template de site avec Illustrator ; \n    *    Faire du support utilisateurs niveau 1, 2 et 3 sur les différents outils ; \n    *    Intervenir sur le Back office de l'outil Rapid'site pour l'administration de l'outil ; \n    *    Recette de l'application Rapid'Site\n    *    Reporting des retours dans Mantis ; \n    *    Génération de magazines pour la direction de la communication et du digital avec l'outil\n    Fluidbook\n    *    Publication dans l'Intranet de GRDF des magazines sous format HTML", "duration": 39}, {"title": "Chef de projet MOA", "description": "Contexte\n\nRéalisation d'un site web de la société LANSROD : http://www.lansrod.com\n\nChef de projet MOA dans le cadre de la réalisation d'une application de gestion de ressources et de \nmissions \n\nTechnologies :\n\nJava/JEE, SCRUM\n\nActivités de gestion de projet\n\n    *    Mise en place d'un planning projet ; \n    *    Reporting détaillé de l'état d'avancement\n    *    Suivi du planning et de la charge consommée ; \n    *    Préparation des comités de suivi et des démonstrations en fin de chaque sprint\n\nActivités MOA\n\n    *    Recueil du besoin et élaboration des spécifications fonctionnelles générales et détaillées de\n    l'application\n    *    Faire des propositions de Template ; \n    *    Définition du backlog produit en collaboration avec l'équipe (équipe de 5 développeurs) ; \n    *    Définition de la priorité, complexité et estimation des users story du backlog produit dans le \n    cadre d'une réunion de planning pocker\n    *    Animer les réunions quotidiennes : daily meeting ; \n    *    Rédaction des scénarios de test de l'application", "duration": 44}, {"title": "Product Owner/Chef de projets", "description": ": Product Owner, Chef de projets - PMO\n\n\nClient : Ministère des affaires sociales :  Chef de projet  : 900 j/h, équipe de 10 personnes\nProjet Digital de refonte du système d'information relatif au client « Ministère des affaires sociales ».\n\n    * Mission : Développement & intégration de 2 nouveaux modules\n\nProjet financé par la banque mondiale qui consiste en un système d'informations composé de deux \nmodules d'aide à la décision: un module de gestion des enquêtes (partie web et partie mobile) et un \nmodule d'administration.\n\nActivités de gestion de projet\n\n    *    Gestion du planning ; \n    *    Organisation de la réunion de lancement du projet : kick-off ; \n    *    Organisation de Réunions (CoPil) et compte-rendu ; \n    *    Déploiement de la démarche qualité de la direction ; \n    *    Coordination entre les différents intervenants (MAS, Wevioo (AMOA)) ; \n    *    Animation des réunions hebdomadaires avec les intervenants en assurant une démonstration \n    des différentes phases du projet\n    *    Rédaction des PV des réunions", "duration": 95}, {"title": "Responsable de projet", "description": "* Mise en place d'un système d'informations pour le Pole sécuritaire de lutte contre le terrorisme \n    et le crime organisé (PSATCO) avec une variété de softwares et de hardwares :\n    * Outil d'analyse de données : i2 Notebook de IBM ; \n    * Outil de gestion électronique de données (GED : Alfresco) ; \n    * Outil de Crime Mapping : Maptitude de Caliper\n    * Outil de monitoring Zabbix\n    * Solution Fax Mailing\n    * Intranet avec un module de chat\n\nActivités de chef de projet\n\n    *    Coordination avec l'équipe de vente de la société Caliper concernant l'outil Maptitude de crime \n    mapping \n    *    Organisation de conf call de démonstration avec l'équipe de vente de Caliper ; \n    *    Installation d'une version démo de l'outil et faire des POC ; \n    *    Présentation des Proof of concept au PSATCO ; \n    *    Installation des licences achetées pour le PSATCO ; \n    *    Planification de la formation sur Maptitude avec la société Eigenvalue partenaire de Caliper ; \n    *    Assister à la formation ; \n    *    Organisation des séances de démonstrations aux 6 directions du PSATCO sur Alfrsco avec un \n    workflow spécifique à chaque direction \n    *    Planification d'une formation pratique et certifiante de l'outil i2 ; \n    *    Assister à la formation et coacher les membres du PSATCO avec le formateur ; \n    *    Ecriture d'un document d'installation de i2 et iBase de IBM ; \n    *    Faire une formation sur l'Intranet et son mode d'emploi ; \n    *    Coordination avec l'équipe infrastructure pour l'installation et la mise en place de l'outil de \n    monitoring Zabbix.", "duration": 76}, {"title": "MOA", "description": "Contexte  MOA pour le projet de développement d'une plate-forme de gestion des cartes SIM pour l'opérateur Tunisie Telecom. Ce projet a été évolué vers une application Android, avec la fonctionnalité de digitalisation des contrats de vente remontés. Cette digitalisation consiste en une reconnaissance des données à l'aide d'un OCR (Optical Caracter Recognition). Activités MOA • Collecte de besoin suite à des ateliers de spécifications • Ecrire les spécifications du produit suite à la collecte du besoin du client  • Rédiger les User Stories à destination des développeurs  • Assurer la complétude du backlog dans l'outil utilisé : Redmine • Interagir avec les développeurs, afin de garantir le respect des exigences du métier et des délais.  • Ecrire des guides d'utilisation, d'administration et d'implémentation pour l'application \n ", "duration": 20}, {"title": "Ingénieur développement", "description": "« Buggier » est un outil de gestion de bugs et de tickets clients. Cet outil est utilisé dans les 3\nsites du produit Sungard : Ambit APSYS. C'est un outil de suivi d'anomalies logicielles (bugs) basé sur \nune application lourde interfacée avec les pages Web du site intranet. Il est écrit langage VBA et \nutilise une base de données Access.\n\nRéalisation\n\n    Développement des interfaces web et des interfaces de l'application lourde « Buggier » :\ninterface de création du bug, de génération de release notes, de définition des différentes versions, de \ngénération de reporting avec un système de notification par mail aux personnes concernées...\n\n    Développement des interfaces web et des macros Excel pour la gestion du workflow de\ntraduction (décrit au niveau de la mission : Ingénieur qualité et documentation)\n\nContexte : VBA, SQL, PHP, Excel", "duration": 116}, {"title": "Ingénieur support", "description": "Assurer le support pour l'outil de gestion de bugs et de tickets client et de l'outil de gestion de\nprojets utilisé au sein de 3 sites.\n\nRéalisation\n\n    *    Assurer le support de l'application de gestion de workflow de maintenance et des bugs. ; \n    *    Assurer le support de l'application de gestion de projets ; \n    *    Assurer le support des nouvelles personnes dans l'équipe en mettant à leur disposition les \n    machines virtuelles nécessaires, les accès réseaux et mettre à leur disposition tout un \n    environnement de développement\n    *    Assurer des formations aux nouvelles personnes dans l'équipe concernant l'outil de gestion de \n    projet, l'outil de gestion de workflow de maintenance et des bugs et de l'utilisation de tous les \n    produits internes.", "duration": 47}, {"title": "Ingénieur qualité et documentation", "description": "Assurer la qualité technique du produit « APSYS » en faisant du code review et de la lecture\net analyse des logs.\n\n    Migrer tous les produits Microsoft utilisés par l'équipe vers les nouvelles versions de Microsoft\ntout en fournissant la documentation nécessaires.", "duration": 53}]}