{"id": 26, "title": "Consultant", "experience": [{"title": "Spécialiste de la protection électronique de biens et de personnes", "description": "(EN PARALLELE A LA BNP)\n\nNom du poste occupé : Assistant à la MOA\nÉtudes et analyses des besoins spécifiques en termes d'alimentation avec MS BI (SSIS) de la base \net de la génération des rapports (Excel) pour la gestion des achats, ventes, stocks.\n\n\nChallenge(s) / Objectifs de la mission\n* Générer les rapports Excel/ Cognos pour le département financier ; \n* Assurer le maintien en conditions opérationnelles de la plateforme SSIS\n\nRessources\n* 1 Consultant Confirmé COGNOS/QlickView\n* 1 Consultant Confirmé SAP\n* 1 Chef de projet BI\n\nTâches\n* Modélisation de la base de données pour les traitements journaliers ; \n* Chiffrage des demandes clients (Département financier) ; \n* Rédaction des dossiers de conceptions et des cahiers de tests des solutions proposées ; \n* Tâche 3\n\nRésultats\n* Autonomie et force de proposition ; \n* Adaptation et intégration rapide dans l'équipe projet\n\nEnvironnement technique/ fonctionnel / méthodologie\nSQL SERVER, SSIS, QLICKVIEW, COGNOS", "duration": 54}, {"title": "Référent DATASTAGE", "description": "Mes interventions au sein du Centre de service étaient dans le domaine Retail Banking & Services qui \nregroupe les réseaux des banques de détail et les services financiers spécialisés du Groupe, en France et \nà l'international.\n\nNom du poste occupé : Consultant DATASTAGE PX\n\n\nMon activité concerne le développement des flux d'alimentation de DWH et le respect des \nnormes, la rédaction des dossiers de conception, des cahiers de tests, la gestion des corrections \ndes anomalies et de la livraison des composants corrigés.\n\n\nChallenge(s) / Objectifs de la mission\n* Assurer le maintien en conditions opérationnelles de la plateforme Datastage ; \n* Appliquer et contrôler le respect des normes et des standards pour Datastage ; \n* Concevoir et réaliser l'industrialisation de l'exploitation de la plateforme Datastage\n\nRessources\n* Intervention sur des missions de Tierce Maintenance Applicative et de projets de refonte\nd'applications\n\nTâches\n* Accompagner de son savoir faire les équipes projets et TMA ; \n* Assurer le support Niv. 2 de l'exploitation ; \n* Définition des besoins utilisateurs et rédaction du cahier des charges ; \n* Rédaction des spécifications techniques et fonctionnelles ; \n* Réalisation et prise en charge des développements et du paramétrage de la solution souhaitée par \n    le client \n* Optimisation des applications ; \n* Réalisation des tests et de la recette des applications développées ainsi que leur documentation ; \n* Compréhension et analyse des problématiques techniques rencontrées\n\nRésultats\n* Référent DATASTAGE du centre de service BNP\n* Formation et assistance des utilisateurs\n\nEnvironnement technique/ fonctionnel / méthodologie\nDatastage PX (7.5, 8.1, 9.1), ORACLE, PL/SQL, TERADATA, UNIX, VB, Quality Center, ASAP, SVN,\n\nDimension.", "duration": 83}, {"title": "Développeur base de données", "description": "Leader mondial dans la grande distribution.\n\nNom du poste occupé : Développeur Base de données\n\n\nModélisation d'une base de données MS-Access permettant la gestion des entrepôts Casino en \nintégrant des indicateurs « Qualité » lors des livraisons et préparations des commandes pour les \nenseignes du groupe.\n\nChallenge(s) / Objectifs de la mission\n* Création des indicateurs de suivi de qualité dans les entrepôts de casino en France ; \n* Modélisation de la base de données", "duration": 70}]}