{"id": 39, "title": "consultant", "experience": [{"title": "Consultant Big Data", "description": "est un acteur mondial clé dans le marché des phosphates.\n\nChallenge(s) / Objectifs de la mission\n* Mettre en place une architecture pour suivre les données de tous les capteurs des machines de\nl'OCP en temps réel.\n* Lancer des alertes en cas de panne.\n\nRessources\n* Deux Data Engineer et un chef de projet.\n\nTâches\n* Intégrer dans une distribution Cloudera les technologies Kafka, Flume, Zoomdata ... ; \n* Développement de job Spark Streaming pour intégrer les données provenant des capteurs ; \n* Elaboration des dashbords avec Zoomdata.\n\nRésultats\n* Une architecture scalable, robuste et qui tolère les pannes. ; \n* Une application web de suivi en temps réel de tous les capteurs machines. ; \n* Déclanchement des alertes en cas de panne.\n\nEnvironnement technique/ fonctionnel / méthodologie\nDistribution Cloudera (Hadoop, HDFS, Sqoop, Oozie, Impala, Kafka, Flume, Spark), Java.\nMéthodologie Scrum.\n\n\nProjet 2 : Consultant Big Data\n\nChallenge(s) / Objectifs de la mission \n* Segmentation des employées de l'OCP selon leur taux d'absentéisme. ; \n* Prévoir le taux d'absentéisme pour lancer des actions RH.\n\nRessources\n* 4 Ressources dont deux Data Engineer et deux Data Scientist.\n\nTâches\n* Chargement de données avec Sqoop depuis une base de données Oracle vers un cluster Cloudera. ; \n* Transformation de données avec Impala pour l'obtention des ABT demandés par les Datascientists ; \n* Injection des résultats de la segmentation dans le Datawarehouse pour mise à disponibilité des \nsegments pour les utilisateurs.\n\n\n\nRésultats\n* Un Datawarehouse qui contient tous les données métier. ; \n* Construction des tables d'agrégat et du l'ABT. ; \n* Des modèles pour classifier les employées et prévoir le taux d'absentéisme. ; \n* Des tableaux de bord fournis aux métiers.\n\nEnvironnement technique/ fonctionnel / méthodologie\nDistribution Cloudera (Hadoop, HDFS, Sqoop, Oozie, Impala, Hive, Spark).\nSegmentation de données employées.\nMéthodologie Scrum", "duration": 83}, {"title": "Développeur SSIS", "description": "Challenge(s) / Objectifs de la mission \n* Gestion des données clients pour la chaîne des magasins Sehopra. ; \n* Satisfaction des évolutions et correctifs demandés par le client.\n\nRessources\n* 6 Ressources dont 3 développeurs, 2 testeurs et un chef de projet.\n\nTâches\n* Développement des jobs SSIS.\n* Rédaction des documents techniques. ; \n* Réalisation des tests unitaires et fonctionnels.\n\nRésultats\n* Maintien de la datamart des clients pour Sephora.\n\nEnvironnement technique/ fonctionnel / méthodologie\nSSIS, SSMS, SQL Server", "duration": 47}]}