{"id": 38, "title": "Consultant", "experience": [{"title": "Consultant Data Scientist", "description": "Réalisation de différents POCS afin de répondre à différentes problématiques en utilisant le\nMachine Learning & Deep Learning.\n\nChallenge(s) / Objectifs de la mission\n    * Un POC Sur le Marketing prédictif pour le site We Are Tennis du BNP Parisbas ; \n    * Un POC sur l'analyse textuelle d'une base de données des emails\n\nRessources\n    * L'équipe du Data Lab.\n\nTâches\n    *    POC sur le Marketing prédictif :\n\n    *    Exploration des données utilisateurs du site We Are Tennis ; \n    *    Analyse de l'audience\n    *    Analyse du comportement Utilisateurs\n    *    Segmentation des utilisateurs\n\n    *    POC sur l'analyse textuelle d'une base de données des emails :\n\n    *    Structuration des données textuelles (contenus des emails) ; \n    *    Nettoyage et standardisation des contenus ; \n    *    Calcul de similarités entre les contenus des mails ; \n    *    Réaliser un graphe permettant la représentation des interactions entre les personnes\n\n\nEnvironnement technique/ fonctionnel / méthodologie\nR-studio, R machine learning-packages, Python", "duration": 28}, {"title": "Consultant Data scientist/développeur", "description": "Projet ayant pour but l'amélioration du processus de contrôle et validation des données \nfinancières.\n\nChallenge(s) / Objectifs de la mission \n    * Exploration des données financières (Trade, Cashflow) afin de les comprendre et les maitriser ; \n    * Être capable de valider un fichier contenant un mois de données via des indicateurs basés sur \n    un benchmark\n\n\n\n    *    Être capable de détecter localement une anomalie au niveau d'un deal dans un fichier d'un mois \n    de données\n\nRessources\n    * Une équipe de 3 data scientists\n\nTâches\n    *    Exploration des données : \n    * Récupérer plusieurs fichiers de données de plusieurs mois et différentes sources du Datalake ; \n    *    Découvrir la structure des données, la typologie des variables ; \n    *    La réalisation des statistiques sur chaque fichier, afin de découvrir les variables importantes ; \n    *    La visualisation des données et les étudier variable par variable ; \n    *    L'étude des relations entre les variables, les dépendances et les corrélations ; \n    *    L'identification des variables importantes pour chaque type de données\n\n    *    Analyse de similarités : \n    * Afin de valider un fichier d'un mois de données, nous pouvons le comparer au mois \n    précédent ou à un benchmark validé pris de des données historiques selon certaines \n    caractéristiques intrinsèques\n    *    Construire un indicateur de similarité entre deux fichiers de données, en se basant sur le \n    calcul de similarité des caractéristiques statistiques des variables\n    *    Construire un deuxième indicateur de similarité basé sur les caractéristiques intrinsèques \n    des données, les corrélations entre les variables et leurs comportements dans les différents \n    fichiers\n\n    *    Détection d'anomalies : \n    *    Dans le fichier il peut y avoir des anomalies locales au niveau des Deals, il faudra les détecter \n    le plus vite possible\n    *    Pour détecter ces anomalies nous avons réalisé un modèle de détection basé sur\n    l'apprentissage non supervisé\n\n\n\n    *    Nous avons testé différents algorithmes de détection d'anomalies et adapté les modèles \n    selon le type des données. Les approches de détection d'anomalies testées sont :\n    -    Les techniques basées sur le plus proche voisin (k-nearest neighbor, local outlier factor) ; \n    -    Techniques basées sur Clustering (DBSCAN, k-means) ; \n    -    Les modèles graphiques probabilistes (réseau bayésien)\n\nRésultats\n    * Bonne Maitrise et compréhension des données et de leurs dynamiques après la phase \n    exploratoire\n    * Réalisation des indicateurs de validation globales des fichiers d'un mois de données financières ; \n    * Réalisation d'un modèle de détection d'anomalies capable d'identifier les deals présentant des \n    anomalies", "duration": 111}, {"title": "Stage ingénieur/analyste", "description": "Stage ingénieur : Data analyste & développeur\n\nStage effectué au laboratoire de l'ENSTA Paristech en coopération avec PSA.\nChallenge(s) / Objectifs de la mission\n    * Étudier la sensibilité des durées de vie des pièces automobiles vis-à-vis des imperfections dans \n    les conditions des tests et du fonctionnement", "duration": 10}]}