{"id": 2, "title": "Ingénieur d’études et de développement .Net / C#", "experience": [{"title": "Ingénieur d’études et de développement .Net", "description": "CONTEXTE :    Au sein du service Pôle Simulateurs Financiers.\n                \n                PROJET :    Application de gestion des locations et ventes des batteries pour véhicules électriques : E-LeaZE ; Gladisweb ; MoteurCEFI (Corporate Engine For Internet).\n\n                Effectif : 1 CP (Propriétaire du produit) + 1 Team Leader (Scrum Master) + 5 développeurs\n                \n                Méthode : Agile SCRUM. \n                \n                REALISATIONS :Etudes :\n                Analyse de l’existant,\n                Etude fonctionnelle et technique,\n                Recueil des besoins ;.\n                Développements :\n                Morning routine avec meeting tous les matins et une démo des développements toutes les deux semaines. Rétrospective de sprint à la fin de chaque itération,\n                Mise en place des configurations et des paramétrages de build des applications via TFS, \n                Analyse de code sous ASP.net pour restitution des fonctionnalités et documentation,\n                Correction de WebServices de l’application E-leaze sous WCF,\n                Développement des scripts batch pour dispatcher et d’archiver les artefacts des applications en fonction des environnements,\n                Développements et optimisations de l’’application MoteurCEFI en C# WPF,\n                Invoquer les procédures stockées dans la couche DAO,\n                Invoquer les méthodes de la couche DAO et les retourner sous forme Web services avec la technologie WCF,\n                Chantier WCF :\n                Ajout des modèles sérialisés (Data contract),\n                Ajout des interfaces de WCF (Service contract),\n                Implémentation des méthodes (Operation contract) des interfaces ;\n                Tests unitaires et tests de non régression des applications,\n                Livraison des applications en staging,\n                Rédactions des documentations et du manuel d’exploitation.", "duration": 40}, {"title": "Ingénieur d’études et de développement .Net ", "description": "CONTEXTE :Au sein du Centre de Régulation et d’Information Voyageur (CRIV), centres bus\n                \n                EQUIPE :   Application PHOEBUS (application RH des centres bus)\n\n                Effectif : 1 CP +10 développeurs\n                \n                \n                REALISATIONS :   Développements :\n                Développement des trois 3 interfaces de flux Infocentre, Arbus et Edition côté client en VB.Net 4.5\n                Développement des trois interfaces de flux côté serveur en Script Shell Linux et PL/SQL,\n                Création des tables pour les interfaces des différents modules,\n                Optimisation des modules ;\n                Tests :\n                Tests unitaires de l’application (développement et recette) et validation par les équipes,\n                Livraison de l’application en recette et en pré prod,\n                Rédactions des documentations et du manuel d’exploitation.\n                \n                \n                ENVIRONNEMENT :  VB.Net 4.5, Visual Studio 2013, Script Shell Linux, PL/SQL, Oracle 10.2, RedHat Entreprise Server 5.4, Toad for Oracle 9.7", "duration": 31}]}