{"id": 7, "title": "Full stack Laravel", "experience": [{"title": "Freelance - Développeur TYPO3 et Laravel", "description": "Conception de modèles logiques et conceptuels de données, et de\n                    bases de données selon des critères métiers.\n                    • Développement d’outils de gestion avec le Framework Laravel (ex :\n                    extranet d’un groupe immobilier pour gérer des opérations\n                    immobilières)\n                    • Utilisation de composer, npm, Bower et Gulp pour l’intégration de\n                    librairies depuis des gestionnaires de paquets, la minification de\n                    ressources CSS et JS\n                    • Utilisation de Git et de Gogs pour automatiser des déploiements\n                    • Développement CMS TYPO3 pour des entreprises privées et des\n                    collectivités publiques\n                    • Maintenance applicative\n                    • Rédaction de documentations\n                    • Développement Android / Firebase (base No SQL)", "duration": 115}, {"title": "Ingénieur d’étude et développement", "description": "Développements PHP5 sur CMS TYPO3\n                        • Rédaction de cahiers des charges techniques\n                        • Maintenance applicative et montées de version\n                        • Participation à des appels d’offre\n                        • Audits de sécurité en environnement Linux\n                        • Prestations de formations en anglais", "duration": 83}, {"title": "Ingénieur d’étude et développement", "description": "Contexte du projet : Développement du module Eclaireur (Projet VEILLE2012): Le projet Veille 2012 consiste à\n                        collecter les informations depuis les sites internet (appel d'offres) et les traiter pour avoir un avis final à intégrer\n                        dans la base de données Veille.\n                        Après collecte des informations (téléchargement des pièces jointes, normalisation des objets), le projet consistait à\n                        élaborer des scénarios de navigation sur des fichiers\n                        Equipe : 1 Scrum master, 1 chef de projet, 1 testeur et 8 développeurs.\n                        Réalisations :\n                        Réaction des spécifications techniques et fonctionnelles\n                        Développement\n                        Documentation\n                        Tests unitaires\n                        Environnement :\n                        C#, Framework 4.0, Visual Studio 2010, SQL Server 2008, SQL, Entity Framework,\n                        DevExpress, XML, XSD, XSL, NSB, NUnit, méthode agile (scrum), Resharper 7.", "duration": 79}]}